[
    {
        "job_title": "Practical Legal Training (PLT)",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Agape Henry Crux",
        "description": "Agape Henry Crux  is an innovative law firm in Sydney CBD with exclusive practice in Immigration and Administrative Law. We are a collegiate team, passionate and results-driven. We pride ourselves in thinking outside the box, we embrace the use of technology and digital automatisation to assist our naturally lazy self. \r\n We also have a young dynamic team promoting a fun working environment to enhance employee experience. We bring everyone closer together with regular social catch ups, PS4 and so much more. At Agape we position ourselves to be different to other firms in the industry, we keep our teams small to allow everyone to grow fast and provide opportunity to allow each and every one to step up making an impact in what we do. Our firm consists of 2 accredited specialists in immigration law (41 in NSW only), we are committed to our new talents and support the learning you need to grow.    \r\n  The Position  \r\n We are currently offering the last intake of the year for work experience placement as a component of Practical Legal Training (PLT). Depending on each individual growth and development during your placement at Agape, we are open to discussing a career progression post the 14 weeks program. As there are limited immigration legal practitioners within this industry, we commence selecting our team carefully, putting particular emphasis on culture where the necessary skills are progressively groomed under a mentorship program. We advertised throughout the year as we are always opening doors to new talents and creating positions. To see a day in our lives, check out our Instagram page @agape_henry_crux \r\n  The ideal candidate should:  \r\n \r\n Recently completed/ final year law degree \r\n Possess a strong interest in migration/administrative law \r\n Be motivated, pro-active, can-do attitude \r\n Have strong problem-solving skills \r\n Display good organisation and time management skills \r\n Ability to work independently and in a team \r\n \r\n  Making an application:  \r\n To learn more about this opportunity or to make an application, please send your CV with a cover letter to  talent.acquisition@ahclawyers.com"
    },
    {
        "job_title": "Graduate Law Student",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "ERA Legal",
        "description": "About us  \r\n ERA Legal is a law firm based in Sydney and Melbourne.  ERA Legal specialises in restructuring and insolvency, construction and projects, loans and securities, and dispute resolution.  \r\n We only do what we are good at – which means, this is a perfect place to hone your skills and learn from experienced senior lawyers.  We invest in our people and offer opportunities for mentoring, further learning, and career progression.  \r\n  About the team  \r\n The Construction and Projects team specialise in advising trades, builders, developers and occasionally home owners, on: \r\n \r\n documenting construction projects and assisting in risk allocation by advice on transactions (i.e. construction contracts) \r\n advice on risk management and dispute avoidance through advice and assistance with the administration of contracts; \r\n payments disputes under the  Security of Payment  legislative regimes in New South Wales and occasionally in Victoria and Queensland; and \r\n the resolution of a wide range of disputes in the construction industry. \r\n \r\n  About the role   \r\n Due to progressive growth, we are looking for a  graduate law student  to join our  Commercial & Projects  team based in  Sydney office.  This role gives you the opportunity to learn and to work directly with our construction practice-leaders and other experienced senior lawyers. This is a great pathway to navigate your career in commercial arena. \r\n  What we are looking for  \r\n \r\n We are looking for a full-time graduate law student in their penultimate year of university to work on a range of back-end and front-end construction matters.  \r\n Opportunity for career progression to lawyer and beyond. \r\n Must have strong: research skills, time management and organisation skills, ability to work autonomously, and a desire to learn.  \r\n \r\n   Apply today  \r\n Applications close on  1 November 2021 .  Please email with your latest resume with transcript to  law@eralegal.com.au  and  Shereen.Kumar@eralegal.com.au ."
    },
    {
        "job_title": "Practical Legal Training (PLT) / Student Placement - Volunteer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "White Knight Lawyers",
        "description": "Our firm  \r\n White Knight Lawyers is a rapidly growing Australian law firm which offers premium litigation, transactional, and advisory legal services. \r\n We generally practice in litigation and dispute resolution, insolvency and bankruptcy, tax controversy, commercial law and advisory, public law and construction law. \r\n We are currently engaged in diverse ongoing litigation work including proceedings before the Supreme Court of NSW and Supreme Court of Victoria, District Court of NSW, Federal Court of Australia, AAT, and NCAT (both original jurisdiction and appeal panel).   \r\n We pride ourselves on the quality of our work, developing relationships of trust with our clients, and efficiently delivering engagement-tailored legal services.  \r\n  Our available role  \r\n We are very excited to offer practical legal training to a recent law graduate on a volunteer basis.  \r\n We expect that you will be honest, diligent, and enthusiastic when carrying out the following tasks and responsibilities, amongst others: \r\n \r\n Attending client meetings and court hearings and taking minutes and file notes respectively. \r\n Assisting in the preparation of internal processes, procedures, policies, guidelines and protocols. \r\n Assisting in the preparation of precedent documents and checklists. \r\n Drafting publications and legal updates on topical legal issues across a wide range of areas of law. \r\n Undertaking legal research and drafting research memorandums. \r\n Drafting statements of claim, affidavits, and other forms and processes.  \r\n Administrative assistance including file management, diary maintenance, and office management. \r\n \r\n  About you  \r\n You must be committed to establishing a career in commercial private legal practice and have a keen interest in litigation and dispute resolution.  \r\n You must have a proven record of legal ability, whether by way of your academic success, prior industry experience, or relevant extracurricular activities.    \r\n  Your application  \r\n If you are interested in the above, then please email us your curriculum vitae, academic transcripts, and a sample of your writing (preferably one (1) academic piece and one (1) creative piece)."
    },
    {
        "job_title": "Family Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Cominos Family Lawyers",
        "description": "We are growing! \r\n An exciting and rare opportunity has opened for a Family Lawyer to join our vision and value based legal practice.   \r\n If you have at least 3 years Post Admission Experience and if you love family law, enjoy working in a cohesive and healthy work culture, and you are driven to achieve and deliver quality legal services. \r\n Then please send us your resume! \r\n  careers@cominoslawyers.com.au"
    },
    {
        "job_title": "Immigration Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Kah Lawyers",
        "description": "IMMIGRATION LAWYER  \r\n Kah Lawyers is one of Western Sydney's leading boutique Immigration law firms and is based in Parramatta CBD. Our principal lawyer is an accredited specialist in Immigration Law and has almost 25 years' experience. \r\n Our firm provides legal advice in all immigration matters including partner, employer sponsored, independent, skilled, family and refugee visas, cancellations and complex matters including AAT and Federal court work. \r\n Our lawyers are individuals who are passionate, committed, motivated and high-achievers from diverse backgrounds. We all share the same belief and our success is built on a foundation of diversity and inclusiveness. \r\n We have an exciting new opportunity for an immigration lawyer to join our busy practice. This is a full time position for the right candidate. \r\n  Job description  \r\n \r\n You will be involved in all aspects of law within the immigration portfolio. This will include but not limited to temporary and permanent visa applications including visa cancellations \r\n Administrative Appeals Tribunal applications \r\n Drafting, submissions and appearances; judicial review proceedings in Australia's Federal Circuit Court and Federal Court \r\n Advice and assistance with Ministerial intervention requests \r\n Have the ability to analyse and determine visa solutions \r\n The ability to advise and manage clients from beginning to the end of the visa process \r\n Conveyancing and wills and Estate work also possible \r\n \r\n     \r\n  Suitable candidates will have  \r\n \r\n Experience in preparing migration applications in all visa categories \r\n Ability to research legislative, policy and case law \r\n Ability to draft documents for the AAT \r\n Excellent interpersonal skills \r\n Excellent drafting skills \r\n Able to work independently and as part of a team \r\n At least two to three years' immigration experience \r\n Experience with LEAP Migration Manager an advantage \r\n A second language may be an advantage \r\n \r\n The successful candidate will be working alongside a highly regarded accredited specialist. \r\n Our firm offers internal/external training, mentoring from senior lawyers and professional development. Flexible work arrangements is available upon request. \r\n Please email your resume to michael@kahlawyers.com.  Be sure to include your academic transcript and a cover letter explaining your interest in the role. \r\n Salary will be commensurate with experience."
    },
    {
        "job_title": "PLT Part Time",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Keith R Cameron Solicitors",
        "description": "Keith R Cameron Solicitors is a boutique firm in Hampton, Victoria with availability for PLT students for 15 day placements.  \r\n The firm practices in a number of areas including Property & Conveyancing, Wills & Estates, Family Law and Litigation, as well as miscellaneous legal matters. \r\n The ideal candidate would have the following qualities: \r\n \r\n Strong verbal and written communication skills \r\n Strong computer skills \r\n Attention to detail \r\n Excellent time management \r\n \r\n The position will involve the following duties: \r\n \r\n File management \r\n Client contact \r\n Legal research \r\n Direct support to the principal  \r\n \r\n Please note part time positions are available commencing October 2021 (subject to COVID restrictions) \r\n Please send your academic transcript, resume and available dates to  office@kcsolicitors.com.au"
    },
    {
        "job_title": "Junior Family Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Johnstone and Reimer Lawyers",
        "description": "Our Lilydale based firm has a need for a junior family lawyer who is looking for a varied and fulfilling role in a supportive, positive workplace. \r\n The successful applicant would join our busy family law team working under a senior lawyer handling family law files. \r\n The successful applicant will have an outgoing, caring, and compassionate personality and a genuine interest in family law. \r\n Further, excellent written skills are required with a strong attention detail, along with an ability to work efficiently. Excellent time management skills are a must. \r\n The characteristics we most value in an applicant are a proven strong work ethic and \"can do\" attitude. \r\n While this role is suitable for a recently admitted lawyer, a graduate pre-admission may be considered if they have strong relevant experience in family law. \r\n This role will be based at our Lilydale office, however there will be an expectation that the successful applicant be willing to work at least one day a week from our Berwick office in Melbourne's South Eastern suburbs. \r\n Apply today by uploading a cover letter and resume."
    },
    {
        "job_title": "PLT Placement - Family Law",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Hogg and Associates Lawyers",
        "description": "Hogg and Associates Lawyers is a boutique Family Law firm in the Summer Hill Village in Sydney’s Inner West. \r\n We are currently offering a work experience placement, which would be suitable as a component of Practical Legal Training (PLT). The placement is voluntary and is offered on a part-time basis (2-3 days per week). \r\n Your responsibilities may include: \r\n \r\n Assisting our solicitors with drafting court documents and correspondence, \r\n Assisting solicitors at court attendances, \r\n File management and preparation of briefs for hearing, \r\n Reviewing documents, \r\n Undertaking legal research, \r\n Drafting articles, and \r\n General administrative tasks. \r\n \r\n The successful candidate will have; \r\n \r\n Completed Bachelor of Laws (or have almost completed the same) \r\n A keen interest in Family Law, \r\n Completed studies in Family Law, \r\n Excellent attention to detail, \r\n An ability to follow instructions, \r\n Excellent verbal and written communication skills, and \r\n A willingness to help and assist clients and staff with any tasks as required. \r\n \r\n At Hogg and Associates Lawyers, we enjoy working with the students who complete their Practical Legal Training with us and will strive to provide you with valuable experience to set you up for your legal career. \r\n You can find out more about our firm at  www.hogglawyers.com.au .  \r\n To apply, please send your CV together with a one page covering letter addressed to  \r\n Elizabeth Hogg \r\n at the email address provided.  \r\n Applications close 14 October 2021"
    },
    {
        "job_title": "NZ - Practising Graduate",
        "job_type": "Contract",
        "date_posted": "Sep 23, 2021",
        "company": "Emerald Green Investments",
        "description": "Looking for a graduate who is familiar with Wills and has an interest in the structure of Wills  and Trust Law to work on a small to medium project.  \r\n For more information, call Mark on 0212618304."
    },
    {
        "job_title": "Junior Property Lawyer",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Coombes Property Group",
        "description": "We are looking for a final year law student who is a commercially minded, well rounded, and dedicated professional who is passionate about property. This role will initially be part-time until February 2022, when it will pivot to a full-time role. The selected candidate will work closely with our experienced General Counsel and the wider business in the areas of lease and landlord management."
    },
    {
        "job_title": "Leader, Wills & Estates team and Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "LadyBird Law",
        "description": "STUDENT PLACEMENT - KEY LEARNING OPPORTUNITIES   \r\n \r\n Learn the overall working of a Wills and Estate Planning business \r\n Exposure to the LadyBird Conveyancing \r\n Test the waters to see if this is the career pathway for you! \r\n \r\n   PRIMARY WORK EXPERIENCE PLACEMENT FUNCTION & TASKS  \r\n \r\n Get exposure to all phases of the business – Prospecting, Preparation for meeting with clients, Meeting with clients, Core work, and all administration phases post the final meeting \r\n Manage all enquiries/referrals into our custom-built software and industry software LEAP and maintain all elements relating to the client journey. \r\n Send initial letters from LEAP to the client with Trust Account authorities \r\n Set up client zoom and face to face meetings and issue relevant letters and advice through the client’s journey. \r\n Create invoices in LEAP, issue draft invoices to the client and receipt in LEAP any monies received into trust \r\n Drafting of Wills, Enduring Power of Attorney’s (EPOAs), Statutory Declarations and Advance Health Directives. \r\n Completion of Binding Death Benefit Nomination Forms for Super/Insurance \r\n Send final letter to the clients with a copy of their documents \r\n Manage the archiving process. This includes a wide variety of basic administration activities through to preparing security envelopes and updating our software with executors and beneficiary details. \r\n \r\n   HOW TO APPLY   \r\n \r\n Send your CV with a covering letter to Amy at (amy@lblaw.com.au) outlining:\r\n \r\n Your motivation to apply and relevant experience. \r\n Your availability (i.e., days of the week, and how many weeks). \r\n \r\n \r\n You may make enquiries by calling Amy on 0498 043 405."
    },
    {
        "job_title": "Intern",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "No Borders Law Group",
        "description": "Interns to gain legal knowledge   \r\n We are a legal practice which has specialised in Australian migration law for over 20 years.  Over the years we have assisted a multitude of clients and businesses and mentored many lawyers and paralegals, many of whom have become accomplished immigration lawyers themselves.   \r\n We currently offering unpaid internship for students who require to meet the PLT placement requirement. \r\n No Borders Law Group is an exciting, fast spaced and dynamic legal firm  where we value our clients. \r\n See you soon. \r\n  reception@nobordersgroup.com.au"
    },
    {
        "job_title": "Graduate Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Dwyer Harris",
        "description": "Dwyer Harris is a business law firm in North Sydney. Our main areas of practice include: \r\n \r\n Banking, financial services and credit. \r\n General corporate and commercial. \r\n Business regulation and compliance. \r\n Competition and consumer law. \r\n \r\n We are seeking a graduate lawyer for a full-time role to work on a range of business law matters such as: \r\n \r\n Regulatory advice, particularly in relation to credit and financial services and competition and consumer law. \r\n Corporate/commercial advice and transactions. \r\n Dispute resolution. \r\n \r\n The role would also involve assistance with business development including research and writing articles and preparing presentations. \r\n The successful candidate will have: \r\n \r\n A strong academic record. \r\n An interest in financial services, competition and consumer law (study of these subjects in your degree would assist). \r\n Technical competence. \r\n Drafting accuracy and attention to detail. \r\n Excellent written and oral English. \r\n Client relationship and business development skills. \r\n Ability to work in a team and willingness to learn. \r\n \r\n Previous work experience would be an advantage. \r\n Please send your covering letter and your resume to admin@dwyerharris.com \r\n Only shortlisted candidates will be contacted."
    },
    {
        "job_title": "EOI - Independent Contractor -Oral Assessors, Workshop Facilitators and Online Mentors - QLD",
        "job_type": "Contract",
        "date_posted": "Sep 23, 2021",
        "company": "The College of Law",
        "description": "Practical Legal Training Independent Contractor - Oral Assessors, Workshop Facilitators and Online Mentors The College of Law Queensland invites expressions of interest    \r\n  Expressions of Interest Sought  The College of Law invites expressions of interest from suitably qualified legal practitioners who wish to be engaged as oral assessors, workshop facilitators and online mentors as described below. Engagement in these Independent Contractor roles is conducted on an as needs and when required basis. \r\n  The requirements  Oral Assessors, workshop facilitators and online mentors are responsible for providing students with a high quality learning experience whilst they are completing their PLT. \r\n \r\n  Oral Assessors  are responsible for assessing students periodically throughout their PLT courses via video and or tele conference. Assessors are engaged on half or full day basis. \r\n  Workshop facilitators  are responsible for facilitating students’ teaching and learning during the face-to-face one week professional skills course that is delivered at the beginning of each intake. Engagement may be for one or more half or full day workshops for one or more of the professional skills courses. \r\n  Online Mentors  are responsible for providing feedback on coursework submission s and otherwise mentoring students during their PLT Program. \r\n \r\n We are currently looking to engage a number of adjunct lecturers for our Queensland Practical Legal Training program. Teaching would be on an as and when required basis and both face to face and online. This is an opportunity to work flexibly as part of a dynamic and highly engaged team. \r\n  Required qualifications and experience:  \r\n \r\n Admission as an Australian Legal Practitioner \r\n Minimum 5 years’ experience in legal practice \r\n Demonstrated aptitude for teaching \r\n Enthusiasm for the development and continual improvement of teaching skills \r\n Demonstrated ability to work cooperatively with colleagues in a team \r\n An enthusiasm for the practice of law and an ability to communicate that enthusiasm \r\n An understanding of the strategic context of the legal profession and its associated industries \r\n Excellent communication skills, both oral and written \r\n Demonstrated capacity or willingness to contribute to the creation and maintenance of course materials (multi-media and online), stakeholder liaison and project management \r\n Sound project management skills with demonstrated ability to multi-task and achieve priorities within tight timelines \r\n Awareness of educational technologies including online delivery \r\n Proficiency in use of MS Office \r\n \r\n Independent contractors must have an Australian Business Number (ABN). \r\n If you are interested in being part of a growing national operation, please email your resume and covering letter to  hr@collaw.edu.au by COB 29 September 2021"
    },
    {
        "job_title": "Paralegal",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Criminal Law Group",
        "description": "Criminal Law Group is a boutique law firm in the heart of Liverpool specialising in Criminal Law. \r\n We are seeking a PLT Candidate to complete the work experience component of the PLT program.  \r\n The full-time placement is unpaid and available immediately with potential employment opportunity as a junior solicitor after admission.  \r\n If you are interested in challenging tasks, working in fast pace while learning new skills, then this is the position for you! \r\n  Job tasks and responsibilities will include  \r\n \r\n Appear in Court. \r\n Instruct Counsel in various types of matters in a range of jurisdictions. including Local Courts, District Courts and Supreme Court. \r\n Travel to and from various Courts \r\n Liaise with various members of the profession as well as clients and others on a regular basis. \r\n Conference clients  \r\n Legal research.  \r\n Summarise and prepare briefs.  \r\n \r\n  Skills and experience  \r\n \r\n Excellent communication skills (both written and oral) \r\n Work well under pressure \r\n Attention to detail  \r\n Be organised and able to maintain professionalism  \r\n Ability to maintain tidy files"
    },
    {
        "job_title": "PLT Placement - Full time/Part time Unpaid",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "NS Legal Pty Ltd",
        "description": "About Us  \r\n We are a young and growing law firm in the heart of Sydney CBD. \r\n We are committed to providing high-quality legal services to clients in Australia and abroad in all major areas, including Property Law, Divorce & Family Law, Civil Disputes, Litigation, Commercial Law, Wills and Estates. We use ingenuity & creativity to best address our clients’ needs and work to rigorously achieve their goals. \r\n We are excited to offer practical legal training placement on a volunteer basis in our Sydney Head Office. The role will suit a penultimate/final year law student or recent graduate and is available immediately. \r\n  Main Duties/Responsibilities  \r\n \r\n You will be assisting the principal solicitor with a full range of services across a number of areas, such as Commercial (general advisory), Family Law, Conveyancing/property law, and Immigration law. \r\n Conducting legal research, handling legal documents, file administration and assisting in a general carriage. \r\n Managing the progress of client files, leaving file notes and meeting deadlines. \r\n Keeping up to date with policy, regulation, and industry changes. \r\n \r\n  You bring to the role  \r\n \r\n Penultimate or final year of a law degree of an Australian law school (LLB or JD). \r\n Be able to work at least 2 days a week. \r\n Experience with Leap and PEXA preferred. \r\n Prior experience with conveyancing or knowledge of property law will be highly regarded. \r\n A good understanding of legislation and legal research skills. \r\n Fluent English, especially in legal writing, and ideally fluent Mandarin/Cantonese Speaking. \r\n \r\n If you're interested in the position– please send your cover letter, resume and academic transcript to  info@nslegal.com.au"
    },
    {
        "job_title": "Training Officer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Department of Justice and Attorney General, Queensland",
        "description": "An exciting opportunity is currently available to join the Dispute Resolution Branch’s Training Team in the role of  “ Training Officer  ” as part of the Department of Justice and Attorney General, Queensland Government.   The current vacancy is for a Full time flexible (Permanent position) based in Brisbane, Queensland.   \r\n For more information including an in depth description of the role description, merit criteria and how to apply , please visit the following link:  Job search | Employment and jobs | Queensland Government (smartjobs.qld.gov.au) . or c/or url:  https://smartjobs.qld.gov.au/jobs/QLD-384196-21  \r\n Applications will close on   Monday,      September 13 th , 2021  .  \r\n The Dispute Resolution Branch is a Recognised Mediator Accreditation Body (RMAB) pursuant to the NMAS and delivers a wide range of training and professional development courses relating to mediation, conflict management, effective communication and conflict coaching. \r\n This opportunity may be of interest to your networks. \r\n Should you wish to make any further enquiries, please feel free to contact the Dispute Resolution Training Team c/o:  07 3738 7017 or via email  trainingdrb@justice.qld.gov.au"
    },
    {
        "job_title": "Junior Solicitor",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Bransgroves Lawyers",
        "description": "Bransgroves Lawyers is a boutique law firm (10 staff) that specialises in acting on banking and finance transactions and finance-related litigation in the Supreme Courts of NSW, Qld and Vic.  \r\n  By joining our merry band you are signing up to fast track your career. We have a very flat structure and the emphasis is to get you running your own matters (under supervision, of course) as soon as possible. Two of our partners are published legal academics. We are known throughout the industry as being highly competent due to our strong emphasise on the legal research and staff training. This makes you not only highly skilled very quickly but makes you eminently employable. Your practical legal education will continue as quickly as you can learn as our senior partners (who have been at the firm for 20 and 16 years respectively) delight in mentoring the next generation of top lawyers.  \r\n  Most solicitors in our firm work 3 days in the office and 2 days at home. However we have 3 full time staff who never come in. We are a virtually a virtual firm, during Covid lockdowns we all work from home. Due to the wonders of Zoom, PEXA and other cloud based systems we are 100% paperless and all our work is done through Chrome.  \r\n  We only maintain offices so that our solicitors can have social interaction and get away from home when they have cabin fever. We have physical offices in Sydney's MLC building, Northbridge (NSW) and on the Sunshine Coast.  \r\n  We have weekly Zoom meetings and an annual boat party. We are very busy and looking for bright and ambitious solicitors to help us grow. You will be running your own cases and handling your own client portfolio within two years and within 3-4 years you will be on a six figure salary.  \r\n  Our 5 partners are leaders in their field and make top class mentors. We are open to solicitors who are interstate working 100% from home. Our flexible arrangements suit parents and students (we have three parents).  \r\n  Once you are up and running (around six months) in addition to your base we will also pay a percentage of your recovered fees to you as a bonus. This is calculated and paid weekly.  \r\n  This position would suit a law graduate, up to 4 year PQE or person returning to the law after a long hiatus. Your starting salary will be negotiated based on your experienced. The nature of our work is that there are plenty of things you can do with little or no skill (following our procedures manual and automated checklists), then as you progress you gradually absorb more and more of the law and a deeper understanding of what you are doing. This allows you to progress onto more complex and challenging work.  \r\n  The wand chooses the wizard and the lawyer chooses the firm…"
    },
    {
        "job_title": "Trainee Law Clerk, Conveyancer, Probates",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "MDH Legal Pty ltd",
        "description": "We are small practice in Osborne Park and would welcome a fulltime staff member (ideally) or possibly 2 job share roles (must be able to work school holidays full time) to join our team. We have a large conveyancing practice, wills and probate. The position is elementary and training will be provided. Advantage to persons with experience in property law, conveyancing, PEXA and Settlements Plus. Salary reflective of role and position. Full time trainee anticipated at $40,000k plus super and entitlements. Opportunity for quick development and salary increase."
    },
    {
        "job_title": "Opportunity for a bilingual PLT",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "STC Lawyers and Associates",
        "description": "STC Lawyers is a boutique law firm located in Hurstville that predominately specialises in Migration Law and other types of transaction legal services such as property conveyancing. \r\n We currently offer an opportunity for PLT placement with an offer to extend to a part time/full time role for the right candidate.  \r\n Office hours: Monday to Friday 10am to 7.30pm \r\n What we offer: \r\n \r\n PLT work experience under principal lawyer. \r\n Opportunity to be offered a full time paralegal/junior solicitor role. \r\n Opportunity to work in a transactional type/business orientated law firm. \r\n Opportunity to learn under an Immigration legal expert. \r\n Exposure to high net worth individuals and corporate clients. \r\n Strong local and international resources for an ambitious candidate to grow alongside the firm. \r\n \r\n Required Skillsets: \r\n \r\n Fluent in English and Mandarin Chinese \r\n Highly organised and attention to detail \r\n Ability to work independently without supervision \r\n Prior experience in Immigration, property or family law preferred (not mandatory) \r\n Experience in marketing/sales/website management also preferred \r\n Have common sense and basic Microsoft experience including word, excel, email etc \r\n \r\n Job description: \r\n \r\n Conduct legal research on complex law cases. \r\n Assist senior lawyer to draft legal submissions for a wide range of case types. \r\n Attend tribunal hearings, property settlements and other legal errands. \r\n Prepare, draft and organise application forms and required documentation. \r\n Independently manage cases, including liaising with client for required documentation from beginning to end of a legal matter. \r\n Able to professionally communicate with clients from both office walk in and via e-mail or phone. \r\n Provide other admin support as necessary, including assistance with marketing brochures, client alerts, legal regulation/policy updates, translations, website & media updating. \r\n \r\n For interested candidates, please send through your CV, academic transcripts to  Info@stc-lawyers.com ."
    }
][
    {
        "job_title": "Legal Project Manager / Sales",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "OpenLegal",
        "description": "The Role  \r\n  Our legal project managers are responsible for receiving new client enquiries, scoping requirements, and then converting them to becoming OpenLegal clients.  \r\n  The role calls for an enthusiastic closer, with a well-structured approach and a positive can-do attitude.   \r\n  This is a sales based legal role, and you will be working closely with the founders and a growing cohort of colleagues.  \r\n  This can be either a part time or full time role.  \r\n  About OpenLegal  \r\n OpenLegal is a commercial law firm servicing startups, small and growing businesses nationally. Our practise areas cover company formation, employment law, IP, franchising, debt recovery, business sales and purchases, mergers, disputes and litigation, commercial contracts, and more.  \r\n  What you would do  \r\n  A typical day may see you:  \r\n \r\n  Fielding phone calls and speaking to potential clients  \r\n  Responding to inbound emails and messages  \r\n  Speaking with current clients to ensure they are satisfied with the service level  \r\n  Assisting marketing efforts - social, email, linkedin, SEM, SEO etc  \r\n  Working with lawyers, founders, paralegals  \r\n  Helping founders develop strategic initiatives  \r\n  Working with the accounts team  \r\n  Helping to build our team and culture  \r\n \r\n  About You  \r\n  To be successful in this role you will be skilled demonstrating the following:  \r\n \r\n  Strong sales ability  \r\n  Great communication skills  \r\n  Ability to establish rapport and build trust with prospective clients  \r\n  Ability to quickly identify relevant legal issues  \r\n  Exposure to online marketing and sales - content, social, & email marketing  \r\n  Experience (or quick ability to become familiar) with commercial law   \r\n  Ability to work well within a team as well as autonomously  \r\n  Contributing to building the firm’s client base and reputation  \r\n  Strong digital skills  \r\n  Self-initiative  \r\n \r\n  Perks and Benefits  \r\n \r\n  Relaxed, open and friendly culture.  \r\n  Work closely with the experienced principal of the practice.  \r\n  Opportunity to potentially lead the project management team, or to transition into becoming a lawyer.  \r\n  The firm is growing fast - great opportunities for advancement.  \r\n  We are evolving what a law firm can be. We build our own technology, move fast, and have the culture, hustle, and fun of a startup. We provide an accessible and open customer experience, and are motivated by disrupting the way legal services have traditionally been provided.  \r\n \r\n  How to Apply  \r\n  Email your resume to  careers@openlegal.com.au . Please don't call the office. All applications and enquiries will be treated in confidence."
    },
    {
        "job_title": "PLT Work Experience Placement",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Hyde Park Lawyers",
        "description": "Hyde Park Lawyers is a firm based next to the Supreme Court of New South Wales. The firm's practice areas include Commercial Law, Property Law, Family Law, Criminal Defence, and Migration Law.  \r\n We are currently seeking to employ a PLT student to assist the principal solicitor. This position is on a part time basis with a minimum requirement of working 3 days per week. \r\n  About you  \r\n Duties will include, but not limited to: \r\n \r\n Conducting legal research; \r\n Draft correspondences； \r\n Assisting in litigation matters; \r\n Assisting in conveyancing matters; \r\n Document and file management; \r\n Preparing documents for delivery, scanning and post; and \r\n Lodgement of documents at relevant governmental authorities. \r\n \r\n You must possess the following qualities: \r\n \r\n Good level of Mandarin is essential; \r\n Be punctual and have excellent attention to detail; \r\n Possess a can-do and proactive attitude; \r\n Be able to work independently; and \r\n Good communication skills both written and verbal \r\n \r\n All cover letters and resumes must be addressed to  Mr. David Wang  and forwarded to   admin@hydeparklawyers.com.au   \r\n Please note that this position will on an unpaid basis. \r\n Past work experience/internship at a private practice is preferred. \r\n Only short-listed candidates will be contacted."
    },
    {
        "job_title": "Junior Solicitor",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "AHL Legal",
        "description": "OUR FIRM   \r\n AHL Legal prides ourselves in being able to provide top quality services for clients who require assistance in navigating the legal systems of Australia and China.  \r\n The strengthening of business ties between China and Australia has led to us specialising in litigation and corporate law. However, our growing business continues to cater to most areas of law that our clients are involved with, and we hope to expand in order to cater to every Chinese-Australian in need, both new and established. We continue to work on important and high-profile cases in both countries, using our expertise and language proficiency to service our clients in both Australia and China. \r\n As a professional litigation law firm, AHL Legal maintains excellent long-term cooperative relationships with many of Australia’s leading Queen’s Counsels and Senior Counsels in various litigation fields and has established strategic partnerships with well-known barristers.  \r\n We are seeking talented, responsible individuals who are interested in gaining experience and being part of our team.   \r\n Our state of the art technology and our international scope of legal practice enables you to experience being at the forefront of the legal industry.   \r\n If you are a graduated or junior solicitor, and you have at least 1 year of work experience (as a solicitor or paralegal), then this could be the opportunity for you.  \r\n  The Role   \r\n AHL Legal is looking for a solicitor interested to work in our firm in Sydney CBD Office and/or Burwood Office. \r\n You will be working alongside senior lawyers in a number of areas such as:  \r\n \r\n Litigation  \r\n Commercial (general advisory)  \r\n Family Law  \r\n Criminal Law  \r\n Immigration  \r\n \r\n You will gain first-hand experience in areas such as:  \r\n \r\n Preparing important court documents and witness statements  \r\n Interacting with clients and helping clients solve real-life situations  \r\n Collaborating with barristers and senior counsel  \r\n Handling legal documents, file administration and assisting in a general manner  \r\n Conducting legal research  \r\n \r\n  Candidate Requirements   \r\n \r\n Chinese language capability (ability to listen and understand is a minimum requirement)  \r\n Minimum of 1-2 years’ post-admission experience  \r\n Excellent written and verbal communication skills   \r\n Attention to detail  \r\n Ability to work within a team and autonomously  \r\n \r\n  Further Benefits   \r\n \r\n Opportunities to contribute to a pro bono program to give back to our community  \r\n An appealing base salary and further performance-based incentives  \r\n Access to strong mentorship  \r\n Online support through our company’s communication interface  \r\n \r\n  How to Apply   \r\n Get in touch with us at hr@ahllegal.com  \r\n Please include:   \r\n \r\n Resume \r\n 1-page cover letter \r\n Legal degree transcript \r\n \r\n For more information about AHL Legal, please visit  ahllegal.com"
    },
    {
        "job_title": "Paralegal/Tax lawyer",
        "job_type": "Contract",
        "date_posted": "Sep 23, 2021",
        "company": "Waterhouse Lawyers",
        "description": "We are a boutique law firm which specialises solely in tax. \r\n Due to Covid we have an urgent need for a para legal or tax lawyer who lives in a 5 km radius of Potts Point.   \r\n This is a casual position at this stage. \r\n Please send us your CV if you think you might be a good fit and are willing to learn."
    },
    {
        "job_title": "PLT intern",
        "job_type": "Contract",
        "date_posted": "Sep 23, 2021",
        "company": "Everyday Justice",
        "description": "Everyday Justice - Job description for a PLT intern  \r\n Everyday Justice is a new not-for-profit law firm owned by Mills Oakley, one of Australia’s leading law firms. Everyday Justice is dedicated to providing legal services to the ‘missing middle’ - people who require legal assistance but cannot obtain Legal Aid or access the legal system without incurring substantial financial hardship. \r\n Everyday Justice offers free legal services in the areas of employment law, tenancy, credit & debt, bankruptcy, financial abuse, fines & infringements, human rights, environmental and other areas of public interest. The firm will develop and use innovative legal tech solutions to deliver these free legal services as effectively and efficiently as possible.  More information about the firm can be found at  https://everydayjustice.com.au  \r\n Everyday Justice is proud to partner with The College of Law on this new initiative. With their support, Everyday Justice has created a holistic learning environment for law graduates who are undertaking the Practical Legal Training (‘PLT’) program and newly qualified lawyers who are interested in gaining legal experience in social justice and public interest matters. \r\n  The Role  \r\n Everyday Justice is looking for motivated PLT students or recently qualified lawyers to join Everyday Justice as legal intern on a volunteer basis in our Sydney, Melbourne, Brisbane, Canberra and Perth offices. \r\n You will be working under the direct supervision of leading professionals in the social justice sector, who are committed to providing interns with a supportive, stimulating and diverse learning environment. \r\n All legal interns will undertake a comprehensive training program covering all areas of Everyday Justice’s practice, as well as training on the practical skills needed to build a strong foundation for a career in the social justice or public interest law sector. In addition, you will have access to senior lawyers from Mills Oakley, who will act as mentors throughout your internship. \r\n The role will be fast-paced, dynamic and varied. It will involve individual client work in a wide range of practice areas, allowing you to make a meaningful impact on the lives of those in need of free legal services. \r\n  Who We Are Looking For  \r\n The ideal candidate will have: \r\n \r\n Completed their law degree and either be eligible to commence Practical Legal Training or have recently completed Practical Legal Training; \r\n Strong written and verbal communication skills; \r\n Strong attention to detail; \r\n An interest in developing legal experience in Everyday Justice’s practice areas; \r\n A demonstrated understanding of and commitment to social justice; \r\n The ability to work independently or as part of a team; and \r\n Availability to start volunteering in late February – early March 2021. \r\n \r\n This is a voluntary, unpaid position. Everyday Justice will negotiate working hours suitable to both the ideal candidate and the firm. \r\n  Apply  \r\n Applicants are encouraged to apply as soon as possible, by submitting their CV and a cover letter responding to the selection criteria to Amy Burton, Managing Lawyer at  info@everydayjustice.com.au ."
    },
    {
        "job_title": "Paralegal - Casual",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Vicinity Centres",
        "description": "W    e are Vicinity Centres. You may not recognise the brand but we’re sure you’ll know some of our destinations, from the iconic Queen Victoria Building in Sydney to Chadstone – The Fashion Capital, our seven DFOs, and much loved centres that are the hub of each of their communities. All in all, we operate over 60 centres across Australia.   \r\n  Role purpose  \r\n Reporting to the Paralegal and Legal Operations Manager, you will be responsible for assisting the Legal, Governance, Risk and Safety team with high level legal and administrative support. The role will involve carrying out various tasks, including reviewing a wide range of contracts, assisting with compiling reports, maintaining business registers, attending to execution of documents, and conducting legal research. \r\n   \r\n  What will you  bring?                                                                                        \r\n You will be an experienced paralegal or law student who is accustomed to working in a fast paced, complex corporate environment.  You will be an outstanding team player, with excellent communication and interpersonal skills, including the ability to foster and maintain strong working relationships.  You will be known for your excellent time management skills, attention to detail and ability to maintain confidentiality of information.  Studying towards a tertiary qualification in law is essential. \r\n   \r\n  What will success look  like?                                                           \r\n  We Imagine a Better Way  \r\n \r\n You constantly seek to learn and apply the knowledge quickly and effectively. \r\n You are confident in speaking up and can identify and recommend new ways of working. \r\n You are a quick learner, adaptable and open to new challenges. \r\n \r\n  We Embrace Difference  \r\n \r\n You understand the diverse nature of our business, our customers and our people. \r\n You consistently demonstrate a willingness to learn and try new ways of working. \r\n You engage with and listen to others to understand diverse views. \r\n \r\n  We Always Collaborate  \r\n \r\n You are an excellent team player who enjoys building relationships. \r\n You actively contribute to a positive environment within the team. \r\n You communicate in a clear concise manner, effectively sharing information. \r\n \r\n   \r\n  Why Vicinity?   \r\n Our benefits program focuses on creating an awesome place to work in which our people are rewarded and recognised. \r\n   Our     values cultivate a culture that encourages our 1100+ team members to be adaptable, agile, resilient and passionate. At Vicinity we embrace difference. We are committed to creating an inclusive work environment that supports diversity and flexibility.   \r\n   \r\n    Note:   To   be eligible to apply for this position, you must have existing, relevant Australian work rights. At the later stages of the recruitment process the shortlisted candidate/candidates will be required to undergo a Criminal History Background/Police Check as a mandatory part of the process. Additional qualification checks may also be required dependant on role and level."
    },
    {
        "job_title": "Unpaid PLT position - Work from home",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "OUYANG & LEE LAWYERS",
        "description": "Working from home-PLT part time position  \r\n  Ou Yang & Lee Associates Pty Ltd  is a fast growing innovative law firm located in Killara. At Ouyang & Lee Associates, it is all about finding the perfect solutions for our clients in migration law, IP, litigation, family law, government grant, commercial and criminal law. \r\n We are currently offering a work experience placement as a component of Practical Legal Training (unpaid position). The successful applicant will be working in the areas of Migration Law,  Corporations Law, Contract law, Family Law, Commercial litigation, FCC appeal, IP and Government Grant, ect. \r\n You will also be involved in the legal practice innovation program and building an online national legal service platform. \r\n  Duties may include but not limited to the followings : \r\n \r\n Drafting of legal documents \r\n Drafting correspondences \r\n Drafting letter of demands; \r\n Drafting settlement offers; \r\n Filing documents into court, \r\n Compiling evidence \r\n Liaison with different parties, \r\n General administrative works. \r\n \r\n   To be successful, a candidate must be:  \r\n \r\n Have completed or be close to completing College of Law, or its equivalent at a participating university; \r\n Strong written and verbal communication and interpersonal skills \r\n Good attention to detail and time management skills \r\n Be able to work 2-3 days a week (block placements are unlikely as it affects the number of volunteers we can offer a placement) \r\n \r\n Only short listed candidates will be notified. Due to the lockdown restrictions, we will require all staff to work from home using Teamviewer or Anydesk to work on clients' files. \r\n Please send your resume and cover letter to  info@oyllawyers.com.au .  We look forward to hearing from you.  \r\n Additionally, please provide your available start date as the position may commence immediately upon successful application. \r\n  ORGANISATION NAME:  OUYANG and LEE LAWYERS \r\n \r\n  CONTACT NAME:  Adam li \r\n  EMAIL ADDRESS:   info@oyllawyers.com.au   \r\n  STATE / PROVINCE / REGION:  New South Wales \r\n  COUNTRY:  Australia"
    },
    {
        "job_title": "Legal Associate (FCoA)",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Federal Court of Australia",
        "description": "Legal associates assist with researching cases, points of law, preparing matters for hearing including other related matters for first instance judges and of the Court.  Legal associates are responsible for providing assistance to judicial officers during court hearings and other administrative support to judges, as required.  In addition, legal associates perform court support duties. Legal associates primarily provide assistance to designated judges but may be asked to assist other judges if the need arises.  Some travel may be required."
    },
    {
        "job_title": "Associate to Judge Kirton (FCC)",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Federal Court of Australia",
        "description": "The Federal Court of Australia entity is currently seeking applicants to fill the position of Associate to Judge Kirton in the Federal Circuit Court of Australia Jurisdiction, and to potentially merit list other candidates to fill future Associate positions. \r\n The Associate is part of a team assisting a Judge in the day to day management of Chambers and Court. The role of the Associate is to manage chambers and to supervise the Deputy Associate.      Duties include: \r\n \r\n Day-to-day running of chambers including responding to enquiries. \r\n Supervise the work of the deputy associate. \r\n Assist the Judge to manage the docket by preparing and managing matters waiting for hearing. \r\n Ensure the court’s case management system is up-to-date and assist the Judge in the preparation of orders and typing of judgments. \r\n Maintain court related relationships with various external stakeholders. \r\n Contribute to organisational forums working for better working practices. \r\n Other duties as required. \r\n \r\n What we are looking for: \r\n \r\n Legal qualifications and admission as a practitioner of the High Court and/or the Supreme Court of a State or Territory of Australia (desirable). \r\n Family law experience (desirable). \r\n Ability to undertake legal research as required by the Judge. \r\n The ability to travel on circuits as required. \r\n \r\n More information: \r\n For more information please download the position description from the Court’s  Career’s portal  or contact Venicia Godbee on 0436 601 946 or email:  venicia.godbee@federalcircuitcourt.gov.au"
    },
    {
        "job_title": "Graduate/Experienced Personal Injury Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Littles Lawyers",
        "description": "LITTLES LAWYERS  Littles Lawyers is a specialist personal injury law firm operating throughout Australia. We work on a \"no win-no fee\" basis and represent clients in relation to motor vehicle accidents, workplace incidents, public liability incidents, institutional abuse claims, and TPD claims.  Our culturally diverse staff provides services in several languages and provide clients with tailored legal services that ensure our clients are heard in the language that they understand. This also enables them to get the results they deserve.  We embrace the no-silo rule. Everyone at Littles is encouraged to communicate with whomever in the organisation is most likely to provide an appropriate and direct answer. Apps such as Discord and Slack have empowered Littles to execute this. We thrive upon transparent and direct feedback.  We are paperless, agile and possess a high technological drive. Many of our administrative tasks are automated. This has enabled us to accomplish the concept of 'work from where it works' - whether this is the office, home or overseas.  WHAT LITTLES DO  • We embrace diversity • We elevate people who struggle to fit in with traditional firms • We embrace new ways of working as well as new places of work • We insist on collaboration and promote flexibility and freedom • We provide strong, nurturing, and caring mentors • We reward and promote based on achievement not years in the job • We are innovative, tech-driven, and responsive to our clients' needs • We have domain expertise beyond peer and industry best practice workflows and precedents.  Making all of the above true is your mission. Do that and your success is guaranteed at Littles.  ABOUT THE ROLE  We have a new opportunity for a Personal Injury Lawyer to work in our busy Sydney and Melbourne CBD office.  This is a great opportunity for someone who has a passion for personal injury litigation and is looking to progress their career in a national firm.  WHAT WE ARE LOOKING FOR  • Must have Chinese or Korean speaking skills; • Previous experiences in the field of PI law preferred; • A commitment to providing excellent service to clients; • Positive work ethic - must be diligent and autonomous. You will be working in an agile work environment; • Strong organisation and planning abilities; and • Must be a team-player!  This is a full-time position with a salary commensurate with experience and bonuses.  TO APPLY  To apply, please submit your resume and cover letter to  jhong@littles.co  /  careers@littles.co  Please note that we do not accept applications via recruitment agencies.  For information about employee rights and minimum wages, see the Fair Work Ombudsman website at  www.fairwork.gov.au   Residency Requirements All candidates considered including international students"
    },
    {
        "job_title": "Solicitor/Law Clerk",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Turnbull Legal Solutions",
        "description": "Amazing opportunity to work for a young, dynamic, modern firm with the role based in the beautiful town of Armidale.  \r\n At Turnbull Legal Solutions we run a general practice and you will have the opportunity to learn and practice in family law, wills, estates, conveyancing and criminal law.  \r\n The role would be suited to someone newly admitted or an experienced Solicitor. Applicants that are not yet admitted, but have experience working in a law firm should also apply.  \r\n The ideal applicant will be enthusiastic, be client focused, friendly, able to work autonomously but be a team player.  \r\n All applications will be treated in strict confidence. Salary will be commensurate with experience. \r\n Immediate start available."
    },
    {
        "job_title": "PLT Work Experience Placement",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Bloxham Legal",
        "description": "PLT Work Experience Placement being offered. Complete your work experience with Bloxham Legal, a family law firm in the heart of Perth city. \r\n Bloxham Legal is a growing firm practising in family law, criminal law, and wills and estates. \r\n The position will involve attending trials and other events in court, liaising with clients and other stakeholders, and drafting correspondence and court documentation. \r\n This position is ideally suited to a law graduate who is looking to complete their 75 days work experience."
    },
    {
        "job_title": "Junior Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Crisp Law",
        "description": "The Firm   Due to our client growth we are looking to expand our team with a junior construction lawyer with at least 1- 2 years post admission experience. \r\n    The ideal person will have:  \r\n \r\n At least 2 years post admission experience in the area of construction \r\n Experience in construction (both front and back end) \r\n Strong attention to detail \r\n Ability to work under pressure/fast paced environment \r\n Team focus - enjoy working as part of a committed team \r\n Experience in other areas of law is an advantage \r\n \r\n   What we offer you:  \r\n \r\n Mentorship \r\n Client-facing litigation work \r\n Opportunity to draft and settle claims for filing in relevant courts and work with the firm’s Barrister(s) \r\n Make appearances and attend necessary hearings"
    },
    {
        "job_title": "Full Time Clerk",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Crisp Law",
        "description": "We are seeking  clerks,  working  full time  to join our team in providing our services to clients. We are a boutique law firm specialising in construction, commercial and statute liability law. Most of our graduate clerks continue with us as solicitors after admission. You will be rewarded with genuine career prospects. Remuneration will commensurate with relevant experience.  \r\n  Day to Day tasks  \r\n \r\n Research tasks for the team’s articles and case notes \r\n Working in a team of solicitors and clerks \r\n Legal research and drafting newsletters in light of legal updates \r\n preparation of seminar papers \r\n Filing duties such that final products to be kept in firms’ library/ precedents \r\n Drafting litigious documents in preparation for court \r\n \r\n   Criteria  \r\n \r\n Previous experience within a firm \r\n Telephone skills \r\n Excellent verbal and written communication skills \r\n Well-developed organisational and time management skills \r\n Ability to take direction and work in a team environment \r\n Proficiency in WS Word, Excel, Outlook and electronic software \r\n Ability to prioritise work and work under pressure \r\n Capacity to work independently \r\n Ability to manage one’s own time effectively \r\n \r\n   What we Offer You:  \r\n \r\n Mentorship \r\n Client-facing litigation work \r\n Opportunity to draft and settle claims for filing in relevant courts and work with the firm’s Barrister(s) \r\n Make appearances and attend necessary hearings"
    },
    {
        "job_title": "PLT placement (unpaid)",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "SS Lawyers",
        "description": "We are offering a PLT/work experience placement (unpaid). The role will suit a recent graduate and is available immediately. \r\n Your responsibilities may include assistance with scanning, Smokeball and Leap matter management, drafting court documents, correspondence and Court attendances, file management and preparation of briefs to Counsel, reviewing documents, undertaking legal research, and general administrative tasks. \r\n The successful candidate will have excellent attention to detail, ability to understand and follow instructions, excellent verbal and written communication skills. \r\n Please email your CV and cover letter to Tatiana Stack at  tatiana@shorelawyers.com.au"
    },
    {
        "job_title": "Full- Time Paralegal- Family/Civil/Criminal Law",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "El Baba Lawyers",
        "description": "About the role  \r\n We are a thriving and dynamic law firm practicing primarily in family, criminal and civil litigation. We are searching for a paralegal to work closely with the Principal Lawyer and Senior Solicitor. The Principal is an accredited Independent Childrens Lawyer, on the specialist domestic violence panel, family law panel, cross examination panel, specialist criminal law panel. The firm has a solid stimulating, interesting and varied work inflow.  \r\n We are expanding rapidly and are searching for the right paralegal to assist our Principal and team.  \r\n  Your main duties in this role will include: \r\n \r\n Assisting lawyers and other staff members with any administrative duties including telephone attendance, invoicing, drafting cost agreements and receipts, itemised bills, diary management, arranging and scheduling appointments, client correspondences, all correspondences with third party stakeholders including lawyers, Courts and prosecutors, opening and closing files and all other administrative duties; \r\n Drafting email, letter and general day to day correspondence; \r\n Researching and drafting all Court related documents including  affidavits, submissions, orders; \r\n Acting as a first point of contact: dealing with phone calls and clients; \r\n Providing a high level of administrative and legal assistance including but not limited to creation and maintenance of files, photocopying, complying briefs, data entry and drafting correspondence. \r\n Dictaphone typing; \r\n Accounts and billing; \r\n Attending various venues outside of the business premises to file documents with a Court or statutory body, etc as required. \r\n Researching and assisting in preparing legal submissions and documents. \r\n Preparing and filing various applications along with all required documents \r\n \r\n  Skills and experience  \r\n  The Candidate  \r\n To be successful you MUST have: \r\n \r\n Experience as a Paralegal or Legal Secretary ; \r\n Demonstrated ability to meet competing deadlines and work under pressure; \r\n Advanced MS office skills in particular Word and Excel; \r\n Fast and accurate typing speed of 70+ WPM \r\n Confidence to liaise with professionals at all levels; \r\n Great organisational skills and a keen eye for detail; \r\n Advanced skills and experience with Microsoft applications Word, Excel, and Outlook \r\n Exceptional time management and multi-tasking skills including ability to prioritise tasks and competing deadlines; \r\n Exceptional drafting skills and written work; \r\n A demonstrated ability to work independently in a fast-paced environment and organise workload to meet tight deadlines. \r\n \r\n  Benefits and perks  \r\n Pay to commensurate with experience. \r\n Please forward a covering letter of no more than 250 words together with your CV addressing the selection criteria."
    },
    {
        "job_title": "Solicitor - 1-2PQE",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "El Baba Lawyers",
        "description": "We are a young and dynamic firm practising primarily in family and criminal law. We are searching for a lawyer to work closely with the Principal and senior solicitor. The Principal is an accredited Independent Childrens Lawyer, on the specialist domestic violence panel, family law panel, cross examination panel, specialist criminal law panel. The firm has a solid stimulating, interesting and varied work inflow.  \r\n We are expanding rapidly and are searching for the right person to assist our team. In return, the successful candidate will have the opportunity to grow and excel significantly in their legal career. We are open to fast-paced career progression and we will offer progression for the right candidate.  \r\n  About the role  \r\n  Key responsibilities include: \r\n \r\n Being the right hand to the Principal Lawyer in a very busy and growing boutique practice; \r\n Working closely with the Principal on complex Family/ Civil litigation law matters; \r\n Working autonomously and taking active carriage of complex files; \r\n Court attendance including hearings, mentions, directions hearings, conciliation conferences, mediations, interim hearings, and instructing counsel in final hearings; \r\n Researching, drafting and managing Court documents including statement of claims, affidavits, orders, case outlines, balance sheets, financial statements and all family law related court documents; \r\n Independently advising clients on family law matters including taking instructions, preparing letters of advice, general day to day correspondence and management of the file; \r\n Preparing and reviewing disclosure documents. \r\n \r\n  Skills and experience  \r\n What you must bring: \r\n \r\n 1-2 years minimum PQE; \r\n You will have carriage of matters in the Federal Circuit Court/ Family Court/ Local Court and you should be able to run files with minimal supervision; \r\n Advanced Microsoft office skills, in particular excel and word; \r\n Experience in appearing in Court including running hearings; \r\n A \"can-do\" attitude and proactive approach in all aspects of  Family/Civil law practice; \r\n A working knowledge of Family/Civil litigation law; \r\n Exceptional drafting skills and written work; \r\n Exceptional time management and multi-tasking skills including ability to prioritise tasks and competing deadlines; \r\n A demonstrated ability to work independently in a fast-paced environment and organise workload to meet tight deadlines; \r\n Strategic thinker with a pragmatic approach to complex matter research and client outcome focus; \r\n Willingness and ability to complete administrative tasks when required; \r\n Must be quick and efficient with handling of files; \r\n Knowledge of PEXA and LEAP preferable but not essential. \r\n \r\n We offer the opportunity to work in a firm where you will have the ability to manage your files independently, whilst also having the benefit of exposure to other areas of law.  \r\n  We reward entrepreneurial thinking -  If you are someone that thinks outside the box, likes to be efficient and has innovative ideas, you will thrive here! \r\n Please send your CV and covering letter addressing the criteria (of no more than 1 page) to  mona@elbabalawyers.com .  \r\n Pay to commensurate with experience."
    },
    {
        "job_title": "Legal Assistant (Undergraduate)",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Antunes Lawyers",
        "description": "Antunes Lawyers is seeking to recruit an undergraduate law student to give legal and administrative support across a range of practice areas within our firm. \r\n We are seeking an individual who brings initiative, drive & commitment, who is detail orientated, possesses strong organisational and communication skills, embraces challenges and who prospers in working in a collaborative, team based environment. \r\n We offer a positive work place culture, with good career prospects, where you will be encouraged and supported to strive for professional excellence in all you do. \r\n Essential requirements: \r\n \r\n A positive and friendly disposition with a ‘can do’ attitude \r\n Proven ability to manage tasks and multiple competing priorities in a fast paced environment \r\n Proven capability to work autonomously as well as within a team \r\n Excellent written and verbal communication skills \r\n Proficient in drafting professional correspondences \r\n High attention to detail \r\n Experience and skill in using Microsoft Word \r\n Experience in preparing briefs and court documents \r\n Minimum 6 months’ work experience in a legal firm \r\n Availability to work minimum of 3 days per week \r\n At least penultimate year of study \r\n \r\n If this role is for you, please apply online by clicking the appropriate link or send your resume with covering letter and academic transcripts to  tim@antunes.com.au  \r\n Kindly note that we are only able to respond to successful applications"
    },
    {
        "job_title": "Law Graduate - Building & Construction",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Moray & Agnew",
        "description": "About us  \r\n Moray & Agnew is one of Australia's leading law firms with over 650 staff nationally. We have offices in Sydney, Melbourne, Brisbane, Canberra, Newcastle and Perth and have an unrivalled reputation in our market.  Lawyers Weekly  recognises us as one of the 25 most attractive firms to work in Australia. Over the last decade, the firm has tripled in size to support the growth of our Australian and international clients. \r\n We are passionate about what we do and want you to be too. We value technical excellence and the ability to function independently or in a team. We offer a unique workplace culture and excellent opportunities to further your personal and professional development, along with a range of staff wellbeing initiatives.  Successful client relationships are at the heart of everything we do. We pride ourselves on the diversity and loyalty of our client base, enjoying close, trusted and long-standing relationships. Clients rely on our capability and dependability, and they value our distinctive personality and friendly culture. \r\n  About the role  \r\n An exciting opportunity to join our Building & Construction practice group, as a full-time Graduate at Law. The team currently comprises four Partners, four Special Counsels, three Senior Associates, and a number of lawyers and graduates. \r\n Working closely with, and being mentored by partners and senior lawyers, this is an interesting and varied role working across all aspects of building & construction law, encompassing both the front and back end, including: \r\n \r\n Litigation and builders warranty \r\n Risk management strategy and policies \r\n Conduct of claims against building & construction professionals \r\n Contract design. \r\n \r\n Our clients include a range of prominent building industry participants including developers, proprietors, building companies, project managers, specialist consultants and engineering firms. \r\n  About you  \r\n You will have completed your law degree and may be currently completing your post graduate studies and PLT or about to start your post graduate studies. \r\n You will be a motivated and enthusiastic team player with a keen interest in, and an aspiration to work in building & construction law (this might be able to be demonstrated by way of related legal experience, or by involvement in building & construction law industry groups and bodies). \r\n You will have strong academic results, excellent writing, communication and organisational skills and enjoy working as part of a close team, driven by demonstrating exceptional results to their clients. The work requires attention to detail, practical problem-solving skills, initiative and strategic thinking. \r\n To be successful in this role you will need to possess the following qualities: \r\n \r\n Strong technical and drafting skills \r\n Exceptional attention to detail \r\n Self-confidence, initiative and good judgment \r\n The ability to work well under pressure and to meet deadlines \r\n Excellent interpersonal skills with strong written and verbal communication skills. \r\n \r\n Importantly, you have a team-oriented personality and thrive working in a team environment. \r\n  Apply now  \r\n We are committed to fostering a flexible, inclusive and diverse environment for our employees. We celebrate diverse thinking and experiences and we welcome people of all backgrounds and identities to apply to this position. We encourage our employees to bring their true and authentic self to the workplace. If this opportunity is attractive to you, please submit your cover video, CV and academic transcript. \r\n Moray & Agnew encourage applications from Aboriginal and Torres Strait Islander candidates. In the spirit of reconciliation, Moray & Agnew acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to elders past, present and emerging and extend that respect to all Aboriginal and Torres Strait Islander peoples today. \r\n  If you require any adjustments to participate in our recruitment process, please let us know in your application.  \r\n *Please note, as part of the application process, you will be required to submit a short cover video in lieu of a cover letter. A guide is provided to you as an attachment included in the vacancy advertisement, listed on the careers page of our website*"
    },
    {
        "job_title": "PLT  Placement - Part time or Full time Unpaid",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Herald Legal",
        "description": "Herald Legal is a busy law firm located in Sydney CBD. We are looking to recruit a talented and capable law clerk to join our team. Herald Legal offers a tremendous amount of invaluable experience and exposure to a wide range of legal matters within a variety of practice areas including: \r\n \r\n Litigation; \r\n Commercial and Corporate Law; \r\n Family Law; \r\n Criminal Law; \r\n Migration Law; \r\n Property Law \r\n \r\n Your responsibilities will include but not limited to assisting our Solicitors with reviewing documents, undertaking legal drafting, court documents search and file management. \r\n Applications must include a cover letter, CV and Legal degree transcript. Please send your applications to  hr@heraldlegal.com.au"
    }
][
    {
        "job_title": "Prosecution Officer (Administrative)",
        "job_type": "Full-time",
        "date_posted": "Oct 15, 2021",
        "company": "Office of the Director of Public Prosecutions",
        "description": "Legal Development Program    \r\n  Prosecution Officer (Administrative) Level 3 for a period of 12 months.  \r\n The Office of the Director of Public Prosecutions (ODPP) welcomes applications from recent law graduates to be included in the Office’s Legal Development Program. The program provides valuable experience to talented and enthusiastic individuals who have a desire to succeed and make a difference. \r\n Positions in the program may be offered at ODPP locations at  Campbelltown, Dubbo, Gosford, Lismore, Newcastle, Parramatta, Penrith, Sydney CBD, Wagga Wagga and Wollongong,  depending on availability and competitive selection. \r\n The ODPP provides an independent, efficient, fair and just prosecution service for the people of New South Wales. Its vision is to be a dynamic prosecution service, recognised for its excellence and leadership. \r\n The Legal Development Program provides full-time paid practical legal experience working in criminal prosecutions for a period of 12 months offering a salary range of $74,117 - $81,158 per annum. For more information, refer to the  Program Plan  \r\n   Eligibility   \r\n You are eligible to undertake the program if you: \r\n \r\n Have completed the coursework component of the College of Law’s Professional Program (or its equivalent) or would have completed it by 31 December 2021. \r\n Are currently undertaking or have not yet started the work experience component of the College of Law’s Professional Program (or its equivalent). Applications will also be accepted from graduates who completed the work experience component after 1 st  January 2021.   \r\n \r\n   For more information   \r\n  Role Description     \r\n For an applicant information guide please  click here   \r\n To learn more about the ODPP, please visit our website at:  http://www.odpp.nsw.gov.au/  \r\n Inquiries in relation to this recruitment should be directed to    HumanResources@odpp.nsw.gov.au    The Office welcomes applications from Indigenous Australians, people from diverse cultural and linguistic backgrounds and people with a disability and provides an environment that values diversity and supports all staff to reach their full potential. If you have individual requirements that need to be accommodated in order to participate in the selection process and join the ODPP team, please indicate this in your application.  \r\n  Closing date :  Sunday 24th October 2021 (midnight)"
    },
    {
        "job_title": "Senior Family Law Paralegal",
        "job_type": "Part-time",
        "date_posted": "Oct 14, 2021",
        "company": "Cominos Family Lawyers",
        "description": "We are looking for a diligent, reliable and passionate law graduate to assist our busy Family Law Practice. You must be interested in Family Law and dedicating your career to Family Law.  \r\n We require an individual who is available a minimum of 1-3 days per week.  \r\n We are a well-established Family Law Practice located in the Sydney CBD.  \r\n If you wish to apply, please send your Resume and covering letter to  careers@cominoslawyers.com.au"
    },
    {
        "job_title": "Practical Legal Training (PLT) - Volunteer",
        "job_type": "Part-time",
        "date_posted": "Oct 14, 2021",
        "company": "Biz Lawyers & Advisory",
        "description": "Fantastic opportunity to gain valuable industry experience in Property and Commercial law under the guidance of an experienced principal lawyer. \r\n Biz Lawyers & Advisory is a boutique practice located in Martin Place, Sydney specialising in Property, Banking and Commercial Law. \r\n The placement is for an unpaid PLT volunteer experience role, however meals and transport costs will be reimbursed. The role commences immediately and can be either full or part time, depending on the candidate. \r\n As part of the role, you will have the rare opportunity to work one-on-one with the Principal of the firm who has a range of top tier and in-house legal experiences. \r\n The ideal candidate will have recently graduated with a law degree and will be looking to satisfy the PLT requirement and looking to be part of a young and dynamic firm with growth aspirations.  You will be a meticulous, hard-working, and a well-rounded individual who will gain practical experience, handling matters from start to finish. We are looking for a candidate with an ability to work under pressure, excellent verbal and written communication skills, passion for law and willingness to learn as well as proficiency with Microsoft Office software and others. \r\n Your duties will include: \r\n \r\n Undertaking due diligence searches and reviewing documents. \r\n Researching and compiling articles on changes in law. \r\n Reviewing contracts and assisting in the drafting of contracts. \r\n Working on the conveyance process from the beginning to end. \r\n Drafting advices and other correspondence. \r\n Various general office duties. \r\n \r\n If you feel you are suitable for this role (minimum 3 days per week), please send your CV and a covering letter to  stephanie@bizlawyers.com.au  with \"PLT Position\" in the subject line."
    },
    {
        "job_title": "Criminal Law - PLT and Work experience",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "Oxford Lawyers",
        "description": "Oxford Lawyers at Parramatta is looking for a hard working and enthusiastic Law student or Graduate who seeks to obtain unpaid practical experience in the area of Criminal Law. \r\n  The position is suitable for students who are completing their PLT components or Law Students.   \r\n  We require the following: \r\n \r\n Successful Candidate needs to be available at 2 to 4 days a week. \r\n Needs to have a passion for Criminal Law. \r\n Able to prioritise a high volume of work. \r\n Very Punctual and reliable. \r\n \r\n Immediate start: If you are interested and suitable for the positions.  \r\n Please email your resume or CV to:  info@oxfordlawyers.com.au   \r\n To find more about our firm visit  www.oxfordlawyers.com.au  \r\n or our facebook page:  https://www.facebook.com/Oxford-Lawyers-381155698585369/"
    },
    {
        "job_title": "PLT / Law Student",
        "job_type": "Part-time",
        "date_posted": "Oct 14, 2021",
        "company": "Rebus Legal",
        "description": "Rebus Legal is a busy boutique law firm specializing in Family, Criminal, Civil, Traffic, and Migration Law matters. \r\n We have worked hard to establish a great reputation, have a strong growing client base and we continue to expand. \r\n We currently have four available voluntary positions at our offices in Victoria Park for  PLT / Law Students looking to gain experience in furtherance of your law degree. \r\n  The successful candidate will have:  \r\n \r\n Direct access to experienced practitioners ensuring that you will work alongside the best in developing your interpersonal and professional skills and experience; \r\n Access to free parking onsite; \r\n Possible opportunity for ongoing employment, given the growth plan of the practice; \r\n Experience to gain a reference for any future employment applications. \r\n \r\n  To be successful in this role you must:  \r\n \r\n Have an excellent work ethic; \r\n Possess excellent written and verbal communication skills; \r\n Be able to work independently; \r\n Have good interpersonal skills; \r\n Possess a keen attention to detail; \r\n Be proficient in Microsoft Office suite. \r\n \r\n If you consider yourself suitable for this exciting opportunity, please send us a cover letter, academic record and resume to   michelle@rebuslegal.com.au   \r\n Should you have any queries please call the Practice Manager -  Michelle Corbett  on  0450 477 670"
    },
    {
        "job_title": "Legal Practitioner",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "Rebus Legal",
        "description": "Salary: $80,000 - $120,000 - Commensurate with Experience  \r\n  About Rebus Legal  \r\n Rebus Legal is a boutique law firm in Perth that is looking for a vibrant Lawyer with PAE 3 + years’ to join our friendly team of Lawyers.  \r\n We are currently experiencing rapid growth and seek to add to our dynamic friendly team of Lawyers who share a passion for the law, with the focus being on providing quality legal representation and obtaining the best possible outcome for all our clients. The team works collaboratively to ensure that our clients get the best legal representation, in Family - Property and Parenting matters, Restraining Order matters, and Criminal Law matters. \r\n  About the role  \r\n This is an exciting and challenging opportunity for a Lawyer with 3+ years P.A.E, ideally to include experience in Family Law to work closely with our experienced Partners and team and play an integral part in the growth of Rebus Legal. You will undertake a diverse range of legal work in various areas of law. You will be responsible for running your own case load, and our Partners encourage professional development and individual growth. Working aside, the team at Rebus Legal are great fun with an open focus on promoting a work life balance. \r\n  Benefits of Working with us  \r\n \r\n Great Opportunities to advance your legal career in a law firm that is continuing to grow. \r\n Work in a Supportive and Collegial team environment together with experienced legal practitioners. \r\n Genuine work life balance. \r\n Opportunities to work on a diverse and interesting case load autonomously. \r\n Free Car Parking Bays. \r\n Offices located within 5 minutes drive to Perth CBD. \r\n Supportive work environment. \r\n Great open-door culture. \r\n \r\n  Skills and experience  \r\n The successful candidate will need to be self-motivated, confident, reliable and willing to work as part of a close-knit team. Ideal background and skills include: \r\n \r\n A minimum of PAE 3 + years’ experience. \r\n Strong time management and organizational skills together with the capacity to manage multiple tasks and conflicting priorities simultaneously. \r\n Ability to run and manage own case files. \r\n Confident to handle legal challenges with good work ethic and desire to help clients. \r\n Confidence to represent clients in Court. \r\n Excellent verbal and written communication skills. \r\n Strong attention to detail. \r\n \r\n  How to Apply  \r\n Please send your Resume, Academic Transcript and Cover Letter in PDF format to  michelle@rebuslegal.com.au"
    },
    {
        "job_title": "PLT Student Full-Time Position: Liverpool NSW",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "LY Lawyers",
        "description": "We are one of New South Wales and Sydney's leading Criminal Law firms, with offices in Sydney, Parramatta, Liverpool and Wollongong. \r\n This is an exciting opportunity for an individual seeking practical legal training and experience in a reputable criminal law firm. \r\n The opportunity awaits a motivated and ambitious individual who is genuinely seeking a career in the criminal law profession. \r\n Your role will include: \r\n \r\n Regular attendance at court \r\n Work with our Solicitors in our Liverpool Office \r\n Working with some of Sydney's leading barristers in complex criminal law cases \r\n Assisting our principal in the preparation of those matters. \r\n \r\n This current position is unpaid. \r\n Opportunity to progress to junior solicitor role available for the right applicant."
    },
    {
        "job_title": "solicitor",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "Kiki Kyriacou Lawyers",
        "description": "Solicitor position in Criminal Law (Up to 2 years PAE )  \r\n   Job Description  \r\n    Kiki Kyriacou Lawyers is seeking an energetic, self-motivated and committed lawyer to join our small criminal law practice in kings Cross. Our practice consists of one principal lawyer and a practice manager. \r\n We are offering a full-time position for an immediate start. The successful candidate will need to have up to 2 years PAE in criminal law. \r\n   \r\n The position will include the following duties: \r\n \r\n Preparing and summarising briefs of evidence. \r\n Assist in instructing counsel at court. \r\n Providing advice and representation to a diverse client base. \r\n Appearing in court in all criminal jurisdictions both in the Sydney metro and beyond. \r\n Prepare court/legal documents. \r\n Drafting correspondence to clients and to other stakeholders. \r\n Liaising with clients in conferences both in custody and face to face. \r\n Efficiently undertaken legal research as required. \r\n \r\n  Essential criteria:  \r\n High level written communication skills including ability to prepare court documents, maintain file notes, summarising evidence, taking notes during trials, drafting correspondence to both clients and other stakeholders. \r\n \r\n High level interpersonal communication skills including ability to liaise with clients from diverse backgrounds, government departments, the judiciary, police, barristers and other key stakeholders. \r\n Ability to work independently and be self-motivated as well as under supervision and able to take instructions. \r\n Experience and ability to develop professional client relationships and an understanding of meeting client expectations. \r\n Strong time management and organisational skills and ability to prioritise competing priorities. \r\n \r\n If you meet the above criteria and are passionate about representing clients in criminal law matters, please send a covering letter (no more than 3 pages) addressing all of the above together with your C.V. marked  Attention   Kiki Kyriacou,  and email to  office@kklawyers.com.au by Friday, 22 October 2021 . \r\n Please note, this position is suitable to applicants with no more than 2 PAE."
    },
    {
        "job_title": "Paralegal/ Junior Solicitor",
        "job_type": "Contract",
        "date_posted": "Oct 14, 2021",
        "company": "Du & Associates Lawyers",
        "description": "Our friendly team is looking for an experienced Junior Solicitor/Paralegal with at least 1 year+ of experience in a similar role. The position is a 3-6 months fixed-term contract with a possibility of moving onto a permanent position.  \r\n  Preferred applicants \r\n * Knowledge of Microsoft Office skills \r\n * Minimum 1 year+ experience working in a general practice law firm \r\n * Attention to detail  \r\n * Excellent verbal and written communication skills \r\n * Follow confidentiality protocols when dealing with sensitive information  \r\n * Preferable knowledge of LEAP software & PEXA  \r\n You must be committed to a career in law and have a high English literacy level. Chinese language skills are also required as we have quite a few Chinese-speaking clients."
    },
    {
        "job_title": "Practical Legal Training Volunteers Wanted",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "Think Visa",
        "description": "This position is ideally suited to a law graduate who is looking to complete their 75 days’ work experience on a volunteer basis. The ideal candidate will have a strong academic background and a confident disposition. Excellent communication skills are essential for this role. This position will include extensive training and mentoring from senior, experienced lawyers.  Please note this is an unpaid position.  \r\n If you are open-minded about this position, it will be a great opportunity for self-development, you will be in a position to see an immigration law firm develop and grow, your keenness and ability to contribute will be appreciated. You must be committed and willing to complete your internship with us as there are opportunities for employment. \r\n Applicant requirements: \r\n \r\n Law student/graduate; \r\n Passionate about the law; \r\n Great thinking, writing, and analytical skills. \r\n outgoing; \r\n Involved in social and extracurricular activities; \r\n Ability to keep calm under pressure; \r\n Is confident that they will be self-sufficient financially (as the position is voluntary); \r\n \r\n Benefits: \r\n \r\n To be part of a fun and hip team; \r\n Ability to assist in business management decisions; \r\n Opportunity to increase knowledge and business skills; \r\n Mentorship. \r\n \r\n Please apply with a Cover letter, CV and Academic Transcript via email to  HR@thinkvisa.com.au . \r\n Please note: you must apply BY EMAIL. \r\n Job Types: Full-time, Volunteer \r\n Location: \r\n \r\n Melbourne VIC (Preferred) \r\n \r\n Work Eligibility: \r\n \r\n The candidate can work permanently with no restriction on hours (Preferred) \r\n \r\n Benefits: \r\n \r\n Training and professional development assistance"
    },
    {
        "job_title": "Legal Advisor",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "Employment Office",
        "description": "Join an intergovernmental organisation at the leading edge of Pacific development  !  \r\n  Excellent remuneration package circa US$82,019 - US$121,055 (tax-free, for citizens of most countries!) plus repatriation allowances & retention incentives!  \r\n  Enjoy relocation & accommodation assistance, 6 weeks annual leave, return airfares & more!  \r\n \r\n  About   the Organisation  \r\n  The Pacific Islands Forum Fisheries Agency (FFA)  is an intergovernmental organisation working to strengthen national capacity and regional solidarity so Pacific nations can manage, control, and develop their tuna fisheries now and in the future. \r\n Based in Honiara, Solomon Islands,  FFA's  17 member nations are Australia, Cook Islands, Federated States of Micronesia, Fiji, Kiribati, Marshall Islands, Nauru, New Zealand, Niue, Palau, Papua New Guinea, Samoa, Solomon Islands, Tokelau, Tonga, Tuvalu and Vanuatu. \r\n Since 1979,  FFA  has facilitated regional cooperation so that all Pacific countries benefit from the sustainable use of tuna – worth over USD $3 billion a year, and important for many people’s livelihoods in the Pacific. \r\n  About the Opportunity  \r\n  FFA  has an opportunity for a  Legal Advisor  to join their team in Honiara, Solomon Islands, on a 3-year contract, with renewal subject to performance appraisals and availability of funding. Depending on where you are currently based, you may also begin the role remotely and make the move to Honiara once you are able.  \r\n Reporting to the Legal Counsel, you will be responsible for providing  legal advice on all aspects of FFA's work, implementing legal frameworks and assisting with the review of national legislation and providing advice on international fisheries law.  \r\n Core duties: \r\n \r\n Provide effective technical legal advice to the secretariat and member countries on fisheries and related legislation; \r\n Research and develop legal frameworks for alternative fisheries management models that would enhance management of the region's tuna; \r\n Assist member countries in the development of model management and legal frameworks to facilitate the sustainable harvesting of the regions tuna resource; \r\n Support the development and formulation of Negotiation Briefs for member countries in international fisheries negotiations; \r\n Undertake periodic reviews of regional, subregional and national arrangements; and \r\n Advise member countries in connection with the detection, apprehension and prosecution of fishing vessels engaged in illegal activities. \r\n \r\n For the full Position Description, please  click here . \r\n About You \r\n To be considered for this role you  will hold a Bachelor of Laws degree and ideally have post-graduate qualifications in international law, international fisheries law, or marine affairs.  Experience with fisheries or maritime law would be highly regarded, though a more general environmental or natural resource-related background would be considered. \r\n You will have a strong background in government or a multi-disciplinary environment, with demonstrated experience in the drafting and preparation of legislation. Any work as a prosecutor or in a related role would be an advantage. \r\n Able to build relationships and collaborate with internal and external stakeholders at all levels, you will need  strong communication skills, both written and oral.  \r\n Importantly, you will be able to work in a multidisciplinary and culturally diverse team, and will demonstrate high levels of respect for individual and cultural differences. \r\n  Please note:  You will need to be comfortable undertaking extensive travel, once safe to do so, to various member countries and other international areas as required, typically for an average of 2 weeks a month. \r\n  About the Benefits  \r\n If you are looking to make the  ultimate sea change  and find out more about life on the leading edge of Pacific development, this is the opportunity for you! \r\n You will be offered a  competitive remuneration package circa US$82,019 - US$121,055 (tax-free, for citizens of most countries) , commensurate with your skills and experience. \r\n This includes  s  uperannuation, paid at 7.5% into either a nominated fund or as an additional cash supplement .    FFA   reimburses all reasonable medical, dental, and optical expenses for yourself and dependants.    Insurance coverage is also provided for    personal accident, life, medical & repatriation.  \r\n Education for dependent children will be  reimbursed at 75% of tuition fees  ( Conditions apply).  If your dependent child is educated overseas, paid school travel may be available for you or your child to visit each other once a year.  \r\n  Relocation expenses will be paid,  with an establishment grant paid on arrival in Honiara, and  a  ccommodation assistance  also available. \r\n  Annual airfares back to the country of repatriation will be provided,  and a  repatriation allowance of 2 weeks’ base salary on return to home-base at the end of the contract . There is also a  retention incentive of 21% of your base   salary  which will be paid on the completion of your contract. \r\n On top of all this, you will have access to  6 weeks of annual leave  each year, giving you plenty of time to explore this stunning part of the world! \r\n  Applications will close on Monday, November 8th.   \r\n  In line with current COVID-19 considerations, FFA has a number of policies in place to keep their staff safe, including temporary work from home arrangements for those who would be relocating to Honiara."
    },
    {
        "job_title": "Clerk , Law Graduates, Solicitors",
        "job_type": "Contract",
        "date_posted": "Oct 14, 2021",
        "company": "YFX LAWYERS",
        "description": "YFX Lawyers is a boutique law firm located in the heart of Auburn CBD. We are seeking for: \r\n \r\n An experienced solicitor (preferably with at least 2 years or more experience in family law) \r\n Clerk (pat time 20 hours per week) fluent in English and Mandarin languages \r\n Law graduates interested in completing their full 75 days PLT requirements with a view to continuing with our firm as a full-time solicitor once admitted. \r\n \r\n You will need: \r\n \r\n Excellent written and verbal communication skills \r\n Strong attention to detail \r\n Culture of responsibility \r\n An ability to work under pressure \r\n Good work ethic \r\n \r\n Application to  info@yfxlawyers.com.au  (No telephone inquiry) \r\n The closing date for this position is 12 November 2021"
    },
    {
        "job_title": "Junior Lawyer",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "Pannu Lawyers",
        "description": "Pannu Lawyers has a vacancy for a junior or graduate lawyer who is looking for a varied and fulfilling role in a supportive and positive workplace. \r\n The successful applicant would join our busy  team working under direct supervision of a senior lawyer handling family law, commercial law, conveyancing and criminal law files. \r\n The successful applicant will have an outgoing, caring, and compassionate personality and a genuine interest in our core practice area including family law, commercial law, conveyancing  and criminal law. \r\n Further, excellent written skills are required with a strong attention detail, along with an ability to work efficiently. Excellent time management skills are a must. \r\n While prior experience in family law would be valued, it is not necessarily required; the characteristics we most value in an applicant are a proven strong work ethic and \"can do\" attitude. \r\n Applications may also be considered from strong applicants who have almost completed their admission requirements but who are not yet admitted."
    },
    {
        "job_title": "JUNIOR ESTATE PLANNING SOLICITOR",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "Equity Trustees",
        "description": "About us - Trusted since 1888   \r\n Equity Trustees was established in 1888 and is now one of Australia's largest specialist trustee companies. We help our clients grow, manage and protect their wealth now and for generations to come. As a trustee company, it is our responsibility to always act in our clients' best interests, ensuring they feel safe, valued, and cared for. \r\n We are committed to providing a workplace that is flexible, rewarding, and supportive of individual development. Just as you will help us grow our business, we will help you grow in your career. \r\n  About the role: (Sydney)  \r\n The key purpose of this role is to work with the estate planning team to provide simple estate planning advice to clients referred either internally or from our referral partners and also support the Senior Estate planning lawyers in progressing matters. This includes joint client meetings with Senior estate planning lawyers, reviewing documentation such as wills and powers of attorney, drafting written advice, drafting documents such as simple wills, powers of attorney, binding death benefit nominations. \r\n The role will also provide legal and administrative support to the Estate Planning business unit nationally, predominantly focusing on will drafting, client communication and file management for the Senior Estate planning lawyers where required. \r\n  The role is suited for a recent law graduate with an experience in the legal industry looking to work in the area of estate planning.   \r\n Key responsibilities include: \r\n   \r\n \r\n handling and management of standard/simple estate planning matters for clients referred to EQT. \r\n working with referral partners and their clients in providing appropriate estate planning advice under supervision of a Senior Estate planning lawyer. \r\n support the Senior Estate Planning lawyers with the preparation and drafting of legal documents as required and directed, including standard wills, trust wills, multijurisdictional powers of attorney and appointment of enduing guardian. \r\n communicate with clients to follow up and progress their matters and documentation appropriately as required \r\n support various stages of the estate planning process including on-boarding processes, drafting correspondence (both letters and email communications), drafting legal documents, communicating with clients, financial advisers and internal stakeholders. \r\n general file management, including accurately managing the archival, retrieval and recording of client files, both hard and soft copies. \r\n witnessing Wills and Powers of Attorney as appropriate. \r\n updating precedents as required \r\n proactive involvement in the templating of documents including standard legal documents, emails and letters \r\n \r\n   What you'll need to succeed:  \r\n \r\n    General understanding of wills and/or of estate planning \r\n Demonstrated ability to interpret sections of legislation governing estate planning on a national basis \r\n Demonstrated ability to manage multiple stakeholders with various expectations \r\n Highly proactive, demonstrated initiative and problem-solving skills \r\n Exceptional technical administration (client centric) and file / account management skills \r\n Exceptional Computer Skills, Word, Excel, PowerPoint etc. \r\n Strong organisational skills and exceptional attention to detail \r\n Exceptional client and business focus \r\n Continuous improvement mindset \r\n Experience in a Legal practice or a trustee company preferred \r\n \r\n   Education:  \r\n  Completed a tertiary qualification in Law \r\n \r\n Admission to practice as a legal practitioner or desire to become admitted \r\n \r\n   What we can offer you:  \r\n \r\n A warm, open and supportive culture \r\n An attractive remuneration package, including reward and recognition programs \r\n Paid parental leave and flexibility to help you achieve balance in your life \r\n An individual learning and development budget to help you grow \r\n A workplace volunteering and giving program to enable you to help others in the community \r\n Group Salary Continuance insurance to protect you when you need it most \r\n An employee wellness program, including discounted health insurance and an employee assistance program \r\n Discounted tax and estate planning services \r\n Great central CBD location, new office fit out and end of trip facilities. \r\n \r\n  Equity Trustees is 130 years strong - and growing. Apply now to be part of a successful contemporary trustee company!"
    },
    {
        "job_title": "Bilingual Immigration Lawyer (Dari/Farsi Speaking)",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "Hunter Shafiz Lawyers",
        "description": "Hunter Shafiz Lawyers is looking to hire an experienced immigration lawyer with the following skills & qualities:  \r\n Responsibilities: \r\n \r\n End-to-end file management of visa applications lodged with the Department of Home Affairs and merits review applications before the Administrative Appeals Tribunal, including management of casework, preparation of forms and other correspondence and requests for information \r\n Attend to consultation, application preparation, lodgement and other miscellaneous tasks in relation to corporate visas \r\n File management in accordance with protocols for LEAP \r\n Support and assist agents/ solicitors in managing the case load \r\n Maintain client database; data input (new client registration; recording application information, including application and lodgement details) in accordance with protocols for LEAP \r\n Write submissions by reading, researching, reviewing, verifying, and perusing correspondence, reports and legal documents; drafting letters and documents; collecting and analysing information.  \r\n Keeping up to date with any developments, changes to migration laws and industry updates, \r\n Meet deadlines with regards to preparation and lodgement of visa/review/appeal applications \r\n Correspond with the Department of Home Affairs on behalf of clients \r\n \r\n   \r\n Skills: \r\n \r\n At least 3 years PQE in immigration law; \r\n Fluency in speaking Dari/Farsi; \r\n Familiarity with immigration law is essential as well as the ability to work independently; \r\n Broad migration knowledge across various visa subclasses  \r\n Excellent written, verbal and research skills; \r\n Excellent time management skills and a strong ability to manage deadlines; and \r\n A strong willingness to improve on and share your knowledge.  \r\n \r\n Candidates with exposure to other areas of law desired, but it is not a necessary requirement. This role is available for an immediate start with salary commensurate to experience. \r\n To apply for this position please send your resume to info@huntershafiz.com.au"
    },
    {
        "job_title": "Family Lawyer",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "Hunter Shafiz Lawyers",
        "description": "A rare opportunity has become available for an experienced  Family Lawyer  to join our dynamic team.  \r\n This role provides a high level of autonomy and will require you to manage files and advise clients on all aspects of Family Law,. You will be a natural communicator and excel at developing and maintaining stakeholder relationships.  \r\n We offer quality and challenging work within a professional, collaborative and supportive environment. \r\n  The Role  \r\n \r\n case assessment and strategic planning while communicating with clients and documenting all time dedicated to case \r\n Perform legal research, draft legal documents and draft quality affidavits \r\n Strong knowledge on recent court cases, laws, and court regulations \r\n Represent clients in family law court and civil matters \r\n Represent clients in complex mediation of contested divorces to successfully negotiate settlement \r\n Review and assess all assets and liabilities of client to develop worksheet for use in settlement and/or trial \r\n Strategically review expenses and income of client and opposing side for use in settlement and/or trial \r\n \r\n \r\n Administrate client files and relationship building while providing following legal services \r\n Negotiate settlements and communicate progress up to and including settlement \r\n Conduct case management procedures, including discovery \r\n \r\n  Skills and Qualifications   \r\n \r\n Minimum of  3+  years PQE experience in Family Law \r\n Must have experience conducting hearings both interim and final \r\n Background or understanding of Civil Law is an asset, but not required \r\n Excellent communication and interpersonal skills \r\n Ability to work autonomously and within a team environment  \r\n Excellent organisational and time management skills \r\n \r\n Candidates with exposure to other areas of law desired, but it is not a necessary requirement. This role is available for an immediate start with salary commensurate to experience. \r\n To apply for this position please send your resume to info@huntershafiz.com.au"
    },
    {
        "job_title": "Junior Solicitor/PLT",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "West Legal",
        "description": "We are a small general practice located at Chester Hill, seeking to employ an admitted solicitor. The role would be suitable for someone who has not necessarily had any post admission experience. Training and supervision will be provided from ground level. We also invite expressions of interest from persons wanting to carry out the work experience component of their Practical Legal Training program with our firm."
    },
    {
        "job_title": "Solicitor",
        "job_type": "Full-time",
        "date_posted": "Oct 14, 2021",
        "company": "KWL Lawyers",
        "description": "The Firm  \r\n KWL Lawyers is a boutique law firm located at Sydney CBD near Wynyard station. \r\n We provide our clients with a wide range of legal services in various areas including Business, Conveyancing, Wills and Estate, Family Law, Criminal Law, Litigation and Insurance. \r\n Over the past years since established in 2016, our Firm has made significant progress in delivering the best possible outcomes for our clients and to ensure that each matter is completed with integrity, professionalism and transparency. \r\n  The Role – Key Responsibilities & Attributes  \r\n We are currently seeking suitable candidates for the position of junior solicitor with 1 to 2 years’ experience or law graduate, who wish to gain hands-on experience. In this position, you will be required to manage client files from start to finish with support and supervision of the experienced lawyers and staffs. \r\n Key responsibilities will include, but not limited to: \r\n \r\n Conduct client interviews. \r\n Liaise with relevant stakeholders. \r\n Draft and prepare correspondence and legal documentation. \r\n Undertake legal research, analysis, review and evaluation \r\n \r\n  To be successful for this position, ideally the candidate should possess: \r\n  Excellent interpersonal and communication skills. \r\n \r\n Strong team work skills coupled with a desire to learn. \r\n High level of organisational and time management skills. \r\n Be motivated, enthusiastic and self-driven attitude. \r\n Prior legal experience. \r\n \r\n  Proficiency both in Korean and English would be an advantage. \r\n  Remuneration will be commensurate with experience and qualifications. \r\n   Please send your CV to    timothy@kwllawyers.com.au"
    },
    {
        "job_title": "Part-time Wills & Estate Lawyer",
        "job_type": "Part-time",
        "date_posted": "Oct 14, 2021",
        "company": "Disability Law Queensland",
        "description": "Disability Law Queensland  are looking for a part-time Wills & Estate Lawyer who is wanting to assist people with disabilities and their families to plan for the future, assert their rights and access justice.  This position would suit a 2+ yrs PAE Lawyer who is looking for autonomy whilst working on wills, probate applications, estate administration, contested estate litigation, inheritance claims and have the opportunity to assist with and/or run other litigation files as they come across the desk.   To view the full job advertisement and to apply, please visit  https://lnkd.in/g8YrKnR5  \r\n For more information, feel free to contact Gretta Lloyd via  manager@dlq.org.au  or call (07) 3622 1250."
    },
    {
        "job_title": "Family Law Solicitor",
        "job_type": "Full-time",
        "date_posted": "Oct 12, 2021",
        "company": "Ark Law Lawyers",
        "description": "We are looking for a 1-3PQE Solicitor with experience in Family and Care matters to join our firm located in the heart of Parramatta. We will be going back into the office within the next few weeks.  \r\n We are hands on with all our matters and require someone with dedication and passion for this area of law.    \r\n Tasks will include:  \r\n \r\n Court attendance in both FCFCOA and Children's Court \r\n Legal research \r\n Drafting Correspondence  \r\n File Management                                                                                                                                       \r\n \r\n Knowledge of Leap is preferable but not necessary. Full-time opportunity.  \r\n Please send through your resume to  admin@arklaw.com  or  kat@arklaw.com.au  \r\n We look forward to hearing from you."
    }
][
    {
        "job_title": "Graduate/Junior Litigation Solicitor",
        "job_type": "Full-time",
        "date_posted": "Oct 12, 2021",
        "company": "Ken Cush and Associates",
        "description": "We are looking for a confident and motivated junior solicitor to join our busy practice in late November 2021.  This will be a full-time permanent position after probation period. \r\n  Key Role Responsibilities  \r\n \r\n Supporting members of the team including our Executive Counsel and barristers. \r\n Preparing, reviewing and working on Court and other legal documents. \r\n Meeting with and speaking to clients via face to face, zoom and telephone. \r\n Legal research. \r\n Appearing in Courts and Tribunals around Australia. \r\n \r\n  Essential Skills  \r\n \r\n Commencement or completion of GDLP. \r\n Excellent written and verbal communication skills. \r\n Confidence to manage challenges. \r\n Displaying initiative in identifying and proposing solutions to challenges. \r\n Strong time management skills. \r\n Ability to work in a fast-paced environment. \r\n Well organised with an attention to detail. \r\n Ability to work well in a team. \r\n Capacity to take instructions and ensure procedures are followed. \r\n \r\n  Preferable  \r\n \r\n One to three years’ experience in a personal injury firm (in a support, paralegal or solicitor role). \r\n Experience with LEAP software and all MS Office applications. \r\n \r\n  Benefits  \r\n \r\n Working as part of a boutique and award-winning firm specialising in personal injuries and human rights law. \r\n Modern offices on Lonsdale Street in Braddon (coffee capital of Canberra). \r\n Employee assistance program. \r\n Close team environment in which a sense of humour is essential. \r\n Regular staff functions throughout the year. \r\n \r\n Please send your cover letter and CV to careers@kencush.com.au"
    },
    {
        "job_title": "Paralegal",
        "job_type": "Full-time",
        "date_posted": "Oct 12, 2021",
        "company": "Ark Law Lawyers",
        "description": "We are seeking a full-time Paralegal to join our boutique family law firm in Paramatta. This is a great opportunity to obtain professional legal experience and further your legal career in a specialist firm. \r\n As a Paralegal, you will assist a solicitor and accredited family law specialist with legal and administrative tasks, including: \r\n \r\n Calendar organisation and scheduling \r\n Drafting and filing legal documents \r\n Case management \r\n Analysing and summarising documents \r\n Answering office calls \r\n Drafting correspondence \r\n Legal research \r\n Printing, filing, and other administrative tasks \r\n \r\n 1 - 2 years experience"
    },
    {
        "job_title": "Practical Legal Training (PLT) / Student Placement - Volunteer",
        "job_type": "Full-time",
        "date_posted": "Oct 12, 2021",
        "company": "White Knight Lawyers",
        "description": "Our firm  \r\n White Knight Lawyers is a rapidly growing Australian law firm which offers premium litigation, transactional, and advisory legal services. \r\n We generally practice in litigation and dispute resolution, insolvency and bankruptcy, tax controversy, commercial law and advisory, public law and construction law. \r\n We are currently engaged in diverse ongoing litigation work including proceedings before the Supreme Court of NSW and Supreme Court of Victoria, District Court of NSW, Federal Court of Australia, AAT, and NCAT (both original jurisdiction and appeal panel).   \r\n We pride ourselves on the quality of our work, developing relationships of trust with our clients, and efficiently delivering engagement-tailored legal services.  \r\n  Our available role  \r\n We are very excited to offer practical legal training to a recent law graduate on a volunteer basis.  \r\n We expect that you will be honest, diligent, and enthusiastic when carrying out the following tasks and responsibilities, amongst others: \r\n \r\n Attending client meetings and court hearings and taking minutes and file notes respectively. \r\n Assisting in the preparation of internal processes, procedures, policies, guidelines and protocols. \r\n Assisting in the preparation of precedent documents and checklists. \r\n Drafting publications and legal updates on topical legal issues across a wide range of areas of law. \r\n Undertaking legal research and drafting research memorandums. \r\n Drafting statements of claim, affidavits, and other forms and processes.  \r\n Administrative assistance including file management, diary maintenance, and office management. \r\n \r\n  About you  \r\n You must be committed to establishing a career in commercial private legal practice and have a keen interest in litigation and dispute resolution.  \r\n You must have a proven record of legal ability, whether by way of your academic success, prior industry experience, or relevant extracurricular activities.    \r\n  Your application  \r\n If you are interested in the above, then please email us your curriculum vitae, academic transcripts, and a sample of your writing (preferably one (1) academic piece and one (1) creative piece)."
    },
    {
        "job_title": "SOLICITOR",
        "job_type": "Full-time",
        "date_posted": "Oct 11, 2021",
        "company": "Lehman Walsh Lawyers",
        "description": "About Us  \r\n Lehman Walsh Lawyers is a leading Australian law firm with a reputation for providing high quality, innovative, unique timely services. We combine innovation with commercial savviness to deliver rewarding outcomes to all our clients. \r\n  The Opportunity  \r\n We currently have an excellent opportunity for a full-time solicitor to join our  team. \r\n You will be running and developing your own division, under the umbrella of the firm. You will have complete control over your matters, hours, and how you manage clients whilst working in a collegiate environment and being part of a fully integrated law firm.   You will be rewarded through a commission-based remuneration structure, with a high-percentage paid to you for the work billed and received.  The firm is looking to expand their practice focuses to include Family Law, Wills & Estates, Employment, Commercial, Corporate, IT and Tech so is interested in hearing from candidates in any of these areas.    \r\n  Skills and Experience  \r\n Desirable attributes and skills include: \r\n \r\n ability to follow directions efficiently and accurately \r\n excellent interpersonal skills (both verbal and written) \r\n pragmatism and attention to detail \r\n strong team ethic. \r\n enthusiasm for working in a high volume, fast pace team environment. \r\n \r\n Highly desirable would be: \r\n \r\n Mandarin, Arabic and Korean language skills \r\n advocacy and/or litigation experience \r\n previous client management skills. \r\n \r\n  What We Offer  \r\n At Lehman Walsh Lawyers, we provide a collaborative, flexible and friendly working environment where you can achieve the best in your personal and professional development. \r\n  How to Apply  \r\n Please submit your cover letter and CV by clicking on the 'Apply' button below. If you would like further information on the role, please email  info@lehmanwalsh.com.au"
    },
    {
        "job_title": "Solicitor - Civil and Criminal Law",
        "job_type": "Full-time",
        "date_posted": "Oct 11, 2021",
        "company": "Michael Vassili Barristers and Solicitors",
        "description": "Michael Vassili Barristers & Solicitors is an expanding litigation and transactional law practice based in Western and North Western Sydney. With over two decades of solid success in litigation in various jurisdictions throughout NSW and Australia two new positions are available in our expanding litigation teams. \r\n The Firm conducts litigation in a wide variety of jurisdictions including: \r\n \r\n Crime \r\n Family Law \r\n Family Provisions \r\n Corporations \r\n Building and Construction \r\n Land and Environment \r\n Equity \r\n Various Appellant Jurisdictions \r\n Commercial \r\n \r\n   \r\n We are seeking applications for a solicitor with  4  + years post admission experience  to join our team of enthusiastic and successful young lawyers. \r\n You will be expected to provide peer review of matters and have conduct of your own matters to a very high standard expected by the Firm. Appearances in various courts including the Local, District and Supreme Court will be required. It would be an advantage if you have run defended hearings in any one of these jurisdictions. \r\n Salary is negotiable with experience including potential for equity in the practice on successful performance. \r\n  Working in a team of dynamic solicitors you will require the following Skills, Qualifications & Experience:  \r\n We are seeking a motivated, professional self-starter who can manage criminal law and civil law and general practice files from initial interview until completion. \r\n \r\n Working as a Solicitor within this diverse area of law your role will cover a range of matters from commercial and equity applications through to family provisions claims and litigation in all areas across Australia) \r\n Working knowledge of the UCPR / Criminal Procedure Act / Federal Court Rules and Court process (an expectation that you know how to converse with Rules and apply them) \r\n Strong analytical and research skills \r\n Advocacy skills with capacity to conduct appearances and hearings in all courts \r\n A career-focused individual who employs accuracy and commitment \r\n Outstanding client management and communication skills \r\n Attention to detail and the ability to meet deadlines \r\n Strong negotiation experience and strategic skills  \r\n Professional presentation, focus, and attitude \r\n The ability to work as an independent practitioner handling own files within a supportive team environment \r\n \r\n  This is an outstanding opportunity to establish and expand your Court experience in Civil and Criminal Law but is suited to someone who seeks excellence in preparation for trial and is willing to put the work and self-development into being an outstanding Trial Advocate.   \r\n  You will have the support of the Principal of the practice in a friendly practice environment which cares about people.  \r\n The main litigation office of the Firm is based at Blacktown, however, the position will involve appearances in jurisdictions both throughout NSW and from time to time interstate. \r\n Please reply in the first instance with a covering letter and resume addressed to our Principal as follows: \r\n Michael Vassili – Principal Solicitor"
    },
    {
        "job_title": "Legal Clerk",
        "job_type": "Part-time",
        "date_posted": "Oct 11, 2021",
        "company": "Ark Law Lawyers",
        "description": "We are looking for a vibrant, enthusiastic and focused law student or pre-admission graduate to join our team located in the heart of Parramatta. However we are will be going back into the office within the next few weeks.    \r\n We are hands on with all our matters and require someone with dedication and passion for family law.    \r\n Tasks will include:  \r\n \r\n Legal research \r\n Drafting Correspondence  \r\n File Management  \r\n Preparation of Briefs \r\n \r\n Knowledge of Leap is preferable but not necessary. 2 Days minimum per week.  \r\n *This is a volunteer position however there is  opportunity to become paid for the right person."
    },
    {
        "job_title": "(Immediate Start) PLT Placement in Perth - Litigation",
        "job_type": "Part-time",
        "date_posted": "Oct 11, 2021",
        "company": "BMS LAW",
        "description": "Immediate start for College of law student in Perth requiring their PLT Experience component. \r\n \r\n  Attendance: minimum 3 days attendance per week  \r\n  UNPAID  \r\n Get exposure to litigation legal matters in Perth. \r\n You will be able to learn and assist with Supreme Court cases e.g. preparing court documents such as affidavits  \r\n experience in working on a variety of legal disputes \r\n must be pro-active, fast-learner, hard-working, learns from mistakes, pleasant attitude, can-do attitude, person who asks questions etc. \r\n we are located in a great shopping complex known as Broadway Fair Shopping Centre. 5 mins from Perth CBD. Western suburbs.  \r\n 9AM to 5PM - you pick your days. \r\n possible employment position available at end of period on a part time basis to start and possible full time basis at a later stage (subject to performance and contribution). \r\n Chinese language skills can be helpful as we have clients who require Chinese language skills. \r\n \r\n  IMPORTANT.  You must be able and willing to start immediately as we have ongoing legal matters that are about to commence and it would be a great opportunity for any law student or College of law student. \r\n Some facts \r\n \r\n We are a boutique sized firm and have been in Nedlands for 20 years.  \r\n Our Principal has 48 years of legal experience  \r\n We have offices in Singapore and Perth \r\n Our lawyers in both offices are able to practise Singapore law, Australian law, Malaysian law. \r\n We advise on international cross border legal matters  \r\n We have represented high profile clients \r\n We are not the typical law firm \r\n We are old school but adopt a modern approach to lawyering e.g. technology \r\n We believe hard work is very important \r\n Multi-lingual lawyers \r\n \r\n  Email cover letter explaining why you would be the right candidate to Associate Mr Jay Mohan Singh at   jay@bmslaw.com.au  \r\n  A tip for cover letters : get the name of the person you are writing to correct, first impressions are very important, especially in the legal industry. Your cover letter is an expression of who you are. Hope this helps. \r\n Interviews will be conducted on short notice. \r\n Please also attach your Resume/CV. \r\n  Office location: Suite 10/ 88 broadway, Nedlands, 6009. NEAR UWA."
    },
    {
        "job_title": "PLT - Work Experience Placement",
        "job_type": "Full-time",
        "date_posted": "Oct 11, 2021",
        "company": "Beck Legal Group",
        "description": "We are seeking an enthusiastic people to conduct their placements within our firm. We are seeking someone who has an interest in working in Family Law, particularly advocating for Fathers, Domestic Violence and Criminal Law."
    },
    {
        "job_title": "Adminitrative Assistant",
        "job_type": "Part-time",
        "date_posted": "Oct 11, 2021",
        "company": "Dundas Lawyers",
        "description": "We are looking for a part time 3 days per week law student in their second year that has some experience working in a law firm.  You will be doing affidavits, using Sharepoint, taking phone calls, end of month billing, letters and generally everything associated with administrative duties.  We are a commercial law firm. \r\n If you are interested please forward to me your CV stating your experience."
    },
    {
        "job_title": "PLT/Graduate Solicitor",
        "job_type": "Part-time",
        "date_posted": "Oct 11, 2021",
        "company": "Tenet Legal",
        "description": "Two positions are available for this Brisbane based boutique law firm specialising in property and commercial law:  \r\n 1. PLT placement for law graduate who wish to explore in practical legal experiences/secure PLT placement; \r\n 2. Junior level solicitor for candidates who have basic knowledge in Conveyancing/property law area;  \r\n 3. Mandarin/Cantonese  Speaking is a mandatory for both positions."
    },
    {
        "job_title": "Practical Legal Training (PLT)",
        "job_type": "Full-time",
        "date_posted": "Oct 11, 2021",
        "company": "Agape Henry Crux",
        "description": "Agape Henry Crux  is an innovative law firm in Sydney CBD with exclusive practice in Immigration and Administrative Law. We are a collegiate team, passionate and results-driven. We pride ourselves in thinking outside the box, we embrace the use of technology and digital automatisation to assist our naturally lazy self. \r\n We also have a young dynamic team promoting a fun working environment to enhance employee experience. We bring everyone closer together with regular social catch ups and so much more. At Agape we position ourselves to be different to other firms in the industry, we keep our teams small to allow everyone to grow fast and provide opportunity to allow each and every one to step up making an impact in what we do. Our firm consists of 3 accredited specialists in immigration law, we are committed to our new talents and support the learning you need to grow.    \r\n  The Position  \r\n We are currently offering the last intake of the year for work experience placement as a component of Practical Legal Training (PLT). Depending on each individual growth and development during your placement at Agape, we are open to discussing a career progression post the 14 weeks program. As there are limited immigration legal practitioners within this industry, we commence selecting our team carefully, putting particular emphasis on culture where the necessary skills are progressively groomed under a mentorship program. We advertised throughout the year as we are always opening doors to new talents and creating positions. To see a day in our lives, check out our Instagram page @agape_henry_crux \r\n  The ideal candidate should:  \r\n \r\n Recently completed/ final year law degree \r\n Possess a strong interest in immigration/administrative law \r\n Be motivated, pro-active, can-do attitude \r\n Have strong problem-solving skills \r\n Display good organisation and time management skills \r\n Ability to work independently and in a team \r\n \r\n  Making an application:  \r\n To learn more about this opportunity or to make an application, please send your CV with a cover letter to  talent.acquisition@ahclawyers.com"
    },
    {
        "job_title": "Paralegal, PLT and Solicitors",
        "job_type": "Full-time",
        "date_posted": "Oct 11, 2021",
        "company": "Lexsons Law Firm",
        "description": "Lexsons Law Firm is a modern and progressive law firm based in the Sydney CBD practising primarily in commercial law, property, civil litigation, intellectual property, immigration and family law. \r\n We are seeking for: \r\n 1. A law graduate or paralegal on a 7-months full-time contract; 2. An experienced solicitor (preferably with at least 2 years or more experience in property law); 3. A registered migration agent or solicitor experienced in migration law; and 4. Law graduates interested in completing their full 75 days PLT requirements with a view to continuing on with our firm as a full time solicitor once admitted.  Note: These are not work-from-home roles and you will need to work in our office in the Sydney CBD."
    },
    {
        "job_title": "PLT Placement - Legal Clerkship",
        "job_type": "Part-time",
        "date_posted": "Oct 11, 2021",
        "company": "Enero Group",
        "description": "*applications must include a cover letter tailored to this job description to be considered*  \r\n   Enero Group is a boutique network of marketing and communications businesses for clients across the full range of marketing and communications services. Listed on the Australian Securities Exchange our businesses operate primarily out of three key hubs in Sydney, London and New York and from many places in between. Businesses based in Sydney include BMF Advertising, Orchard Marketing, Hotwire Communications and The Leading Edge.  \r\n  We currently have a fantastic opportunity for an enthusiastic law student to assist our in-house legal department. You will receive hands-on experience in legal matters including:  intellectual property, corporate transactions and commercial matters. Tasks will include due diligence, writing case and topic summaries, internal legal advices, legal research and assisting in the preparation of seminar materials.  \r\n  This role would suit you if you prefer a fast-paced and dynamic workplace and are enthusiastic, an excellent researcher and a problem solver!   \r\n  Ideally you can show us a proven interest in the creative arts (advertising, photography, music, art, film & tv) and have an interest to work in an in-house environment.  \r\n  Experience in Microsoft SharePoint and PowerPoint or Prezi an advantage.   \r\n  You must be able to commit to at least 1-2 days per week for a minimum of 6 weeks, preferably longer.   \r\n  Note: this is a voluntary placement."
    },
    {
        "job_title": "Employment and IR Lawyer",
        "job_type": "Full-time",
        "date_posted": "Oct 11, 2021",
        "company": "Australian & International Pilots Association",
        "description": "Employment and IR Lawyer \r\n \r\n \r\n \r\n \r\n Location: \r\n \r\n \r\n Mascot, Sydney \r\n \r\n \r\n \r\n \r\n Salary: \r\n \r\n \r\n Subject to experience \r\n \r\n \r\n \r\n \r\n Company: \r\n \r\n \r\n Australian & International Pilots Association \r\n \r\n \r\n \r\n \r\n Email: \r\n \r\n \r\n  recruitment@aipa.org.au      \r\n \r\n \r\n \r\n \r\n Telephone: \r\n \r\n \r\n 02 8307 7777 \r\n \r\n \r\n \r\n \r\n  Located in Mascot, the Australian and International Pilots Association (AIPA) is a professional member organisation representing over 2000 professional pilots employed within the Qantas Group including pilots employed by Qantas, Jetstar, QantasLink, Express Freighters and Network Aviation. \r\n  AIPA has a small team of 16 staff members promoting, protecting, and advancing the interests of our members by providing legal, welfare, industrial and safety & technical support.  \r\n  We are looking for a lawyer of 4 or more years PQE and a specialisation in employment law and industrial relations. You will join a small in-house team, working with and under the general direction of AIPA’s Executive Director and Head of Legal. Your work will also include working alongside a committed Executive team. \r\n Essential criteria: \r\n \r\n Bachelor of Laws \r\n Admitted, or eligible to be admitted, to practice law in NSW (or any other Australian state or territory) \r\n 4+ PQE, specialising in employment law and industrial relations, but applicants with a range of experience are welcome to apply \r\n Effective advocacy skills \r\n \r\n \r\n Excellent case management skills and ability to interpret and apply legislation, awards and enterprise agreements \r\n \r\n \r\n Strong written, verbal, negotiation, research and presentation skills are required. \r\n \r\n  Desirable criteria: \r\n \r\n An unrestricted practicing certificate \r\n Aviation experience would be highly regarded \r\n Experience in enterprise bargaining and union governance \r\n \r\n This is a rare opportunity to join a vibrant Association, enjoying quality employment and industrial relations work in the ever-changing aviation industry. It is a full time position, and the salary will be competitive and commensurate with experience. The start date is flexible. \r\n  AIPA’s office is well appointed and resourced, located close to Mascot train station, limited parking options are available."
    },
    {
        "job_title": "Criminal Law PLT / Graduate Solicitor",
        "job_type": "Full-time",
        "date_posted": "Oct 11, 2021",
        "company": "Fourtree Lawyers",
        "description": "Fourtree Lawyers is a driven and energetic legal practice located on the beautiful Central Coast of NSW.  Established in 2015, our team have been handpicked to provide expert legal representation and deliver the best outcomes for our clients.   \r\n Strong representation and personalised, value-driven service are the cornerstones of our practise.  \r\n Our firm provides the following services: \r\n \r\n Criminal Law \r\n Wills & Estates \r\n Family Law \r\n Employment Law \r\n \r\n   \r\n We are currently seeking a Practice Legal Trainee (PLT) or recently admitted solicitor to join our Criminal Law team and start immediately for 3-5 days a week.  \r\n You will be working under the guidance of highly regarded senior practitioners and have exposure to matters ranging from Local Court traffic hearings to high-profile drug importation and trials before the Supreme Court. \r\n Along with quickly gaining hands-on experience on interesting matters and building client relationships, you will be part of a vibrant and friendly team that offers great work-life balance. The successful PLT candidate will need to be very driven, energetic, reliable and honest with an open-minded approach in order to develop their skills and knowledge in Criminal Law. \r\n   \r\n To be considered for this role, please submit your Resume and Cover Letter with your availability to  admin@fourtreelawyers.com.au  outlining: \r\n \r\n Why you are interested in Criminal Law; and \r\n Any previous exposure or experience you may have had. \r\n \r\n Previous Criminal Law experience is ideal but not essential. We are interested to hear about any experience you have had and how this will ensure you thrive and succeed at Fourtree Lawyers. \r\n   \r\n  Please note this is a  paid  position."
    },
    {
        "job_title": "IT Service Manager - Permanent - Full Time",
        "job_type": "Full-time",
        "date_posted": "Oct 08, 2021",
        "company": "The College of Law",
        "description": "The College of Law is looking for a talented Service Manager to join our dynamic TIS team to manage and provide quality service and support to both internal and external customers across all our Colleges within Australia and in NZ. We are a steadily growing organisation, and we are renewing systems – our tech environment has changed over the last 18 months, with further exciting tech transformation and changes ahead.  \r\n  Key Accountabilities   \r\n The Service Manager leads the IT service desk team and is responsible for high quality, consistent technical Customer Support, ensuring that these services meet prescribed service targets.  The Service Manager implements and operates ITIL processes to ensure high customer satisfaction & good technical outcomes. \r\n The key functions that the Service Manager will be involved in are: \r\n \r\n   Budgets and business planning -   Evolve service provisioning based on knowledge of company objectives and work with the relevant stakeholders and the team to plan, design and deploy with continual improvements to service quality \r\n \r\n \r\n        People management -   Coach, mentor and motivate the team to improve performance by providing timely and quality customer service and expert tech support. \r\n \r\n \r\n    Customer support -   Maximise customer satisfaction for internal and external customers, ensuring a high level of customer focus and attention to customer priority issues and appropriate levels of customer communication along with a high level of technical knowledge within the team  \r\n \r\n \r\n   Documentation& Reporting -   Ensure all processes and procedures involving all IT services are refreshed and followed. \r\n \r\n       Experience, Skills and Attributes  \r\n \r\n A track record of success with respect to managing a 12/5 Service Desk environment delivering excellent technical customer service \r\n Strong technical knowledge across application and desktop support, including Microsoft Windows and Office 365 . \r\n People management experience \r\n A relevant IT tertiary qualification and /or equivalent training and experience \r\n Training and experience in ITIL service delivery model. \r\n Demonstrated ability to lead and to effectively communicate with staff at all levels including a proven ability to communicate with technical and non - technical staff \r\n Demonstrated ability to meet deadlines without compromising close attention to detail and accuracy \r\n \r\n A more detailed position description can be accessed  here  \r\n If interested please send covering letter and CV to hr@collaw.edu.au by   COB Wednesday 20 October 2021"
    },
    {
        "job_title": "PLT placement",
        "job_type": "Part-time",
        "date_posted": "Oct 08, 2021",
        "company": "Lawbridge Lawyers & Consultants",
        "description": "LawBridge Lawyers & Consultants - About Us  \r\n LawBridge Lawyers & Consultants is a fast-growing boutique legal firm that provides services within the Commercial, not-for-profit, and Personal law practice areas. \r\n LawBridge has built a reputation for providing high quality and timely services, balanced with a strong internal emphasis on culture and values. We have a genuine dedication to reach the best possible outcomes for our clients.  \r\n LawBridge has a team of 15 members and two offices, Sydney CBD and Chullora NSW. The position will be at our City office. \r\n   \r\n  The Opportunity  \r\n The position is a volunteer and created for law graduates undertaking the Practical Legal Training (‘PLT’) program. The candidate would be assisting our solicitors, including partners and administrative support. \r\n The position will expose the candidate to a holistic learning experience in various areas of Law including, Commercial and Corporate Law, Property Law, Intellectual Property, Not-for-Profit, Family Law, Administrative Law and Commercial Litigation. \r\n The successful candidate Must be able to attend Monday, Tuesday and Thursday - to start immediately. \r\n At the successful completion of the PLT position, LawBridge may consider offering the candidate a graduate position on a full-time basis.   \r\n   \r\n  Required Skills   \r\n The ideal candidate must have: \r\n \r\n Eligible to commence Practical Legal Training; \r\n Confident communication (verbal and written) skills; \r\n Attention to detail; \r\n Ability to take responsibility for the given task; \r\n A positive, friendly, proactive and can-do attitude to get the job done.  \r\n \r\n     \r\n  Apply   \r\n Please submit your  CV and a cover letter to Mohamad Kammoun at info@lawbridge.com.au."
    },
    {
        "job_title": "Graduate Lawyer",
        "job_type": "Full-time",
        "date_posted": "Oct 08, 2021",
        "company": "Daniel Jude Lawyers Pty Ltd",
        "description": "Daniel Jude Lawyers is a growing firm located in the Sydney CBD near Martin Place. We are looking for a   full time law graduate   to assist in our general practise in a wide variety of matters. Candidates with a desire and experience in litigation are preferred but not mandatory.  \r\n \r\n The successful candidate will be assisting the senior lawyers with their daily legal practice and working under supervision on designated matters.    \r\n The firm has a strong history of internal growth for its graduates with all current lawyers growing from Gradates and paralegals.   \r\n  Requirements: \r\n \r\n Have completed a Law degree; \r\n Have excellent written and verbal communication skills; \r\n Be highly motivated and have strong attention to detail; \r\n Be available to start at a full time level; and \r\n Experience is preferable but not required. \r\n \r\n  Please email your cover letter, resume and availability to the office manager, John Paul (danieljudelaw@outlook.com). \r\n  Shortlisted candidates will be contacted for interview."
    },
    {
        "job_title": "Civil Criminal Solicitor",
        "job_type": "Full-time",
        "date_posted": "Oct 08, 2021",
        "company": "Michael Vassili Barristers and Solicitors",
        "description": "About the practice   \r\n  Michael Vassili Barristers & Solicitors  is an expanding litigation law practice with over two decades of solid success, our main offices located in Western and North Western Sydney. We have six offices in Sydney and the Central Coast and one in Melbourne .  \r\n In order to sustain this growth, we are now looking to employ a fulltime  Civil & Criminal Solicitor  to join our dedicated team of litigation professionals. \r\n The Firm conducts litigation in a wide variety of jurisdictions including: \r\n \r\n Crime \r\n Family Law \r\n Family Provisions \r\n Corporations \r\n Building and Construction \r\n Land and Environment \r\n Equity \r\n Various Appellant Jurisdictions \r\n Commercial \r\n \r\n  About the Role  \r\n \r\n Represent clients in appearances in various Courts including the Local, District and Supreme Court. It would be an advantage if you have run defended hearings in any one of these above jurisdictions. \r\n Represent clients in various Courts at interlocutory and final hearings \r\n Provide peer review of matters and have conduct of your own matters to a very high standard expected by the Firm. \r\n Salary is negotiable with experience including potential for equity in the practice on successful performance. \r\n Assist and instruct the Principal in the conduct of hearings and the conduct of matters within the Practice. \r\n \r\n  Skills & Experience   \r\n To be successful in this role you will ideally have  4   years' plus  post admission experience working in a medium sized law firm with a civil & criminal practice area.  \r\n \r\n We value our clients and are proud of our friendly and respectful reputation. We are looking for a likeminded individual who, in addition to possessing excellent client communication skills, can work collaboratively in a team to get things done. \r\n Working knowledge of the UCPR / Criminal Procedure Act / Federal Court Rules and Court process (an expectation that you know how to converse with Rules and apply them). \r\n Experience and Commitment to providing high quality advice and advocacy for clients of the Firm which has an ethos that “if you care about people you fight hard to win”. \r\n Strong analytical and research skills. \r\n Advocacy skills with capacity to conduct appearances and hearings in all courts. \r\n A career-focused individual who employs accuracy and commitment \r\n Outstanding client management and communication skills. \r\n Attention to detail and the ability to meet deadlines. \r\n Strong negotiation experience and strategic skills. \r\n Professional presentation, focus and attitude. \r\n The ability to work as an independent practitioner handling own files within a supportive team environment. \r\n \r\n  This is an outstanding opportunity to establish and expand your Court experience in Civil and Criminal Law. Suited to someone who seeks excellence in preparation for trial and is willing to put the work and self-development into being an outstanding Trial Advocate.   \r\n You will have the support of the Principal who has extensive litigation experience including appearing in the High Court of Australia, in a friendly practice environment which cares about it's people \r\n The main litigation office of the Firm is based at Blacktown, Windsor, Kellyville and Seven Hills however, the position will involve appearances in jurisdictions both throughout New South Wales and interstate from time to time.. \r\n  How to apply   \r\n Please apply here, attaching a cover letter and resume addressed to our Principal as follows: Michael Vassili – Principal Solicitor."
    },
    {
        "job_title": "(Immediate Start) PLT Placement in Perth - Litigation",
        "job_type": "Part-time",
        "date_posted": "Oct 08, 2021",
        "company": "BMS LAW",
        "description": "Immediate start for College of law student in Perth requiring their PLT Experience component. \r\n \r\n  Attendance: minimum 3 days attendance per week  \r\n  UNPAID  \r\n Get exposure to litigation legal matters in Perth. \r\n You will be able to learn and assist with Supreme Court cases e.g. preparing court documents such as affidavits  \r\n experience in working on a variety of legal disputes \r\n must be pro-active, fast-learner, hard-working, learns from mistakes, pleasant attitude, can-do attitude, person who asks questions etc. \r\n we are located in a great shopping complex known as Broadway Fair Shopping Centre. 5 mins from Perth CBD. Western suburbs.  \r\n 10AM starts - you pick your days. \r\n possible employment position available at end of period on a part time basis to start and possible full time basis at a later stage (subject to performance and contribution). \r\n Chinese language skills can be helpful as we have clients who require Chinese language skills. \r\n \r\n  IMPORTANT.  You must be able and willing to start immediately as we have ongoing legal matters that are about to commence and it would be a great opportunity for any law student or College of law student. \r\n Some facts \r\n \r\n We are a boutique sized firm and have been in Nedlands for 20 years.  \r\n Our Principal has 48 years of legal experience  \r\n We have offices in Singapore and Perth \r\n Our lawyers in both offices are able to practise Singapore law, Australian law, Malaysian law. \r\n We advise on international cross border legal matters  \r\n We have represented high profile clients \r\n We are not the typical law firm \r\n We are old school but adopt a modern approach to lawyering e.g. technology \r\n We believe hard work is very important \r\n Multi-lingual lawyers \r\n \r\n  Email cover letter explaining why you would be the right candidate to Associate Mr Jay Mohan Singh at   jay@bmslaw.com.au  \r\n  A tip for cover letters : get the name of the person you are writing to correct, first impressions are very important, especially in the legal industry. Your cover letter is an expression of who you are. Hope this helps. \r\n Interviews will be conducted on short notice. \r\n Please also attach your Resume/CV. \r\n  Office location: Suite 10/ 88 broadway, Nedlands, 6009. NEAR UWA."
    }
][
    {
        "job_title": "PLT Student",
        "job_type": "Full-time",
        "date_posted": "Oct 08, 2021",
        "company": "Brisbane Criminal Lawyers Pty Ltd",
        "description": "We are looking to take on an enthusiastic PLT Student who is interested in Criminal Law and Domestic Violence. We're a small efficient team with an office with a view in the Brisbane CBD. Observe and contribute to the day to day of a criminal defence law firm. \r\n We encourage mature age students to apply."
    },
    {
        "job_title": "Solicitor",
        "job_type": "Full-time",
        "date_posted": "Oct 08, 2021",
        "company": "VISTA LEGAL",
        "description": "Vista Legal is offering a full-time solicitor role in Property Law to law graduate commence from 18 January 2022. \r\n The successful candidate will possess \r\n \r\n Mandarin speaking and writing abilities \r\n Good attention to details and time management skills \r\n Ability to work effectively to tight deadlines \r\n Ability to relate to people at all levels and effectively work in a team \r\n \r\n Position Description \r\n \r\n Conduct legal research and make enquiries with relevant parties/departments etc; \r\n Correspond and liaise with clients and other relevant parties; \r\n Take instructions from supervisor while applying judgment to propose solutions to day-to-day problems; \r\n Manage legal documents and maintain proper filing; \r\n Strong written, oral and interpersonal communication skills; \r\n Exhibit self-motivation and self-management; \r\n A positive attitude and willingness to learn; \r\n Experience with LEAP would be preferable, but not essential. \r\n \r\n Vista Legal is committed to offering the successful applicant an opportunity to grow, learn and progress under sound mentorship and guidance.   \r\n Salary will be negotiated based on level of experience."
    },
    {
        "job_title": "PLT Work Experience at Legal Tech Start Up",
        "job_type": "Part-time",
        "date_posted": "Oct 08, 2021",
        "company": "inAdvisor Pty Limited",
        "description": "Are you interested in getting your PLT work experience in one of the most exciting workplaces out there - a legal start up disrupting the $7 billion personal legal services industry? \r\n  If so, this role is for you!   \r\n   \r\n We are a legal tech start up looking for a creative, independent, fun law graduate to join our growing team and gain exposure not only to the start up environment, the legal tech world but also the complete range of personal legal services from family and criminal law, to personal injury, debt, consumer rights and more.  \r\n   \r\n In this role we are offering the chance to not only gain your 75 days' work experience to only satisfy your course requirements but also the chance to help you decide your future career path. \r\n   \r\n You will be mentored by two lawyers with combined experience of over 20 years in the legal industry  who will teach you about the legal industry and the provision of legal services and you the benefit of their learnings over their career to help guide you as you start your journey as a lawyer. The role is unpaid but we intend to do our best to make up for it in the experience that we provide to you, a few perks here and there where we can (!) and the flexibility we offer (work full time, or part time and work from home). \r\n   \r\n  So what do we ask of you?  \r\n That you be: \r\n   \r\n \r\n \r\n A law graduate or in your final year of studies seeking to complete your 75 days’ work experience on a volunteer basis \r\n A problem solver \r\n Friendly with great communication skills \r\n Ready to develop client and lawyer relationship building skills including by regular calls with both \r\n Interested to learn not only about new areas of law but the business of being a lawyer  \r\n \r\n \r\n  How to Apply:  Send us an email as your cover letter, attaching your CV \r\n  Job Type:  Full-time (ideally) or part time, Volunteer \r\n  Location:  Work from home from wherever you are based, but candidates in Syd or Melbourne are preferred so we can catch up in person! \r\n  Benefits:  \r\n \r\n Training and professional development assistance \r\n Mentorship \r\n Legal experience \r\n Client relationship building experience \r\n Lawyer business development experience"
    },
    {
        "job_title": "PLT Work Experience Placement",
        "job_type": "Part-time",
        "date_posted": "Oct 07, 2021",
        "company": "LadyBird Law",
        "description": "STUDENT PLACEMENT - KEY LEARNING OPPORTUNITIES   \r\n \r\n Learn the overall working of a Wills and Estate Planning business \r\n Exposure to the LadyBird Conveyancing \r\n Test the waters to see if this is the career pathway for you! \r\n \r\n  PRIMARY JOB FUNCTION & TASKS  \r\n \r\n Get exposure to all phases of the business – Prospecting, Preparation for meeting with clients, Meeting with clients, Core work, and all administration phases post the final meeting \r\n Set up client zoom and face to face meetings and issue relevant letters through the client’s journey. \r\n Drafting of Wills, Enduring Power of Attorney’s (EPOAs), Statutory Declarations and Advance Health Directives. \r\n \r\n  HOW TO APPLY   \r\n \r\n Send your CV with a covering letter to Amy at (amy@lblaw.com.au) outlining:\r\n \r\n Your motivation to apply and relevant experience. \r\n Your availability (i.e., days of the week, and how many weeks). \r\n \r\n \r\n You may make enquiries by calling Amy on 0498 043 405."
    },
    {
        "job_title": "Junior Property Lawyer",
        "job_type": "Full-time",
        "date_posted": "Oct 06, 2021",
        "company": "Coombes Property Group",
        "description": "Coombes Property Group (“CPG”) is an owner, developer and manager of a diverse portfolio of retail, office, hotel and land holdings in many CBD and suburban markets across Australia. \r\n Due to recent and further expected growth, our group seeks an energetic and dedicated professional to provide legal support across our Sydney, Parramatta, Brisbane and Darwin properties. \r\n We are looking for a final year law student who is a commercially minded, well rounded, and dedicated professional who is passionate about property. This role will initially be part-time until February 2022, when it will pivot to a full-time role. The selected candidate will work closely with our experienced General Counsel and the wider business in the areas of lease and landlord management. \r\n Graduate/Junior Lawyer duties will include: • Drafting and amending legal documents, with particular emphasis on leases and associated documents • Lease registration, including liaison with mortgagees • Conducting searches • Attending to stamping of documents where required • File maintenance and management • Liaising with internal clients and professionals • Utilising PEXA efficiently and independently • Ad hoc administrative duties as required In order to be successful in this role, you will: • have strong attention to detail with a high level of accuracy • have strong written and verbal communication skills • be highly motivated and hard working • have a professional personal appearance and manner • be team orientated and be able to liaise with professionals at all levels • be able to meet deadlines • possess the proven ability to be flexible and adaptable • have a hands-on approach, be able to multi task and work autonomously • ideally have had some experience in or exposure to the property industry \r\n To apply for this opportunity with a stable, diversified and growing organisation, please email to pelliott@coombesgroup.com.au the following: 1) Your curriculum vitae; and 2) A letter (no longer than 1 page) specifically explaining the following: a. how your skill set, employment background and personality traits satisfy each of the requirements listed above; and b. why you wish to work for a private property investment and development group. \r\n Please note that applicants must hold Australian Permanent Residency status."
    },
    {
        "job_title": "CONSULTING PRINCIPAL",
        "job_type": "Full-time",
        "date_posted": "Oct 06, 2021",
        "company": "Lehman Walsh Lawyers",
        "description": "When your role is to create absolutes, flexibility in your workplace is key. \r\n  Your experience and our experience - the perfect match  \r\n As a legal professional, you know first-hand the challenges of balancing client representation with running your own business. You’ll also understand the amount of non-billable hours and overhead expenses success requires in the industry.  And so do we.  \r\n Based in the heart of Sydney’s CBD, we’ve earned a reputation for our forward-thinking and dynamic approach to legal services. This position in the industry renders a level of respect on which we thrive and on which we work extensively to maintain - every single day. \r\n You know the deal, because as a practitioner running your own practice, you’ve probably been burning the midnight oil to keep up with running a business as well as actually trying to complete the legal work you’re billing for. \r\n Over the past year, we’ve seen an increasing amount of legal professionals just like you “struggle to juggle”. It sparked an idea which we’ve brought to fruition. An evolution of the legal industry. What if you could actually shake the shackles of running your practice and just focus on being the exceptional lawyer you were meant to be?  \r\n Lehman Walsh offers an alternative to running your own practice, without sacrificing your independence and ability to call the shots.  \r\n  Freedom, Control & Flexibility  \r\n Our Consulting Principal model is a level up on running your own legal practice. Succinctly put - we provide the credibility of our brand, administrative services and a network of peers and you, well, you continue to work independently in your chosen legal specialty. \r\n Effectively you operate as an independent legal practitioner under the Lehman Walsh umbrella, secure in the knowledge that all the “office” and admin is taken care of.  \r\n You can probably already start to list the benefits yourself, but here are some you might want to consider: \r\n \r\n  Work remotely from wherever you are on the globe  \r\n \r\n You’ve worked hard to achieve independence. Working as a Consulting Principal to Lehman Walsh Lawyers means you can retain this independence and base yourself wherever you work best. When you do need an impressive location for face to face meetings, you can access our offices in Sydney’s MLC Building. \r\n \r\n  Unlimited access to the services of a large legal firm   \r\n \r\n We provide you with a full service offering for your clients. Administrative support, essential collaboration with experienced colleagues, paralegal staff and all the services you require from your own law firm. \r\n \r\n  Working in an environment where your seniority attracts respect - not politics:  \r\n \r\n Remove office politics, unnecessary hierarchy and unreachable targets from your life. When you work in an environment free from inter-office drama and experience the drive of colleagues to achieve common success, you’ll be surprised at the success you can attain!   \r\n \r\n  Leverage the credibility of an established Law Firm to build your client base:  \r\n \r\n There is no doubt that working with a respected, large firm is a strong magnet both for new business and the ability to attract significant rates. Working as a Consulting Principal allows you to utilise our reputation in the industry to grow your business. \r\n \r\n  You set your own goals and take the majority of the billings   \r\n \r\n Our Consulting Principals set their own goals. You’ll no longer have to meet billing targets whilst sacrificing the majority of your billings to the firm. \r\n We believe, afterall, that  you  are doing the work, so  you  deserve the biggest share.    \r\n \r\n  Set your own hours, choose your own clients and work on what makes you happy  \r\n \r\n You are in the driver’s seat, supported by a team, a culture and a brand that is motivated by your success. \r\n Our vision is to grow a legal firm which recognises that the interests of clients are best served by bringing together Consulting Principals who work within a culture that supports collaboration, values quality and dispenses with ego. \r\n  You do you. And we’ll look after the rest.  \r\n  What could this mean for me? \r\n Our Consulting Principals are all well supported, connected, and enjoy a flat rate service fee. Any charges to your clients in the first three months will be processed by Lehman Walsh at a 25% fee and following this at the rate of 30%.  \r\n So, if you have your own client list, and consider yourself to be a self-managing professional who values their own time and career freedom, it’s time to get in touch."
    },
    {
        "job_title": "Graduate/Junior Solicitor",
        "job_type": "Full-time",
        "date_posted": "Oct 06, 2021",
        "company": "McLean  Associates",
        "description": "We are a boutique law firm situated in Brookvale on the Northern Beaches, specialising in commercial litigation and corporate and personal insolvency.  As a small firm, we also provide legal services in a range of areas including debt recovery, conveyancing and property law, building and construction law and wills and estates. \r\n We are seeking a Graduate/Junior Lawyer who: \r\n \r\n Is hard working and able to show initiative; \r\n Is motivated and keen to learn; \r\n Is committed to developing organised and efficient work practices; \r\n Demonstrates an ability to work independently and as part of a team; \r\n Is passionate about working within a small team; \r\n Ideally has a minimum of at least 6 months experience and holds a practicing certificate; and \r\n Has experience working with LEAP. \r\n \r\n This is the perfect opportunity to live and work locally in a friendly and relaxed environment whilst being offered the opportunity to be immersed in challenging and interesting work.  Experience is not necessary, however, your desire and attitude to learn and show initiative is key. \r\n To apply for this role, please forward your cover letter and resume to info@mcleanlaw.net.au."
    },
    {
        "job_title": "Property Lawyer / Licenced Conveyancer",
        "job_type": "Full-time",
        "date_posted": "Oct 06, 2021",
        "company": "Summit Legal",
        "description": "We are a general law practice located in Sydney CBD practising in the area of property law, conveyancing, commercial litigation, wills and estate and family law. \r\n We are seeking a property lawyer or licenced conveyancer with no less than 2 years post admission experience.   \r\n The successful candidate will: \r\n \r\n be familiar with conveyancing (both established and off the plan property), leasing and purchase/sale of business; \r\n be proficient in PEXA and Leap; \r\n be able to work autonomously and manage their own files with minimum supervision; \r\n have exceptional time management and client management skills. \r\n \r\n Chinese language skill (Mandarin/Cantonese) is highly regarded but not essential.  \r\n Remuneration will be commensurate with the experience.  \r\n Please send the application with a current CV and academic transcript to  davis@summitlegal.com.au"
    },
    {
        "job_title": "Graduate/Junior Solicitor",
        "job_type": "Full-time",
        "date_posted": "Oct 01, 2021",
        "company": "Todd &amp; Walker Law",
        "description": "Graduate or Junior Solicitor 0-2 years PQE | Wanaka   \r\n  An excellent opportunity for a graduate or junior solicitor to take the next step in their career in one of Central Otago’s leading law firms.   \r\n  The Role  \r\n We are looking for a graduate or junior Solicitor with 0-2 years PQE to join our growing Wanaka practice in our property and commercial team. \r\n Working closely alongside a Senior Associate and Associates of the firm, this is an excellent opportunity to develop your career in a supportive team environment.  You will get the opportunity to advance across a variety of areas including general property and conveyancing, resource management, trusts and general practice and commercial law including work on large scale property developments and corporate advice and structuring.   \r\n The role will be based full time in Wanaka so you must have a genuine interest for working in Wanaka.   \r\n  About You  \r\n You may be a recent graduate who has started your professional studies, or a junior solicitor with 0-2 years PQE who is interested in continuing their career development in the areas of property, commercial and general practice. \r\n We are looking for someone with the following attributes: \r\n \r\n A genuine enthusiasm for working in the areas of property and commercial law; \r\n Strong academic results or experience in a general practice law firm; \r\n Compelling written and verbal communication skills; \r\n High attention to detail; \r\n Pro-active and confident in the way they approach their work; and \r\n The ability to work well as part of a team. \r\n \r\n  What you will receive from us:  \r\n You will get the opportunity to: \r\n \r\n Receive an interesting and varied quality workload working with a broad range of clients including individuals, small to medium businesses and large-scale property developers; \r\n Work in a firm that places a focus on the continuing professional and personal development of its people; we actively encourage ongoing training, networking and progression; \r\n Work as a valued part of a friendly and supportive team; and \r\n Join a workplace with a fantastic culture for working hard and enjoying what we do. \r\n \r\n TODD & WALKER Law is one of Central Otago’s leading all service law firms. We were recently recognised as being one of New Zealand's six emerging legal firms and are... \"a boutique law firm with a small firm culture capable of tackling big law jobs\". Operating from offices in Queenstown and Wanaka, we pride ourselves on having a reputation for delivering experienced, pragmatic, high quality advice for our clients. \r\n  At TODD & WALKER Law our team are important to us, we are known as fantastic employers who reward our staff with excellent remuneration and other benefits packages. \r\n If you are interested in applying for the position, please email your application including a CV, cover letter and a copy of your academic transcripts if you have just graduated to our Office Manager, Louise Gill at  louise@toddandwalker.com ."
    },
    {
        "job_title": "Compliance Officer",
        "job_type": "Full-time",
        "date_posted": "Oct 01, 2021",
        "company": "Perigon Group",
        "description": "Perigon Group are supporting one of Australia's longest running Super Funds on the organic growth of their Compliance Function.   Your role as a Compliance analyst:   Reporting to the Head of Regulatory Compliance, you are responsible for monitoring, reviewing and supporting compliance activities, with a focus on managing regulatory compliance risk.  The role will review, revise and maintain policies, procedures and processes that are fit for purpose and comply with the legislative and regulatory requirements applicable to the superannuation industry.   Responsibilities include:  \r\n \r\n Review, implementation and maintenance of a compliance framework \r\n Assist with the review and maintenance of key compliance registers such as incidents, breaches & complaints \r\n Monitor, assess & communicate regulatory changes impacting on key superannuation & financial services regulatory obligations (SIS act, RSE licence, AML/CTF Act etc) \r\n Assist with Dispute Resolution, including providing advice to the business \r\n Engage, collaborate and facilitate regulatory change projects \r\n Act as a regulatory compliance SME on broader business projects \r\n Contribute to developing and reviewing the compliance controls for the Risk strategy \r\n Build and maintain effective relationships with relevant internal and external stakeholders    \r\n \r\n  To be considered, you will need:   \r\n \r\n Degree level qualification in Law, Commerce or relevant discipline  \r\n Experience in compliance management in superannuation and/or financial services, gained within Legal Practice or in-house \r\n  New graduates will also be considered  \r\n \r\n This is an excellent permanent opportunity to join a strong Risk & Compliance team within a leading Superannuation business, please Apply Now or contact Jade Blackburn on 07 3854 3803 to discuss further."
    },
    {
        "job_title": "PLT Work Experience Placement",
        "job_type": "Part-time",
        "date_posted": "Oct 01, 2021",
        "company": "Szabo & Associates, Solicitors",
        "description": "We are a boutique firm in Surry Hills seeking a motivated and focused law graduate looking to complete their Practical Legal Training to join our team. \r\n You will be given the opportunity to be mentored by experienced Lawyers and to develop your legal skills and experience in various areas of law including Wills and Estate Planning, Deceased Estates, Property Law, Property and Will litigation, Conveyancing and Family Law. \r\n Your duties will include, among other things: \r\n \r\n General administrative tasks such as attending to incoming calls and archiving closed matters. \r\n File management via LEAP documents management software. \r\n Conducting legal research and drafting memorandums. \r\n Assisting in preparing legal blogs and marketing material. \r\n Drafting legal documents under supervision. \r\n Ad hoc duties. \r\n \r\n  To be successful, you will: \r\n \r\n Be available to work 3 days per week. \r\n Possess excellent verbal and written communications skills. \r\n Have a high attention to detail. \r\n Be able to balance work with study. \r\n Have a positive attitude and be organized and motivated. \r\n Be willing to learn. \r\n Possess the ability to both follow instructions and also be pro-active and work independently. \r\n Have an interest in writing legal content. \r\n \r\n Please note: This position is unpaid however, the right candidate will  receive ongoing training and potential employment opportunity. \r\n Please also note: This position is only open to law graduates seeking to complete their compulsory PLT placement."
    },
    {
        "job_title": "Herro Solicitors Graduate Programme 2021/22 (Law Graduate or Solicitor with up to 3 years PAE)",
        "job_type": "Full-time",
        "date_posted": "Oct 01, 2021",
        "company": "Herro Solicitors",
        "description": "About the firm  \r\n Our practice areas are property law (with a focus on retail leasing), litigation, dispute resolution (in particular mediation) and commercial law. \r\n We act for some of Australia's leading retail brands and international brands. \r\n  About the role  \r\n We are seeking a law graduate or solicitor (with up to 3 years post admission experience) to join our team. \r\n  What is it like to work at Herro Solicitors?  \r\n Our firm culture is best described as professional yet personable. \r\n We are genuinely client focused. \r\n Whilst we provide legal advice of the highest professional standard, we do so in a friendly and genuine way.  \r\n You are exposed to client contact at an early stage. \r\n We provide on going training and mentoring -we want you to excel in your career. \r\n We offer you: \r\n \r\n A competitive \"top tier\" salary package with incentives/profit share and bonuses \r\n Career progression and annual performance reviews. \r\n An inclusive and supportive team environment. \r\n Cutting edge technology to assist you in your work. \r\n A sensible work/life balance. \r\n Ongoing training and support \r\n \r\n   About you – Selection Criteria  \r\n We look for the following: \r\n \r\n Excellent character– honesty, integrity and sincerity are essential personal characteristics. \r\n Excellent academic results \r\n Excellent verbal and written communication skills \r\n Strong attention to detail \r\n Genuine commitment to achieving exemplary outcomes for clients. \r\n \r\n  Time frame for commencement of employment  \r\n \r\n To be mutually agreed (ideally October or November or December 2021) . All of the team are  currently working from home due to Covid 19 restrictions and we will provide you with all necessary technology (including laptop) to enable working from home at this time. \r\n \r\n  How to apply  \r\n If this opportunity is what you have been looking for, please  forward your application to Mr Anthony Herro, Principal Solicitor, Herro Solicitors including the following: \r\n \r\n Covering letter addressing each of the Selection Criteria; \r\n Resume/CV including contact details for 3 referees; and \r\n Academic Transcript. \r\n \r\n If you have any further questions regarding this opportunity, please email Anthony at  careers@herro.com.au  or telephone on a confidential basis on  0418 407 418 ."
    },
    {
        "job_title": "Graduate Lawyer",
        "job_type": "Full-time",
        "date_posted": "Oct 01, 2021",
        "company": "Vinh Duong & Associates",
        "description": "Vinh Duong & Associates has an excellent opportunity for a full-time Lawyer who is either recently admitted or a Graduate Lawyer with 1 to 2 years of experience to join us in our Bankstown head office. You will get hands-on experience dealing with our clients and work in a range of matters. You will be providing legal services in a number of areas of law including: \r\n \r\n Property Law \r\n Commercial Law \r\n Family Law \r\n Wills and Probate \r\n \r\n You will be provided training from highly regarded practitioners and will be in contact with clients from the start, eventually running your own files under supervision. Your work involves: \r\n \r\n Providing consultations to clients on:\r\n \r\n the sale and purchase of residential property and commercial businesses \r\n retail and commercial leases \r\n franchising and licensing agreements \r\n separation, divorce and spousal maintenance \r\n \r\n \r\n Conducting and applying legal research in multiple areas of law \r\n Appearing on behalf of clients in court proceedings \r\n Drafting and preparing various contracts, agreements and court documents \r\n Negotiating and liaising with various stakeholders in a timely manner \r\n \r\n The ideal candidate would possess the following: \r\n \r\n Newly admitted as a lawyer or will be admitted within the next few months \r\n Have 1 to 2 years of experience in any of our areas of practice \r\n Ability to speak, read and write in Vietnamese \r\n Ability to work in a high paced environment \r\n Excellent written and communication skills \r\n Be proactive and have a high level of attention to detail \r\n Ability to work autonomously and exercise problem-solving skills \r\n \r\n  How to apply  \r\n Please email a copy of your resume and cover letter to admin@vinhduong.com.au. Only shortlisted candidates will be contacted."
    },
    {
        "job_title": "Junior Solicitor - Disability Law NSW",
        "job_type": "Full-time",
        "date_posted": "Oct 01, 2021",
        "company": "Mid North Coast Legal Centre",
        "description": "Disability Law NSW, is a program of Mid North Coast Legal Centre and both services form part of Advocacy Law Alliance Inc. \r\n Mid North Coast Legal Centre (MNCLC) is an innovative community legal centre providing civil law services in the local government areas of MidCoast, Port Macquarie – Hastings, Kempsey Shire, Nambucca Shire, Bellingen Shire and Coffs Harbour.  We have offices in Port Macquarie and Coffs Harbour. \r\n  DESCRIPTION OF ROLE  \r\n Position funded via Disability Advocacy NSW (DA NSW) to provide specialist civil legal advice to clients with disability and their carers accessing DA NSW for advocacy support.   \r\n This position is embedded in the MNCLC team, supervised by the Principal Solicitor. \r\n The junior solicitor will undertake intake and provide generalist civil legal advice, education and outreach where appropriate.  \r\n The junior solicitor will work closely with the Senior Solicitor – Disability Law in the provision of specialist civil legal advice to clients with disability and their carers. \r\n What we can offer you: \r\n \r\n 12-month fixed term, full-time opportunity, 38 hours per week across Monday to Friday; \r\n \r\n SCHADS Award, Pay Point 4.1 - Package $80,302.06 (annual Wages $72,361.12 + advance leave loading $974.09 + Superannuation $6,966.85). \r\n Employment will be initially offered for a 12-month fixed term contract, with options for renewal by us; \r\n \r\n Additional paid leave (in addition to statutory annual leave entitlements); \r\n Salary packaging options available within ATO limits and guidelines; \r\n Access to company car for work travel; \r\n Ongoing training and development opportunities; and \r\n Supportive and rewarding team culture. \r\n \r\n This Junior Solicitor position is primarily responsible for the delivery of legal services. \r\n  AREAS OF RESPONSIBILITY  \r\n  Key relationships  \r\n \r\n Principal Solicitor, Senior Solicitor- Disability Law \r\n Deputy CEO and Manager Advocacy \r\n \r\n  Legal Practice  \r\n \r\n Provide specialised disability legal advice for Disability Advocacy NSW (DA) advocates and their clients across the DA catchment area (Mid North Coast, Hunter-Central Coast, Blue Mountains-Sydney West, New England and Central West, West and Far West NSW.) \r\n Undertake legal practice (case work and legal advice) in line with the Centre’s business plan and the Centre’s Legal Practice Manual. \r\n Provide high quality legal advice regarding all areas of civil law affecting people with disabilities. \r\n Provide high quality general and structured referrals for people with disability and their associates. \r\n Provide generalist civil legal advice, education and outreach where appropriate. \r\n \r\n  Law Reform and Community Legal Education  \r\n \r\n Assist with provision of community legal education workshops in line with the centre’s strategic plan. \r\n In collaboration with DA NSW and Senior Solicitor – Disability Law NSW, contribute to law reform activities in relation to civil law issues affecting people with disability and their associates. \r\n Identify opportunities for community legal education, publications, projects, and engagement with allies and stakeholders, in pursuit of the Centre’s strategic goals. \r\n \r\n  General  \r\n \r\n Assist in the general administration of the centre. Undertake shared intake and administration duties, including answering phones. \r\n Accurately record advice, casework, and other service activities onto the CLASS database. \r\n Provide input into the centre’s strategic (business) plan especially in relation to trends noted in the operation of the legal practice. \r\n Carry out other appropriate tasks as directed by your supervisor. \r\n \r\n  SELECTION CRITERIA  \r\n \r\n Demonstrated understanding of and commitment to social justice. \r\n A current NSW practising certificate or eligibility to obtain one and willingness to travel within the geographic catchment area. \r\n Ability to collaborate with non-legal disability advocates in getting positive outcomes for clients with disability and their carers. \r\n Excellent written and oral communication skills, including an ability to communicate clearly in plain English with diverse groups including indigenous people and people with disabilities. \r\n Willingness to undertake presenting at workshops or other educational events. \r\n Well-developed interpersonal skills, including conflict resolution skills and the ability to work well within a team environment including under supervision of the Principal Solicitor. \r\n Driven by integrity, responsibility, accountability, attention to detail and pride in work. \r\n Local court advocacy skills would be advantageous. \r\n \r\n CALD, ATSI and people with a disability are all encouraged to apply for this role. All applications will be assessed on merit against the selection criteria and in accordance with equal employment opportunity principles.  \r\n For more information about MNCLC, see www.mnclegal.org.au [link removed]  For more information about DA NSW, see www.da.org.au [link removed]  For more information about the position contact Catherine Peek and Jane Titterington via email at info@mnclegal.org.au [link removed]  \r\n Submission Checklist  \r\n Do you have:   \r\n \r\n A cover letter including contact details \r\n A document that addresses each of the selection criteria listed above (please include this with your cover letter or resume document for ease of submission via Seek) \r\n A current resume including two current professional referees \r\n \r\n The successful applicant will be required to undertake a criminal record check and obtain a clear Working with Children Check. \r\n Applications which do not address the selection criteria will not be considered.  \r\n  Applications close 5:00pm, 8 October 2021. Interviews will take place in following weeks via Microsoft Teams."
    },
    {
        "job_title": "Paralegal",
        "job_type": "Full-time",
        "date_posted": "Sep 29, 2021",
        "company": "O'Sullivan Legal",
        "description": "A growing legal practice in the Sydney CBD is looking for a paralegal to assist with a wide variety of  family law matters.  \r\n Ideally, you are available on a full-time basis, although applications will also be considered for those available 4 entire days per week.  \r\n You will be reliable, well-presented and have a ‘can do’ attitude.   \r\n You will gain the opportunity to work for a reputable firm in a supportive and friendly office environment. \r\n To be considered for the role, please forward your CV to  tom@osullivanlegal.com.au"
    },
    {
        "job_title": "Law Clerk/Paralegal",
        "job_type": "Full-time",
        "date_posted": "Sep 29, 2021",
        "company": "Turnbull Legal Solutions",
        "description": "Turnbull Legal Solutions is a small, busy general practice in Armidale. We are seeking an experienced Law Clerk/Paralegal to join our small but friendly firm. \r\n  About the role  \r\n As this is a general practice you will have exposure to many areas of law including family law, wills/estates and conveyancing.  \r\n You will be responsible for managing conveyancing matters from start to finish. The successful applicant needs to be confident in all aspects of the conveyancing process. \r\n  About you  \r\n The ideal candidate will have: \r\n \r\n Experience in all aspects of residential conveyancing \r\n The ability to work autonomously \r\n Attention to detail \r\n Great communicator \r\n Experience with LEAP and Infotrack (preferred) \r\n Experience using PEXA \r\n \r\n Salary will be based on your experience and position is available for an immediate start. Potential for bonuses to be earned based on your ability to exceed a very reasonable budget.  \r\n If you want to be part of a workplace where you are valued as an individual, please email cover letter and CV to  nicole@turnbulllegal.com.au"
    },
    {
        "job_title": "Intern",
        "job_type": "Part-time",
        "date_posted": "Sep 29, 2021",
        "company": "No Borders Law Group",
        "description": "Interns to gain legal knowledge   \r\n We are a legal practice which has specialised in Australian migration law for over 20 years.  Over the years we have assisted a multitude of clients and businesses and mentored many lawyers and paralegals, many of whom have become accomplished immigration lawyers themselves.   \r\n We currently offering unpaid internship for students who require to meet the PLT placement requirement. \r\n No Borders Law Group is an exciting, fast spaced and dynamic legal firm  where we value our clients. \r\n See you soon. \r\n  reception@nobordersgroup.com.au"
    },
    {
        "job_title": "Front of House / Receptionist",
        "job_type": "Full-time",
        "date_posted": "Sep 29, 2021",
        "company": "Easymigrate - Australian Migration & Citizenship Services / Loughton Yorke Lawyers",
        "description": "We have a job vacancy at our law firm, Loughton Yorke Lawyers and our immigration firm, Easymigrate. It is a front of house/receptionist role, Monday - Friday 9.00am - 5.30pm (hours may be able to be flexible if the job applicant is a current law student). Salary dependent on experience. Please send all enquiries, resume/CV to info@loughtonyorkelawyers.com"
    },
    {
        "job_title": "PLT Placement",
        "job_type": "Part-time",
        "date_posted": "Sep 28, 2021",
        "company": "No Borders Migration Advocates",
        "description": "Our law practice is a well-established specialist firm in the area of Australian migration law and registered with the NSW Law Society as No Borders Legal Advocates. \r\n Over the course of 20 years of successful presence and experience in the industry, we've assisted multitudes of clients and businesses and also mentored many lawyers and paralegals who are now accomplished Immigration Lawyers themselves. \r\n We are seeking PLT students to assist lawyers across broad areas of responsibility. \r\n Successful applicants will be supervised by an approved supervisor who holds a full NSW unrestricted practising certificate as a legal practitioner. \r\n Whilst the position is unpaid, you will learn about our work while developing the practical, day-to-day skills you will need as an entry-level lawyer. \r\n We are committed to approve 75 days of placement as per NSW Work Experience Rules. \r\n The successful applicant will meet the following criteria: \r\n \r\n enrolled with College of Law or has approval for early commencement of PLT \r\n demonstrated interest in Australian Migration law \r\n excellent attention to detail \r\n good computer and strong organization skills \r\n well-developed interpersonal and communication skills \r\n proficiency with Microsoft Office suite including Word, Excel and Outlook \r\n ability to prioritise tasks and meet deadlines \r\n excellent English skills \r\n immediate start \r\n a second language is desirable but not mandatory \r\n have been fully vaccinated \r\n \r\n Please email your cover letter and resume to Mark Abalos at  marka@nobordersgroup.com.au   \r\n Please also indicate your email your earliest availability for an interview."
    },
    {
        "job_title": "Junior Property Lawyer",
        "job_type": "Part-time",
        "date_posted": "Sep 28, 2021",
        "company": "Coombes Property Group",
        "description": "Coombes Property Group (“CPG”) is an owner, developer and manager of a diverse portfolio of retail, office, hotel and land holdings in many CBD and suburban markets across Australia. \r\n We are looking for a final year law student who is a commercially minded, well rounded, and dedicated professional who is passionate about property. This role will initially be part-time until February 2022, when it will pivot to a full-time role. The selected candidate will work closely with our experienced General Counsel and the wider business in the areas of lease and landlord management. \r\n Graduate/Junior Lawyer duties will include: • Drafting and amending legal documents, with particular emphasis on leases and associated documents • Lease registration, incl liaison with mortgagees • Conducting searches • Attending to stamping of documents where required • File maintenance and management • Liaising with internal clients and professionals • Utilising PEXA efficiently and independently \r\n To apply for this opportunity with a stable, diversified and growing organisation, please email to pelliott@coombesgroup.com.au the following: 1) Your curriculum vitae; and 2) A letter (no longer than 1 page) specifically explaining the following: a. how your skill set, employment background and personality traits satisfy each of the requirements listed above; and b. why you wish to work for a private property investment and development group. Please note that applicants must hold Australian Permanent Residency status."
    }
][
    {
        "job_title": "PLT Placement",
        "job_type": "Part-time",
        "date_posted": "Sep 28, 2021",
        "company": "No Borders Migration Advocates",
        "description": "Our law practice is a well-established specialist firm in the area of Australian migration law and registered with the NSW Law Society as No Borders Legal Advocates. \r\n Over the course of 20 years of successful presence and experience in the industry, we've assisted multitudes of clients and businesses and also mentored many lawyers and paralegals who are now accomplished Immigration Lawyers themselves. \r\n We are seeking PLT students to assist lawyers across broad areas of responsibility. \r\n Successful applicants will be supervised by an approved supervisor who holds a full NSW unrestricted practising certificate as a legal practitioner. \r\n Whilst the position is unpaid, you will learn about our work while developing the practical, day-to-day skills you will need as an entry-level lawyer. \r\n We are committed to approve 75 days of placement as per NSW Work Experience Rules. \r\n The successful applicant will meet the following criteria: \r\n \r\n enrolled with College of Law or has approval for early commencement of PLT \r\n demonstrated interest in Australian Migration law \r\n excellent attention to detail \r\n good computer and strong organization skills \r\n well-developed interpersonal and communication skills \r\n proficiency with Microsoft Office suite including Word, Excel and Outlook \r\n ability to prioritise tasks and meet deadlines \r\n excellent English skills \r\n immediate start \r\n a second language is desirable but not mandatory \r\n have been fully vaccinated \r\n \r\n Please email your cover letter and resume to Mark Abalos at  marka@nobordersgroup.com.au   \r\n Please also indicate your email your earliest availability for an interview."
    },
    {
        "job_title": "Expert Witness - Head Hunter",
        "job_type": "Full-time",
        "date_posted": "Sep 28, 2021",
        "company": "ExpertsDirect",
        "description": "ExpertsDirect  is a leading legal services company that streamlines the process of sourcing expert witnesses for litigation. \r\n An expert witness is at the top of their field; with their training, study or experience qualifying them to give their independent opinion about facts for a case during legal proceedings. \r\n We seamlessly match lawyers with experts to achieve the best possible outcome. \r\n  Is this the perfect role for you?  \r\n \r\n We are looking for someone who does not want to pursue the traditional law path.  \r\n Enjoys communicating with others and enjoys a chat.  \r\n Is detailed oriented and organised. \r\n Loves working in a collegiate environment.  \r\n Love learning new things.  \r\n Wants a place at the table to contribute to the growth of the company.  \r\n \r\n  What we offer  \r\n \r\n  Ongoing development  - we are a bright young company with a strong focus on developing our people \r\n  Training offered  - ongoing training and the freedom to explore areas of interest is encouraged \r\n  Amazing opportunities  - you are given the chance to work with world-leading experts and high-profile cases along with invitations to networking events \r\n  Great structure  - Work alongside the CEO and the COO in our Pitt Street location \r\n  Work/life balance  - a strong focus on maintaining a good work/life balance with a work culture that focuses on the well-being of our people \r\n \r\n   The role   \r\n Your main responsibility will be to source and provide the most suitable expert witnesses for litigation. In addition, you will strive to improve organisational and administrative practice to support the CEO and COO. \r\n  Your day-to-day  \r\n \r\n Manage requests for expert witnesses \r\n Communicate with and qualify experts over the phone and email \r\n Research, find and match the most suitable expert using an internal database as well as external resources \r\n Vet, qualify and conduct background checks of potential experts \r\n Maintain and foster relationships with clients and subject matter experts \r\n Manage and grow internal database to ensure accurate matching between experts and clients \r\n \r\n   Your assets   \r\n \r\n Your friends say you have strong communication skills, both verbal and written  \r\n You have proven legal research experience or knack for finding hard to find things \r\n Proven critical and strategic thinking skills \r\n Good at problem solving issues in life \r\n Confidence communicating with people from diverse background over the phone and email \r\n Detailed oriented \r\n Great memory and good at connecting the dots \r\n Legal experience,   desired"
    },
    {
        "job_title": "Case Manager - Full-time",
        "job_type": "Full-time",
        "date_posted": "Sep 28, 2021",
        "company": "ExpertsDirect",
        "description": "ExpertsDirect  is a leading legal services company that streamlines the process of sourcing expert witnesses for litigation. \r\n An expert witness is at the top of their field; with their training, study or experience qualifying them to give their independent opinion about facts for a case during legal proceedings. \r\n We seamlessly match lawyers with experts to achieve the best possible outcome. \r\n  Is this the perfect role for you?  \r\n \r\n We are looking for someone who does not want to pursue the traditional law path \r\n Enjoys communicating with others and enjoys a chat \r\n Loves being super organised \r\n Takes pride in providing excellent client services \r\n Enjoys processes \r\n Wants a place at the table to contribute to the growth of the company \r\n \r\n  What we offer  \r\n \r\n  Ongoing development  - we are a bright young company with a strong focus on developing our people \r\n  Training offered  - ongoing training and the freedom to explore areas of interest is encouraged \r\n  Amazing opportunities  - you are given the chance to work with world-leading experts and high-profile cases \r\n  Great structure  - Work alongside the CEO and the COO in our CBD location \r\n  Work/life balance  - a strong focus on maintaining a good work/life balance \r\n \r\n   The role   \r\n Your main responsibility will be to source and provide the most suitable expert witnesses for litigation. In addition, you will strive to improve organisational and administrative practice to support the CEO and COO. \r\n  Your day-to-day  \r\n \r\n Liaising between experts and lawyers to ensure smooth conduct of each case \r\n Ensure deadlines are adhered to \r\n Work with the Research team to ensure the right expert is appointed for each case \r\n Work with the quality assurance team to ensure that the expert reports are admissible in court  \r\n Problem resolution if any issues arise during the report writing process \r\n \r\n   Your assets  \r\n \r\n Prior experience in a customer service or relationship management to corporate clients  \r\n Proven ability to provide exceptional client service \r\n Proven objection handling skills, adaptable and the ability to think outside the box \r\n Ability to prioritise a constantly changing workload \r\n Loves to be exceptionally organised \r\n Legal background desirable but not essential  \r\n \r\n  To express your interest please apply via marie@expertsdirect.com with a CV and cover letter. Applications without a cover letter will not be considered."
    },
    {
        "job_title": "Junior Solicitor/ Paralegal",
        "job_type": "Full-time",
        "date_posted": "Sep 27, 2021",
        "company": "City Pacific Lawyers",
        "description": "Junior Solicitor/Paralegal \r\n Small Bayside Commercial Practice \r\n Opportunity to work with an experienced senior commercial lawyer and property lawyer in a small firm environment. \r\n Broad commercial and litigation practice with exposure to property and conveyancing, wills and estates. \r\n  You must have: \r\n \r\n Strong admin skills \r\n Experience working in a commercial law firm \r\n Excellent writing skills \r\n Attention to detail \r\n Commercial experience gained through employment \r\n An interest in conveyancing, property law and commercial law \r\n Good people skills \r\n Ability to form good relationships with clients and staff \r\n Excellent communication skills \r\n Strong negotiation skills \r\n Marketing and business development skills \r\n Enthusiasm and a desire to learn \r\n A reputation for being reliable and hardworking \r\n Experience using MS Office and LEAP software a plus \r\n Preference given to those living locally \r\n \r\n Full-time and part-time roles available. Please only apply if you have a stable work history and a desire for a long-term career opportunity. \r\n Only applicants with legal right to work in Australia will be considered.  \r\n If you meet the criteria, you may apply by sending your covering letter, CV, at least two (2) references and academic results to: \r\n  elizabeth@citypacific.com.au .  Applications close 15 Oct 2021. \r\n Note: Only short listed candidates will be contacted."
    },
    {
        "job_title": "Law cadetship program",
        "job_type": "Part-time",
        "date_posted": "Sep 27, 2021",
        "company": "Birman & Ride",
        "description": "We invite applications from law students for positions as cadet lawyers.  \r\n  This is a rare opportunity for students who are keen to acquire practical legal skills by working in a modern law firm.  \r\n These are permanent career positions with reduced and flexible working hours during university semesters to accommodate your studies on a reduced-load basis. They include annual leave, sick leave and superannuation calculated on a pro-rata basis. They are not vacation clerkships; nor are they designed to offer temporary student employment.   \r\n We offer a high level of supervision, support and regular in-house training; however, we expect you to acquire practical skills quickly in your designated area of employment with a view to making a meaningful contribution. \r\n We encourage cadets to perform well academically and to participate to a reasonable degree in extra-curricular university activities.  Our alumni include winners and finalists of the UWA Opening Mooting, Trial Advocacy and Negotiation competitions. In 2017 one of our members spent the year studying in Beijing and Hong Kong on a New Colombo Plan Scholarship. \r\n  What does the job entail?  \r\n You will be employed as a legal professional.  \r\n You will start your career in our  real estate settlements  workgroup. This area has a high volume of client files and well-established systems for delivering services. There you will learn our office procedures and how to use our legal practice management system   ContactsLaw  . \r\n A mentor will monitor your progress and help you develop the skills you need to hit the ground running and operate as an effective member of our professional team. You will take charge of and manage client files from the outset.  \r\n Additionally, we encourage all members of our team to participate in the management of the firm, for example, in marketing activities, software development, systems administration, or document management. \r\n The practical skills that you acquire should kick-start your career in law and place you well ahead of your peers professionally by the time that they graduate. \r\n  What we offer  \r\n \r\n You will be employed on a permanent basis subject to a six month probation period. \r\n You will be paid at the Legal Services Award rate, plus superannuation.   You will be entitled to annual leave and paid sick leave.  You will be entitled to an average of 13 hours per week study leave during university semesters. \r\n Your performance and remuneration will be formally reviewed annually. We will pay you according to the value of your ability and contribution not your level of qualifications or years of experience. \r\n \r\n  What we're looking for  \r\n To be considered for these positions you will: \r\n \r\n be enrolled in a law course at a local university; \r\n have a strong ATAR, (or TER/TEE) score and above average university grades; \r\n be committed to a professional career as a lawyer in the private sector; \r\n be sufficiently self-disciplined to balance the competing demands of a responsible job, university studies and a personal life; \r\n keenly embrace technology as a means of enhancing the delivery of legal services; \r\n be a leader and a team player; and \r\n have a sense of humour. \r\n \r\n You must be prepared to work an average of 25 hours per week (although there is scope for flexibility depending on exam schedules etc) during university semesters and full-time during university holidays; and to reduce the level of your university commitments accordingly.  You must accept that, in doing so,  it will take longer to complete your degree .  \r\n You will benefit from our experience in helping cadets manage their work and study loads; however it requires considerable self-discipline on your part (eg studying on the weekends!). Our cadetships are demanding jobs that require a serious investment of time and energy. \r\n  A different kind of law firm  \r\n Although we have been in business for over 40 years, we strive to lead as a digital law firm and have embraced the NewLaw business model. As part of this revolution, you will participate in enhancing our clients’ experience. \r\n Find out more  about us here . \r\n  FAQs  \r\n  What happens when I graduate?  \r\n We hope that you will remain with us for many years; if you are still with us by the time you graduate we would expect our relationship to continue uninterrupted. \r\n  And my holidays?  \r\n Consistent with our long-term approach to our relationships we will do our best to accommodate your need to see the world by negotiating extended leave arrangements in appropriate circumstances. \r\n  Will my career prospects be adversely affected if I delay completion of my degree?  \r\n As a cadet lawyer under our supervision you are able to undertake virtually all of the duties of an admitted lawyer except appearances in open court. The practical experience you will gain working in our professional environment will more than compensate you for the additional time it will take you to graduate.  \r\n  Can I undertake Internships with other law firms?  \r\n Many firms offer students work experience in their offices as a possible prelude to employment.  It is a term of your employment contract with us that you don’t engage in any other form of employment and we don’t see such internships as consistent with the positions that we are offering.  We know that it’s a tough call when you’ve had little or no industry experience, but we’re looking for people who have weighed the alternatives and worked out what environment is most likely to suit them. \r\n  More information  \r\n \r\n Talk to one of team: visit   our team   page for their direct telephone numbers. \r\n Read  why we are here  and more about  careers at Birman & Ride . \r\n Check out our websites –  Flat Rate Settlements ,  Perth Wills Centre ,  Perth Probate Centre ,  Resolution Family Law ,  Get Paid Debt Collection ,  ContactsLaw  \r\n \r\n  How do I apply?  \r\n Applications must be made through our  online form [click here] . \r\n  Application timetable  \r\n Applications close: 8 October 2021 \r\n Interviews: Week commencing 11 October 2021 \r\n  Before you apply  \r\n \r\n Critically review the above criteria. Is the job for you? Do you have what it takes? Have you discussed it with your partner? Your Dad? Or your dog? Are you prepared to reorganise your life to meet the demands of the position? \r\n Consider your existing study load and how you would restructure it if you take the job. We understand that you have to complete the university units you've enrolled in this semester, but you will need to undertake fewer units per semester in the future."
    },
    {
        "job_title": "Volunteer PLT Placement for Law Graduate",
        "job_type": "Part-time",
        "date_posted": "Sep 27, 2021",
        "company": "Bellissimo Lawyers",
        "description": "Opportunity for PLT students to undertake a volunteer placement at a boutique law firm in the heart of Sydney. You will be participating in a team dealing with a variety of legal matters specialising in personal injury law including motor accidents, public liability, medical negligence and workers compensation matters including Federal Court of Australia, family law, criminal law and commercial law in jurisdictions that cover the Eastern seaboard of Australia. Applicants need to be available for at least 2 days per week for a minimum period of 4 months. \r\n Possible employment opportunities at conclusion of placement."
    },
    {
        "job_title": "PLT Work Experience - VOCAT",
        "job_type": "Part-time",
        "date_posted": "Sep 27, 2021",
        "company": "YourLawyer",
        "description": "You will be joining a dedicated and professional victims of crime team assisting applicants access the services and support available to them through VOCAT. The team is critical to ensure that victims are not denied the opportunity to obtain assistance with counselling, medical and other expenses related to injury and loss suffered as a result of the crime committed. \r\n This voluntary vocational work experience role provides training and exposure to key areas such as client engagement, file management, briefing counsel, drafting correspondence, evidence preparation and court procedures. \r\n Some exposure to personal injury, migration and debt recovery may also be available. \r\n Our clients are victims of violent crime. Applicants will need to be prepared to come alongside these people and help them navigate VOCAT as one small part of their recovery. You will need compassion, resilience and excellent administrative and communication skills."
    },
    {
        "job_title": "PLT trainee/Graduate solicitor",
        "job_type": "Full-time",
        "date_posted": "Sep 27, 2021",
        "company": "Flyworld Migration and Legal Services",
        "description": "PLT placement    Flyworld Lawyers is one of the leading law firms and a branch of Flyworld group of companies established in 2012. We are seeking Suitable PLT students to join our team of Solicitors in our newly established Family Law practice.   Job description    \r\n \r\n Legal research, analysis and drafting \r\n Filing management including electronic storage \r\n Client communication and liasion including answering client enquiries and taking instructions \r\n General support for office duties \r\n \r\n   Qualifications and personal attributes  \r\n \r\n Second year Law students/Law graduates \r\n Excellent communication skills \r\n Highly motivated self starters \r\n Ability to follow instructions \r\n Keen learners \r\n \r\n  You will be a part of team led by highly experienced professionals.Suitable candidates have opportunities to be absorbed into the team.   How to apply   Please send your CV/ Resume, cover letter and academic transcript to tnamboothiri@flyworldau.com"
    },
    {
        "job_title": "PLT Work Place Experience",
        "job_type": "Full-time",
        "date_posted": "Sep 24, 2021",
        "company": "One Law Group",
        "description": "We have PLT positions available across our family, business & commercial and personal injury law teams.  We are looking for highly motivated applicants who wish to pursue a career in law.  \r\n To be successful in this role you will need to demonstrate: \r\n \r\n Excellent written and verbal communication skills; \r\n An ability to learn quickly and work in a fast-paced environment; and \r\n Strong attention to detail.  \r\n \r\n Early applications are encouraged and an immediate start is available. You must be able to work a minimum 4 days a week but 5 is preferable.  \r\n Applications should be emailed through to  reception@onelaw.com.au  with your CV and academic transcript."
    },
    {
        "job_title": "Conveyancer / Settlements Clerk",
        "job_type": "Full-time",
        "date_posted": "Sep 24, 2021",
        "company": "Birman & Ride",
        "description": "We need a Conveyancer / Settlements Clerk to join our close-knit settlements team. \r\n \r\n \r\n You will manage client files and relationships from the outset \r\n \r\n \r\n No previous experience in real estate settlements is required  \r\n \r\n \r\n Innovative law firm leading the conveyancing industry in Western Australia \r\n \r\n \r\n Two full-time positions available \r\n \r\n \r\n  Role and responsibilities  \r\n You will join our busy  Flat Rate Settlements  team, taking charge of and managing all aspects of conveyancing matters. We have a high volume of client files and well-established processes for delivering services using our legal practice management system  ContactsLaw .  You will manage client files and relationships from the outset.  Initially you will work under the supervision of the settlements team leader, however we would expect you to work fairly autonomously (in the team environment) within the short to medium term. \r\n The many good aspects of joining our team include :  \r\n \r\n a collegiate team environment in which a sense of humour is essential; \r\n training, support and mentorship – every member is encouraged to grow professionally and personally and reach their full potential; \r\n joining an  innovative law firm  committed to the modernisation of the legal profession and making a difference in the community; \r\n establishing positive and long-lasting relationships with clients and others in the conveyancing industry. \r\n \r\n There is scope for the successful applicant, in due course, to take on a leadership role in the settlements team and become an integral part of the firm on a long-term basis.  We expect all of our team members to participate in an aspect of the management of the settlements team and the firm in general. \r\n  Selection criteria  \r\n The successful applicant will :  \r\n \r\n have a bachelor degree from a reputable university, preferably in Law, Arts, Economics, Commerce or Business; \r\n have a commitment to a career in the real estate settlements industry; \r\n demonstrate excellent time management and organisational skills and an ability to work under pressure; \r\n share values with our modern law firm. \r\n \r\n Experience working in a service-industry environment will be highly regarded, but is not essential. No previous experience in real estate settlements is required.  \r\n This position is  not suited  to those whose career goal is that of an admitted legal practitioner. We are looking for a team member who is willing to commit to a long term career in conveyancing. \r\n  Remuneration  \r\n From $55k + super, full-time, depending on experience. \r\n  More information      \r\n \r\n Visit our website to learn  why we’re here  and  what’s important to us . \r\n Telephone Lucy Dickens on 9220 4401 in strict confidence. \r\n \r\n  How to apply       \r\n Applications must be made via our  online application form [click here] . \r\n The online application form will ask you to upload your CV, academic transcript and any other supporting documents. \r\n  Applications close on Friday 8 October 2021.  \r\n We may contact suitable applicants to arrange a brief telephone interview. \r\n Interviews will be conducted early in the week commencing 11 October 2021."
    },
    {
        "job_title": "Litigation Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 24, 2021",
        "company": "Birman & Ride",
        "description": "We need a litigation lawyer to join our team.  \r\n \r\n  1-3 years post-admission experience preferred. Applicants with substantial pre-admission experience are welcome to apply  \r\n  Innovative NewLaw firm specialising in commercial and deceased estate litigation  \r\n  We welcome applications from full-time and part-time (0.8 or more) applicants  \r\n  Attractive remuneration package to be negotiated, based on experience  \r\n \r\n  Who we are  \r\n Birman & Ride is a modern Australian law firm built on NewLaw. We are a tight-knit, multi-disciplinary team of lawyers, legal executives, accountants and software developers. \r\n Our mission is to make quality legal services accessible. Our brands deliver practical, customer-focussed solutions for everyday needs and problems faced by people and businesses. We offer most of our services at fixed prices. We use sophisticated technology and innovative service delivery to overcome traditional barriers to access. \r\n Dispute resolution and litigation services are core business for our firm. We have a highly collaborative approach to our work.  We practise in a broad range of litigation with an emphasis on deceased estate litigation, commercial and civil litigation, property disputes and debt recovery. \r\n We leverage our in-house practice management software ContactsLaw to automate the delivery of services and support our lawyers. \r\n  Who we’re looking for  \r\n We seek an entrepreneurial lawyer to work with us to support and develop our litigation services. Key responsibilities include :  \r\n \r\n managing all aspects of straightforward litigation matters, including court appearances. You will manage client files and relationships from the outset; \r\n undertaking more complex work under supervision; and \r\n contributing to business development. \r\n \r\n This position is a significant opportunity to develop your professional skills and offers potential for leadership and management. \r\n For operational reasons, we may require you to undertake some work in other areas from time to time. \r\n  Selection criteria  \r\n The successful applicant will :  \r\n \r\n be an imaginative and entrepreneurial lawyer; \r\n have a commitment to a career as a litigation lawyer in the private sector; \r\n be keen to embrace technology to enhance the delivery of legal services; and \r\n share values with our modern law firm. \r\n \r\n Applicants with at least 2 years pre or post admission experience in commercial and civil litigation will be highly regarded. \r\n  What we offer  \r\n We will negotiate an attractive remuneration package. \r\n You will be employed on a permanent basis subject to a probation period. \r\n The many good aspects of joining our team include :  \r\n \r\n a collegiate team environment in which a sense of humour is essential and every member is encouraged to grow professionally and personally and reach their full potential; \r\n the ability to contribute to the development of innovative legal software and solutions to modernise the legal profession and make a difference in the community; and \r\n establishing positive and long-lasting relationships with clients and others in the industry. \r\n \r\n We are open to flexible working arrangements in appropriate circumstances. \r\n  More information  \r\n \r\n Telephone  Nigel Siegwart  on 08 9220 4402 in strict confidence. \r\n Visit our website to learn more about  why we are here  and  what’s important to us . \r\n Review the many websites that make up our brands. \r\n \r\n  How to apply  \r\n Applications must be made via our  online application form [click here] . \r\n You will need to address the selection criteria and upload your CV, academic transcript and any other supporting documents. \r\n We may contact suitable applicants to arrange a brief telephone interview."
    },
    {
        "job_title": "Work experience Law graduate or student",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "De Roberto Legal",
        "description": "We are offering a placement for unpaid work experience for a law student (at least 3rd year) or law graduate/PLT placement. \r\n Hours are flexible and will be at least once a week. \r\n References can be provided to you after 8 attendance days. \r\n Your experience with us will cover attending court hearings with our partner, research,  sitting in client consults, completing file memorandums, court documents, viewing video record of interviews, legal letters, archiving, filing and administrative tasks. \r\n Please submit a short cover letter (no more than 1 page) and your CV to  admin@derobertolegal.com"
    },
    {
        "job_title": "Practical Legal Trainee (PLT)",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Appius Lawyers",
        "description": "Appius Lawyers \r\n  PLT Placement – Part-time or Full time  \r\n We are a small suburban law firm seeking proactive graduates looking to commence their 75 days of Practical Legal Training (PLT) placement. \r\n This is an   unpaid position   with an opportunity for the right candidate to grow with us. We are seeking an applicant who can start immediately. \r\n Our practice involves family law, wills & estates, criminal law, contractual disputes including commercial leases, debt recovery, and some litigation. \r\n The right applicant, within the 75 days, will need to be able to review facts/instructions; maintain matters in order; contribute to legal strategy and case theory on new matters. \r\n Proven Strong written and verbal communication skills, the ability to work in a team and independently when required, strong legal research skills with attention to detail, and a positive can-do attitude are essential.  \r\n To apply: Send CV, cover letter, and academic transcript by email to  info@appius.com.au"
    },
    {
        "job_title": "APS 4 - Deputy Associate",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Federal Court of Australia",
        "description": "Position Overview  The Deputy Associate is part of a team who assist the Judge in the day-to-day management of Chambers and Court. The role of the Deputy Associate is to assist the Associate and deputise for them when they are on leave or on circuit. The Judge, in whose chambers this position is located, exercises the Court's general federal law jurisdiction, focusing on judicial review of migration decisions, industrial law and human rights matters together with some consumer and commercial law matters. This position involves no exposure to family law matters. \r\n  Duties  \r\n \r\n Undertake legal research as required by the Judge. \r\n Type judgments and orders. \r\n Court attendance including performance of court officer duties and provision of administrative assistance in the courtroom. \r\n Assist the Associate in the day to day management of chambers including correspondence, liaison with practitioners and court staff, use of court’s case management system, chambers and docket management. \r\n Manage chambers in the absence of the Associate. \r\n Other duties as required. \r\n \r\n  Selection Criteria  \r\n \r\n LLB or graduand with credit plus average. Please attach copies of all academic transcripts. \r\n Demonstrated ability to undertake legal research. \r\n Strong communication (oral and written) and liaison skills with the ability to communicate with people at all levels. \r\n Demonstrated high-level keyboard skills and ability to use relevant software applications including Microsoft Office applications, lotus notes and internet. \r\n Demonstrated organisational skills, including the ability to manage several processes at once. \r\n The ability to adapt to changing situations and priorities. \r\n Tolerance, diligence and the ability to work as member of a small team. \r\n A high standard of ethical behaviour. \r\n \r\n Please note this Judge does not sit in the family law jurisdiction."
    },
    {
        "job_title": "PLT WORK EXPERIENCE",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Staunton & Thompson Lawyers",
        "description": "Our long established (1970) and well-respected general law practice (areas of law include Conveyancing, Leasing, Wills & Probate, Estate Planning, Family Provision, Family Law, Commercial, Debt Recovery, General Civil Litigation, and Criminal) located at Dee Why  in the Northern Beaches of Sydney is currently recruiting PLT Work Experience Placements for 2021/2022  on an ongoing basis.  Starting dates will vary.  Working a minimum of 2-3 days per week on a voluntary unpaid basis. \r\n Placements will be exposed to many aspects of a general suburban law practice including (depending on the Placement’s individual aptitude and skills): \r\n \r\n Legal research, analysis, problem solving, and assisting with client advising; \r\n File management, including electronic storage/archiving, inputting and maintaining accurate client information and communications; \r\n Transactional and litigation document preparation; \r\n Client communications and liaison, including answering enquiries and taking initial instructions; \r\n Occasional court representation in interlocutory listings (with leave of the relevant court) and instructing/attending on Counsel/Principals at court; \r\n General support for our senior lawyers (including our Managing Principal who was formerly a senior Barrister at the NSW Bar); and \r\n Occasionally assisting the Duty Lawyers at the local Northern Beaches Community Legal Centre. \r\n \r\n  We are looking for law graduates who:  \r\n \r\n are highly intelligent and motivated self-starters; \r\n demonstrate good initiative and judgement and, above all, common sense; \r\n are keen to learn; and \r\n have above-average computer skills and academic grades. \r\n \r\n Applications will be considered on a rolling basis and should be sent by email attaching (in Word or pdf) a 1 page cover letter and a CV/Resume document.  Please ensure your cover letter includes your available start date, your preferred days, and how many days placement you can commit to, as well as your availability for interview if you are short-listed. \r\n Applications should be emailed to  Ms   Esther Locker  at   ecl@stlegal.com.au   including “PLT Work Experience Placement Application” in the email subject line."
    },
    {
        "job_title": "NZ - Commercial lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Lance Lawson",
        "description": "Solicitor in Mount Maunganui \r\n Are you a solicitor who has or will recently graduate and are looking to work with an outgoing team who understand work/life balance? The lifestyle in Mount Maunganui is highly envied and provides the best of nature and adventure for you to make the most of. \r\n We are a mid-sized full service law firm with an excellent reputation in our community. We have offices in Rotorua and Mount Maunganui. We pride ourselves on delivering on our “Client Focused, Results Driven” motto and upskilling and developing staff within our firm. We are expanding which means that we have an opportunity for a lawyer to join our busy and varied commercial team who have an excellent client base.  \r\n In joining our team you can expect to: \r\n \r\n Be customer facing, building great relationships with our diverse range of clients; \r\n Have a mix of appropriate autonomy as well as receiving support and guidance when needed from the existing team; \r\n A steady flow of challenging work with an opportunity to grow your practice; and \r\n Work in a modern office environment with a focus on culture. \r\n \r\n Ideally you will have a minimum of 1-2 years’ experience in commercial and property transactions but we are prepared to consider applicants that fit our team culture and have a willingness to develop your skills. \r\n We are looking for a candidate that can hit the ground running, who is motivated to advance their career by working on complex matters, and has a driven can-do attitude. As this role is client facing we require the candidate to value strong relationships with a wide variety of clients. Effective written and verbal communication skills are a must. A candidate with common sense, an ability to learn quickly and fit in with our existing team would be ideal for this busy and collaborative environment. \r\n If you are interested queries can be directed to  jean@lancelawson.co.nz  \r\n Salary will be based on the selected candidate and their experience level."
    },
    {
        "job_title": "Deputy Associate to O'Sullivan J - FCC",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Federal Court of Australia",
        "description": "The Deputy Associate is part of a team who assist the Judge in the day-to-day management of Chambers and Court.  The role of the Deputy Associate is to assist the Associate and deputise for them when they are on leave or on circuit. \r\n  Key Responsibilities and Duties  \r\n \r\n Undertake the Court Officer role. \r\n Assist the Associate in the day-to-day running of chambers including responding to enquiries. \r\n Manage chambers in the absence of the Associate. \r\n Assist the Associate in updating the Court’s case management system and the Judge in the preparation of orders and typing of judgments. \r\n Undertake legal research as required by the Judge. \r\n Other duties as required."
    },
    {
        "job_title": "Law Clerk / PL Opportunity",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Efficient Law Group",
        "description": "Efficient Law Group is a busy and vibrant boutique law firm located in Perth and Bunbury dealing in Family Law, Traffic and Criminal Law, and Wills and Estate. You can find out more on our website:  www.efficientlawgroup.com.au . \r\n   \r\n We have a law clerking opportunity which would suit a law student or someone wanting to complete their work experience component of Practical Legal Training (PLT). The placement is based in Perth, on a full-time or a part-time basis, and commencing immediately.  \r\n   \r\n Your responsibilities will include but not limited to assisting our Solicitors with drafting court documents and correspondence, reviewing documents, undertaking legal research, assisting Solicitors at Court attendances and file management. \r\n   \r\n If you consider yourself suitable for this exciting opportunity, please send us a cover letter, academic record and resume to our Practice Manager, Ms Kellie Edwards via email to   k.edwards@efficientlawgroup.com.au  \r\n \r\n \r\n \r\n   \r\n \r\n \r\n \r\n \r\n   Efficient Law Group   \r\n \r\n \r\n \r\n   efficientlawgroup.com.au"
    },
    {
        "job_title": "PLT Placement / Law Graduate- Part or Full time",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "West Coast Legal",
        "description": "Complete your work experience at West Coast Legal where you will be nurtured and exposed to all areas of Family law. We are a vibrant Family Law firm that prides itself in providing a personal caring service to our clients. We are offering an invaluable opportunity for a graduate to complete their PLT placement on a part or fulltime basis at our Perth City office. \r\n During the placement, the candidate will be exposed to various elements of a law firm and will gain hands on experience and be personally mentored by an experienced Family Law practitioner. This position is unpaid and on a voluntary basis. \r\n The successful candidate will be hard working, have an interest in Family Law and a desire to learn. Applicants with backgrounds in Marketing and Social Media are also strongly encouraged to apply. \r\n A recent comment from our PLT student: \r\n  “   I wanted to again say thank you for giving me the opportunity to complete my placement at West Coast Legal. Not only was my time with you a great learning experience but I also appreciated the warm welcoming feeling I received on a daily basis. I feel truly blessed to have obtained a placement with you.”  \r\n Also see our Google reviews from our very large number of satisfied clients. \r\n How to Apply: \r\n Please direct all enquiries to Tannis Arnold and forward your application including a cover letter, CV and academic transcript by email to  tarnold@westcoastlegal.com.au"
    },
    {
        "job_title": "Paralegal / PLT / Junior Lawyer",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Law Team",
        "description": "We are looking for an individual with personal drive to assist in all aspects of a growing commercial and property practice.  You will be working predominantly with the director and be under her guidance in the commercial arm of our growing firm.    \r\n You must have: \r\n \r\n strong legal drafting skills, with the ability to think through all aspects of a commercial matter to prevent problems occurring in the future; \r\n excellent communication skills (written and verbal), with the ability to explain complex matters in simple and easy to understand language; \r\n great interpersonal skills, excellent computer skills (including knowledge of Word), and the personal interest to grow your career with the growth of our firm. \r\n \r\n  Together with your resume please provide specific examples of one or more of the following: \r\n \r\n how you think outside the box in the particular context of a commercial transaction; \r\n where you have used client / customer relationship skills to build and grow a relationship; and \r\n where you have adapted your skills to a job or area outside your normal expertise;  together with \r\n an explanation of your career goals and the type of law you would like to practice.  \r\n \r\n This position is based in our Erina office on the Central Coast of NSW.  The position may be full time or part time balancing the needs of the business and the applicant.  We are looking for a long term member of our team. \r\n Law Team has a strong connection to helping our team be the best version of themselves. We understand that each individual who works with us needs to value the work that they do, and we provide a supportive environment to allow our team to develop personally and professionally.  Our team works collaboratively for best outcomes for our clients.  The concept ‘prevention is better than cure’ is at the heart of the work we do in all of our practice of the law."
    }
][
    {
        "job_title": "Practical Legal Training (PLT)",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Agape Henry Crux",
        "description": "Agape Henry Crux  is an innovative law firm in Sydney CBD with exclusive practice in Immigration and Administrative Law. We are a collegiate team, passionate and results-driven. We pride ourselves in thinking outside the box, we embrace the use of technology and digital automatisation to assist our naturally lazy self. \r\n We also have a young dynamic team promoting a fun working environment to enhance employee experience. We bring everyone closer together with regular social catch ups, PS4 and so much more. At Agape we position ourselves to be different to other firms in the industry, we keep our teams small to allow everyone to grow fast and provide opportunity to allow each and every one to step up making an impact in what we do. Our firm consists of 2 accredited specialists in immigration law (41 in NSW only), we are committed to our new talents and support the learning you need to grow.    \r\n  The Position  \r\n We are currently offering the last intake of the year for work experience placement as a component of Practical Legal Training (PLT). Depending on each individual growth and development during your placement at Agape, we are open to discussing a career progression post the 14 weeks program. As there are limited immigration legal practitioners within this industry, we commence selecting our team carefully, putting particular emphasis on culture where the necessary skills are progressively groomed under a mentorship program. We advertised throughout the year as we are always opening doors to new talents and creating positions. To see a day in our lives, check out our Instagram page @agape_henry_crux \r\n  The ideal candidate should:  \r\n \r\n Recently completed/ final year law degree \r\n Possess a strong interest in migration/administrative law \r\n Be motivated, pro-active, can-do attitude \r\n Have strong problem-solving skills \r\n Display good organisation and time management skills \r\n Ability to work independently and in a team \r\n \r\n  Making an application:  \r\n To learn more about this opportunity or to make an application, please send your CV with a cover letter to  talent.acquisition@ahclawyers.com"
    },
    {
        "job_title": "Graduate Law Student",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "ERA Legal",
        "description": "About us  \r\n ERA Legal is a law firm based in Sydney and Melbourne.  ERA Legal specialises in restructuring and insolvency, construction and projects, loans and securities, and dispute resolution.  \r\n We only do what we are good at – which means, this is a perfect place to hone your skills and learn from experienced senior lawyers.  We invest in our people and offer opportunities for mentoring, further learning, and career progression.  \r\n  About the team  \r\n The Construction and Projects team specialise in advising trades, builders, developers and occasionally home owners, on: \r\n \r\n documenting construction projects and assisting in risk allocation by advice on transactions (i.e. construction contracts) \r\n advice on risk management and dispute avoidance through advice and assistance with the administration of contracts; \r\n payments disputes under the  Security of Payment  legislative regimes in New South Wales and occasionally in Victoria and Queensland; and \r\n the resolution of a wide range of disputes in the construction industry. \r\n \r\n  About the role   \r\n Due to progressive growth, we are looking for a  graduate law student  to join our  Commercial & Projects  team based in  Sydney office.  This role gives you the opportunity to learn and to work directly with our construction practice-leaders and other experienced senior lawyers. This is a great pathway to navigate your career in commercial arena. \r\n  What we are looking for  \r\n \r\n We are looking for a full-time graduate law student in their penultimate year of university to work on a range of back-end and front-end construction matters.  \r\n Opportunity for career progression to lawyer and beyond. \r\n Must have strong: research skills, time management and organisation skills, ability to work autonomously, and a desire to learn.  \r\n \r\n   Apply today  \r\n Applications close on  1 November 2021 .  Please email with your latest resume with transcript to  law@eralegal.com.au  and  Shereen.Kumar@eralegal.com.au ."
    },
    {
        "job_title": "Practical Legal Training (PLT) / Student Placement - Volunteer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "White Knight Lawyers",
        "description": "Our firm  \r\n White Knight Lawyers is a rapidly growing Australian law firm which offers premium litigation, transactional, and advisory legal services. \r\n We generally practice in litigation and dispute resolution, insolvency and bankruptcy, tax controversy, commercial law and advisory, public law and construction law. \r\n We are currently engaged in diverse ongoing litigation work including proceedings before the Supreme Court of NSW and Supreme Court of Victoria, District Court of NSW, Federal Court of Australia, AAT, and NCAT (both original jurisdiction and appeal panel).   \r\n We pride ourselves on the quality of our work, developing relationships of trust with our clients, and efficiently delivering engagement-tailored legal services.  \r\n  Our available role  \r\n We are very excited to offer practical legal training to a recent law graduate on a volunteer basis.  \r\n We expect that you will be honest, diligent, and enthusiastic when carrying out the following tasks and responsibilities, amongst others: \r\n \r\n Attending client meetings and court hearings and taking minutes and file notes respectively. \r\n Assisting in the preparation of internal processes, procedures, policies, guidelines and protocols. \r\n Assisting in the preparation of precedent documents and checklists. \r\n Drafting publications and legal updates on topical legal issues across a wide range of areas of law. \r\n Undertaking legal research and drafting research memorandums. \r\n Drafting statements of claim, affidavits, and other forms and processes.  \r\n Administrative assistance including file management, diary maintenance, and office management. \r\n \r\n  About you  \r\n You must be committed to establishing a career in commercial private legal practice and have a keen interest in litigation and dispute resolution.  \r\n You must have a proven record of legal ability, whether by way of your academic success, prior industry experience, or relevant extracurricular activities.    \r\n  Your application  \r\n If you are interested in the above, then please email us your curriculum vitae, academic transcripts, and a sample of your writing (preferably one (1) academic piece and one (1) creative piece)."
    },
    {
        "job_title": "Family Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Cominos Family Lawyers",
        "description": "We are growing! \r\n An exciting and rare opportunity has opened for a Family Lawyer to join our vision and value based legal practice.   \r\n If you have at least 3 years Post Admission Experience and if you love family law, enjoy working in a cohesive and healthy work culture, and you are driven to achieve and deliver quality legal services. \r\n Then please send us your resume! \r\n  careers@cominoslawyers.com.au"
    },
    {
        "job_title": "Immigration Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Kah Lawyers",
        "description": "IMMIGRATION LAWYER  \r\n Kah Lawyers is one of Western Sydney's leading boutique Immigration law firms and is based in Parramatta CBD. Our principal lawyer is an accredited specialist in Immigration Law and has almost 25 years' experience. \r\n Our firm provides legal advice in all immigration matters including partner, employer sponsored, independent, skilled, family and refugee visas, cancellations and complex matters including AAT and Federal court work. \r\n Our lawyers are individuals who are passionate, committed, motivated and high-achievers from diverse backgrounds. We all share the same belief and our success is built on a foundation of diversity and inclusiveness. \r\n We have an exciting new opportunity for an immigration lawyer to join our busy practice. This is a full time position for the right candidate. \r\n  Job description  \r\n \r\n You will be involved in all aspects of law within the immigration portfolio. This will include but not limited to temporary and permanent visa applications including visa cancellations \r\n Administrative Appeals Tribunal applications \r\n Drafting, submissions and appearances; judicial review proceedings in Australia's Federal Circuit Court and Federal Court \r\n Advice and assistance with Ministerial intervention requests \r\n Have the ability to analyse and determine visa solutions \r\n The ability to advise and manage clients from beginning to the end of the visa process \r\n Conveyancing and wills and Estate work also possible \r\n \r\n     \r\n  Suitable candidates will have  \r\n \r\n Experience in preparing migration applications in all visa categories \r\n Ability to research legislative, policy and case law \r\n Ability to draft documents for the AAT \r\n Excellent interpersonal skills \r\n Excellent drafting skills \r\n Able to work independently and as part of a team \r\n At least two to three years' immigration experience \r\n Experience with LEAP Migration Manager an advantage \r\n A second language may be an advantage \r\n \r\n The successful candidate will be working alongside a highly regarded accredited specialist. \r\n Our firm offers internal/external training, mentoring from senior lawyers and professional development. Flexible work arrangements is available upon request. \r\n Please email your resume to michael@kahlawyers.com.  Be sure to include your academic transcript and a cover letter explaining your interest in the role. \r\n Salary will be commensurate with experience."
    },
    {
        "job_title": "PLT Part Time",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Keith R Cameron Solicitors",
        "description": "Keith R Cameron Solicitors is a boutique firm in Hampton, Victoria with availability for PLT students for 15 day placements.  \r\n The firm practices in a number of areas including Property & Conveyancing, Wills & Estates, Family Law and Litigation, as well as miscellaneous legal matters. \r\n The ideal candidate would have the following qualities: \r\n \r\n Strong verbal and written communication skills \r\n Strong computer skills \r\n Attention to detail \r\n Excellent time management \r\n \r\n The position will involve the following duties: \r\n \r\n File management \r\n Client contact \r\n Legal research \r\n Direct support to the principal  \r\n \r\n Please note part time positions are available commencing October 2021 (subject to COVID restrictions) \r\n Please send your academic transcript, resume and available dates to  office@kcsolicitors.com.au"
    },
    {
        "job_title": "Junior Family Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Johnstone and Reimer Lawyers",
        "description": "Our Lilydale based firm has a need for a junior family lawyer who is looking for a varied and fulfilling role in a supportive, positive workplace. \r\n The successful applicant would join our busy family law team working under a senior lawyer handling family law files. \r\n The successful applicant will have an outgoing, caring, and compassionate personality and a genuine interest in family law. \r\n Further, excellent written skills are required with a strong attention detail, along with an ability to work efficiently. Excellent time management skills are a must. \r\n The characteristics we most value in an applicant are a proven strong work ethic and \"can do\" attitude. \r\n While this role is suitable for a recently admitted lawyer, a graduate pre-admission may be considered if they have strong relevant experience in family law. \r\n This role will be based at our Lilydale office, however there will be an expectation that the successful applicant be willing to work at least one day a week from our Berwick office in Melbourne's South Eastern suburbs. \r\n Apply today by uploading a cover letter and resume."
    },
    {
        "job_title": "PLT Placement - Family Law",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Hogg and Associates Lawyers",
        "description": "Hogg and Associates Lawyers is a boutique Family Law firm in the Summer Hill Village in Sydney’s Inner West. \r\n We are currently offering a work experience placement, which would be suitable as a component of Practical Legal Training (PLT). The placement is voluntary and is offered on a part-time basis (2-3 days per week). \r\n Your responsibilities may include: \r\n \r\n Assisting our solicitors with drafting court documents and correspondence, \r\n Assisting solicitors at court attendances, \r\n File management and preparation of briefs for hearing, \r\n Reviewing documents, \r\n Undertaking legal research, \r\n Drafting articles, and \r\n General administrative tasks. \r\n \r\n The successful candidate will have; \r\n \r\n Completed Bachelor of Laws (or have almost completed the same) \r\n A keen interest in Family Law, \r\n Completed studies in Family Law, \r\n Excellent attention to detail, \r\n An ability to follow instructions, \r\n Excellent verbal and written communication skills, and \r\n A willingness to help and assist clients and staff with any tasks as required. \r\n \r\n At Hogg and Associates Lawyers, we enjoy working with the students who complete their Practical Legal Training with us and will strive to provide you with valuable experience to set you up for your legal career. \r\n You can find out more about our firm at  www.hogglawyers.com.au .  \r\n To apply, please send your CV together with a one page covering letter addressed to  \r\n Elizabeth Hogg \r\n at the email address provided.  \r\n Applications close 14 October 2021"
    },
    {
        "job_title": "NZ - Practising Graduate",
        "job_type": "Contract",
        "date_posted": "Sep 23, 2021",
        "company": "Emerald Green Investments",
        "description": "Looking for a graduate who is familiar with Wills and has an interest in the structure of Wills  and Trust Law to work on a small to medium project.  \r\n For more information, call Mark on 0212618304."
    },
    {
        "job_title": "Junior Property Lawyer",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "Coombes Property Group",
        "description": "We are looking for a final year law student who is a commercially minded, well rounded, and dedicated professional who is passionate about property. This role will initially be part-time until February 2022, when it will pivot to a full-time role. The selected candidate will work closely with our experienced General Counsel and the wider business in the areas of lease and landlord management."
    },
    {
        "job_title": "Leader, Wills & Estates team and Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "LadyBird Law",
        "description": "STUDENT PLACEMENT - KEY LEARNING OPPORTUNITIES   \r\n \r\n Learn the overall working of a Wills and Estate Planning business \r\n Exposure to the LadyBird Conveyancing \r\n Test the waters to see if this is the career pathway for you! \r\n \r\n   PRIMARY WORK EXPERIENCE PLACEMENT FUNCTION & TASKS  \r\n \r\n Get exposure to all phases of the business – Prospecting, Preparation for meeting with clients, Meeting with clients, Core work, and all administration phases post the final meeting \r\n Manage all enquiries/referrals into our custom-built software and industry software LEAP and maintain all elements relating to the client journey. \r\n Send initial letters from LEAP to the client with Trust Account authorities \r\n Set up client zoom and face to face meetings and issue relevant letters and advice through the client’s journey. \r\n Create invoices in LEAP, issue draft invoices to the client and receipt in LEAP any monies received into trust \r\n Drafting of Wills, Enduring Power of Attorney’s (EPOAs), Statutory Declarations and Advance Health Directives. \r\n Completion of Binding Death Benefit Nomination Forms for Super/Insurance \r\n Send final letter to the clients with a copy of their documents \r\n Manage the archiving process. This includes a wide variety of basic administration activities through to preparing security envelopes and updating our software with executors and beneficiary details. \r\n \r\n   HOW TO APPLY   \r\n \r\n Send your CV with a covering letter to Amy at (amy@lblaw.com.au) outlining:\r\n \r\n Your motivation to apply and relevant experience. \r\n Your availability (i.e., days of the week, and how many weeks). \r\n \r\n \r\n You may make enquiries by calling Amy on 0498 043 405."
    },
    {
        "job_title": "Intern",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "No Borders Law Group",
        "description": "Interns to gain legal knowledge   \r\n We are a legal practice which has specialised in Australian migration law for over 20 years.  Over the years we have assisted a multitude of clients and businesses and mentored many lawyers and paralegals, many of whom have become accomplished immigration lawyers themselves.   \r\n We currently offering unpaid internship for students who require to meet the PLT placement requirement. \r\n No Borders Law Group is an exciting, fast spaced and dynamic legal firm  where we value our clients. \r\n See you soon. \r\n  reception@nobordersgroup.com.au"
    },
    {
        "job_title": "Graduate Lawyer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Dwyer Harris",
        "description": "Dwyer Harris is a business law firm in North Sydney. Our main areas of practice include: \r\n \r\n Banking, financial services and credit. \r\n General corporate and commercial. \r\n Business regulation and compliance. \r\n Competition and consumer law. \r\n \r\n We are seeking a graduate lawyer for a full-time role to work on a range of business law matters such as: \r\n \r\n Regulatory advice, particularly in relation to credit and financial services and competition and consumer law. \r\n Corporate/commercial advice and transactions. \r\n Dispute resolution. \r\n \r\n The role would also involve assistance with business development including research and writing articles and preparing presentations. \r\n The successful candidate will have: \r\n \r\n A strong academic record. \r\n An interest in financial services, competition and consumer law (study of these subjects in your degree would assist). \r\n Technical competence. \r\n Drafting accuracy and attention to detail. \r\n Excellent written and oral English. \r\n Client relationship and business development skills. \r\n Ability to work in a team and willingness to learn. \r\n \r\n Previous work experience would be an advantage. \r\n Please send your covering letter and your resume to admin@dwyerharris.com \r\n Only shortlisted candidates will be contacted."
    },
    {
        "job_title": "EOI - Independent Contractor -Oral Assessors, Workshop Facilitators and Online Mentors - QLD",
        "job_type": "Contract",
        "date_posted": "Sep 23, 2021",
        "company": "The College of Law",
        "description": "Practical Legal Training Independent Contractor - Oral Assessors, Workshop Facilitators and Online Mentors The College of Law Queensland invites expressions of interest    \r\n  Expressions of Interest Sought  The College of Law invites expressions of interest from suitably qualified legal practitioners who wish to be engaged as oral assessors, workshop facilitators and online mentors as described below. Engagement in these Independent Contractor roles is conducted on an as needs and when required basis. \r\n  The requirements  Oral Assessors, workshop facilitators and online mentors are responsible for providing students with a high quality learning experience whilst they are completing their PLT. \r\n \r\n  Oral Assessors  are responsible for assessing students periodically throughout their PLT courses via video and or tele conference. Assessors are engaged on half or full day basis. \r\n  Workshop facilitators  are responsible for facilitating students’ teaching and learning during the face-to-face one week professional skills course that is delivered at the beginning of each intake. Engagement may be for one or more half or full day workshops for one or more of the professional skills courses. \r\n  Online Mentors  are responsible for providing feedback on coursework submission s and otherwise mentoring students during their PLT Program. \r\n \r\n We are currently looking to engage a number of adjunct lecturers for our Queensland Practical Legal Training program. Teaching would be on an as and when required basis and both face to face and online. This is an opportunity to work flexibly as part of a dynamic and highly engaged team. \r\n  Required qualifications and experience:  \r\n \r\n Admission as an Australian Legal Practitioner \r\n Minimum 5 years’ experience in legal practice \r\n Demonstrated aptitude for teaching \r\n Enthusiasm for the development and continual improvement of teaching skills \r\n Demonstrated ability to work cooperatively with colleagues in a team \r\n An enthusiasm for the practice of law and an ability to communicate that enthusiasm \r\n An understanding of the strategic context of the legal profession and its associated industries \r\n Excellent communication skills, both oral and written \r\n Demonstrated capacity or willingness to contribute to the creation and maintenance of course materials (multi-media and online), stakeholder liaison and project management \r\n Sound project management skills with demonstrated ability to multi-task and achieve priorities within tight timelines \r\n Awareness of educational technologies including online delivery \r\n Proficiency in use of MS Office \r\n \r\n Independent contractors must have an Australian Business Number (ABN). \r\n If you are interested in being part of a growing national operation, please email your resume and covering letter to  hr@collaw.edu.au by COB 29 September 2021"
    },
    {
        "job_title": "Paralegal",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Criminal Law Group",
        "description": "Criminal Law Group is a boutique law firm in the heart of Liverpool specialising in Criminal Law. \r\n We are seeking a PLT Candidate to complete the work experience component of the PLT program.  \r\n The full-time placement is unpaid and available immediately with potential employment opportunity as a junior solicitor after admission.  \r\n If you are interested in challenging tasks, working in fast pace while learning new skills, then this is the position for you! \r\n  Job tasks and responsibilities will include  \r\n \r\n Appear in Court. \r\n Instruct Counsel in various types of matters in a range of jurisdictions. including Local Courts, District Courts and Supreme Court. \r\n Travel to and from various Courts \r\n Liaise with various members of the profession as well as clients and others on a regular basis. \r\n Conference clients  \r\n Legal research.  \r\n Summarise and prepare briefs.  \r\n \r\n  Skills and experience  \r\n \r\n Excellent communication skills (both written and oral) \r\n Work well under pressure \r\n Attention to detail  \r\n Be organised and able to maintain professionalism  \r\n Ability to maintain tidy files"
    },
    {
        "job_title": "PLT Placement - Full time/Part time Unpaid",
        "job_type": "Part-time",
        "date_posted": "Sep 23, 2021",
        "company": "NS Legal Pty Ltd",
        "description": "About Us  \r\n We are a young and growing law firm in the heart of Sydney CBD. \r\n We are committed to providing high-quality legal services to clients in Australia and abroad in all major areas, including Property Law, Divorce & Family Law, Civil Disputes, Litigation, Commercial Law, Wills and Estates. We use ingenuity & creativity to best address our clients’ needs and work to rigorously achieve their goals. \r\n We are excited to offer practical legal training placement on a volunteer basis in our Sydney Head Office. The role will suit a penultimate/final year law student or recent graduate and is available immediately. \r\n  Main Duties/Responsibilities  \r\n \r\n You will be assisting the principal solicitor with a full range of services across a number of areas, such as Commercial (general advisory), Family Law, Conveyancing/property law, and Immigration law. \r\n Conducting legal research, handling legal documents, file administration and assisting in a general carriage. \r\n Managing the progress of client files, leaving file notes and meeting deadlines. \r\n Keeping up to date with policy, regulation, and industry changes. \r\n \r\n  You bring to the role  \r\n \r\n Penultimate or final year of a law degree of an Australian law school (LLB or JD). \r\n Be able to work at least 2 days a week. \r\n Experience with Leap and PEXA preferred. \r\n Prior experience with conveyancing or knowledge of property law will be highly regarded. \r\n A good understanding of legislation and legal research skills. \r\n Fluent English, especially in legal writing, and ideally fluent Mandarin/Cantonese Speaking. \r\n \r\n If you're interested in the position– please send your cover letter, resume and academic transcript to  info@nslegal.com.au"
    },
    {
        "job_title": "Training Officer",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Department of Justice and Attorney General, Queensland",
        "description": "An exciting opportunity is currently available to join the Dispute Resolution Branch’s Training Team in the role of  “ Training Officer  ” as part of the Department of Justice and Attorney General, Queensland Government.   The current vacancy is for a Full time flexible (Permanent position) based in Brisbane, Queensland.   \r\n For more information including an in depth description of the role description, merit criteria and how to apply , please visit the following link:  Job search | Employment and jobs | Queensland Government (smartjobs.qld.gov.au) . or c/or url:  https://smartjobs.qld.gov.au/jobs/QLD-384196-21  \r\n Applications will close on   Monday,      September 13 th , 2021  .  \r\n The Dispute Resolution Branch is a Recognised Mediator Accreditation Body (RMAB) pursuant to the NMAS and delivers a wide range of training and professional development courses relating to mediation, conflict management, effective communication and conflict coaching. \r\n This opportunity may be of interest to your networks. \r\n Should you wish to make any further enquiries, please feel free to contact the Dispute Resolution Training Team c/o:  07 3738 7017 or via email  trainingdrb@justice.qld.gov.au"
    },
    {
        "job_title": "Junior Solicitor",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "Bransgroves Lawyers",
        "description": "Bransgroves Lawyers is a boutique law firm (10 staff) that specialises in acting on banking and finance transactions and finance-related litigation in the Supreme Courts of NSW, Qld and Vic.  \r\n  By joining our merry band you are signing up to fast track your career. We have a very flat structure and the emphasis is to get you running your own matters (under supervision, of course) as soon as possible. Two of our partners are published legal academics. We are known throughout the industry as being highly competent due to our strong emphasise on the legal research and staff training. This makes you not only highly skilled very quickly but makes you eminently employable. Your practical legal education will continue as quickly as you can learn as our senior partners (who have been at the firm for 20 and 16 years respectively) delight in mentoring the next generation of top lawyers.  \r\n  Most solicitors in our firm work 3 days in the office and 2 days at home. However we have 3 full time staff who never come in. We are a virtually a virtual firm, during Covid lockdowns we all work from home. Due to the wonders of Zoom, PEXA and other cloud based systems we are 100% paperless and all our work is done through Chrome.  \r\n  We only maintain offices so that our solicitors can have social interaction and get away from home when they have cabin fever. We have physical offices in Sydney's MLC building, Northbridge (NSW) and on the Sunshine Coast.  \r\n  We have weekly Zoom meetings and an annual boat party. We are very busy and looking for bright and ambitious solicitors to help us grow. You will be running your own cases and handling your own client portfolio within two years and within 3-4 years you will be on a six figure salary.  \r\n  Our 5 partners are leaders in their field and make top class mentors. We are open to solicitors who are interstate working 100% from home. Our flexible arrangements suit parents and students (we have three parents).  \r\n  Once you are up and running (around six months) in addition to your base we will also pay a percentage of your recovered fees to you as a bonus. This is calculated and paid weekly.  \r\n  This position would suit a law graduate, up to 4 year PQE or person returning to the law after a long hiatus. Your starting salary will be negotiated based on your experienced. The nature of our work is that there are plenty of things you can do with little or no skill (following our procedures manual and automated checklists), then as you progress you gradually absorb more and more of the law and a deeper understanding of what you are doing. This allows you to progress onto more complex and challenging work.  \r\n  The wand chooses the wizard and the lawyer chooses the firm…"
    },
    {
        "job_title": "Trainee Law Clerk, Conveyancer, Probates",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "MDH Legal Pty ltd",
        "description": "We are small practice in Osborne Park and would welcome a fulltime staff member (ideally) or possibly 2 job share roles (must be able to work school holidays full time) to join our team. We have a large conveyancing practice, wills and probate. The position is elementary and training will be provided. Advantage to persons with experience in property law, conveyancing, PEXA and Settlements Plus. Salary reflective of role and position. Full time trainee anticipated at $40,000k plus super and entitlements. Opportunity for quick development and salary increase."
    },
    {
        "job_title": "Opportunity for a bilingual PLT",
        "job_type": "Full-time",
        "date_posted": "Sep 23, 2021",
        "company": "STC Lawyers and Associates",
        "description": "STC Lawyers is a boutique law firm located in Hurstville that predominately specialises in Migration Law and other types of transaction legal services such as property conveyancing. \r\n We currently offer an opportunity for PLT placement with an offer to extend to a part time/full time role for the right candidate.  \r\n Office hours: Monday to Friday 10am to 7.30pm \r\n What we offer: \r\n \r\n PLT work experience under principal lawyer. \r\n Opportunity to be offered a full time paralegal/junior solicitor role. \r\n Opportunity to work in a transactional type/business orientated law firm. \r\n Opportunity to learn under an Immigration legal expert. \r\n Exposure to high net worth individuals and corporate clients. \r\n Strong local and international resources for an ambitious candidate to grow alongside the firm. \r\n \r\n Required Skillsets: \r\n \r\n Fluent in English and Mandarin Chinese \r\n Highly organised and attention to detail \r\n Ability to work independently without supervision \r\n Prior experience in Immigration, property or family law preferred (not mandatory) \r\n Experience in marketing/sales/website management also preferred \r\n Have common sense and basic Microsoft experience including word, excel, email etc \r\n \r\n Job description: \r\n \r\n Conduct legal research on complex law cases. \r\n Assist senior lawyer to draft legal submissions for a wide range of case types. \r\n Attend tribunal hearings, property settlements and other legal errands. \r\n Prepare, draft and organise application forms and required documentation. \r\n Independently manage cases, including liaising with client for required documentation from beginning to end of a legal matter. \r\n Able to professionally communicate with clients from both office walk in and via e-mail or phone. \r\n Provide other admin support as necessary, including assistance with marketing brochures, client alerts, legal regulation/policy updates, translations, website & media updating. \r\n \r\n For interested candidates, please send through your CV, academic transcripts to  Info@stc-lawyers.com ."
    }
]